{
  "slug": "content-management",
  "createdAt": "2021-07-12T22:08:21.501Z",
  "title": "Cómo crear y organizar el contenido de un producto digital",
  "description": "<p>En este curso entenderás cómo la organización del contenido mejora la\nexperiencia de los usuarios.</p>\n",
  "tags": {
    "secondary": {},
    "primary": {}
  },
  "targetAudience": "",
  "dependencies": "",
  "learningObjectives": "<ul>\n<li>Qué es arquitectura de la información</li>\n<li>Cómo llevar a cabo una actividad de card sorting</li>\n<li>Cómo crear user flows</li>\n<li>Cómo prototipar y probar contenidos</li>\n</ul>\n",
  "product": "",
  "syllabus": {
    "00-information-architecture": {
      "title": "Arquitectura de la Información",
      "bonus": false,
      "description": "<p>Aprende a organizar la información y contenido del producto de una manera\neficiente y relevante para el usuario. Conoce técnicas y herramientas que te\nayudarán a entender mejor los modelos mentales de los usuarios al utilizar un\nproducto.</p>\n",
      "parts": {
        "00-information-architecture": {
          "title": "Arquitectura de la Información (AI)",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/TbEfjaE94sU",
              "id": "TbEfjaE94sU"
            },
            {
              "type": "video",
              "provider": "vimeo",
              "href": "https://vimeo.com/168194951",
              "id": "168194951"
            }
          ],
          "body": "<p>Según <a href=\"https://www.iainstitute.org\" target=\"_blank\">The Information Architecture Institute</a>, la\narquitectura de información es la práctica de decidir cómo organizar las partes\nde algo para que sea comprensible.</p>\n<p>Si tomamos esta definición como base, podemos decir que todo es organizable con\nla arquitectura de la información. Por ejemplo, pensemos en una tienda de ropa.\nEn la tienda tienen muchas pilas de ropa y, si vas a comprar algo,tendrías que\nsumergirte y buscar mucho hasta encontrar lo que deseas. Más aún, si en la pila\nde ropa hay muchos tipos de prendas como pantalones, blusas, shorts, vestidos,\netc.</p>\n<p><img src=\"https://lh3.googleusercontent.com/PCPqvsj2QkC0PZAOw6KdYSzj7QN_Wm-GpkWfUTRjkwCscmHfG1NnJTiycXc3yu7bB7bID2R8HdHVcCWurvdfx19IIBrDh8Iek481U4WpyGFp3YAmLm7NCYcZTqsuYlpmEDIIzJM-QT8\" alt=\"Pila de ropa\"></p>\n<p>Pensando en esa tienda, realiza el siguiente ejercicio: <strong>¿cómo ordenarías la\nropa de mujer de esa tienda para que sea fácil de encontrar?</strong></p>\n<p>Puedes ver el siguiente:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/TbEfjaE94sU?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Para entender el concepto de Arquitectura de la Información y leer el\n<a href=\"https://theblog.adobe.com/a-beginners-guide-to-information-architecture-for-ux-designers/\" target=\"_blank\">siguiente artículo</a>\npara profundizar en el concepto. (borrador del artículo, revisar para corregir\ncomentarios y publicar).</p>\n<h2 id=\"contexto-contenido-usuarios\">Contexto, contenido, usuarios</h2>\n<p>Para la Arquitectura de la Información es muy importante tener en cuenta estos 3\nconceptos:</p>\n<h3 id=\"contexto\">Contexto</h3>\n<p>El contexto es súper importante. Por ejemplo, será distinta la información que\nbusque o necesite un usuario que está comprando un auto nuevo versus uno que ya\ntiene un auto y está buscando los servicios de la concesionaria. También, el\ncontexto incluye lo objetivos comerciales de la empresa. Por ejemplo, el\nobjetivo puede ser vender más o fidelizar más o mejorar la imagen de una marca.\nOtras variables que tiene en cuenta el contexto son: política, cultura,\ntecnología, restricciones.</p>\n<h3 id=\"contenido\">Contenido</h3>\n<p>El contenido es finalmente lo que le vamos a mostrar al usuario y es igual de\nimportante. En este caso tenemos que tener en cuenta también las estructuras que\nya existen. Por ejemplo, si ya tenemos una base de datos estructurada, qué y\ncómo podemos mostrar los datos que provengan de ahí. El volumen también es\nrelevante. Si tenemos un gran volumen de contenido por mostrar, ¿cómo\npriorizamos? ¿Le mostramos todo al usuario?. También tiene que ver el tipo de\ncontenido que vamos a mostrar. Por ejemplo, es distinto mostrar un texto, que\nuna imagen o una infografía o un video.</p>\n<h3 id=\"usuarios\">Usuarios</h3>\n<p>Los usuarios también son una parte fundamental. Por algo estamos trabajando en\nexperiencia de usuario. Al trabajar la arquitectura de información tenemos que\ntener en cuenta a nuestros usuarios y cuáles son las tareas que espera realizar\ncon nuestro producto, cuáles son sus necesidades, cómo es su comportamiento al\nbuscar información, y qué tan experimentado es con productos digitales.</p>\n<p><img src=\"https://theblogimages.adobe.com/wp-content/uploads/2017/11/image21-a-beginners-guide-e1510846719140.png\" alt=\"Contexto, contenido, usuarios\"></p>\n<h2 id=\"componentes-de-la-arquitectura-de-la-información\">Componentes de la Arquitectura de la información</h2>\n<p>Según <a href=\"https://www.amazon.com/Information-Architecture-World-Wide-Web/dp/0596527349/ref=asap_bc?ie=UTF8\" target=\"_blank\">Lou Rosenfeld y Peter Morville</a>\nlos componentes claves de la AI son:</p>\n<ul>\n<li>Esquemas de organización y estructuras: cómo categorizamos y estructuramos la información.</li>\n<li>Sistemas de etiquetado: cómo etiquetamos el contenido que presentamos.</li>\n<li>Sistemas de navegación: cómo los usuarios .navegan o se mueven a través de la información</li>\n<li>Sistemas de búsqueda: cómo los usuarios buscan información.</li>\n</ul>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://blog.acantu.com/que-es-arquitectura-informacion/\" target=\"_blank\">Qué es: Arquitectura de Información (IA)</a></li>\n<li><a href=\"https://www.hiberus.com/crecemos-contigo/como-definir-la-arquitectura-de-la-informacion-de-un-proyecto/\" target=\"_blank\">Cómo definir la arquitectura de la información de un proyecto</a></li>\n<li><a href=\"https://www.usability.gov/what-and-why/information-architecture.html\" target=\"_blank\">Information architecture basics</a></li>\n<li><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://player.vimeo.com/video/168194951?title=0&amp;byline=0&amp;portrait=0\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></li>\n<li><a href=\"http://www.icrossing.com/la/ideas/aprendizajes-del-isa-2015-sobre-arquitectura-de-la-informaci%C3%B3n\" target=\"_blank\">Aprendizajes sobre arquitectura de la información</a></li>\n<li><a href=\"https://www.amazon.com/Information-Architecture-Beyond-Louis-Rosenfeld/dp/1491911689/ref=sr_1_1?ie=UTF8&amp;qid=1519138195&amp;sr=8-1&amp;keywords=information+architecture&amp;dpID=51gpnrSXHHL&amp;preST=_SY291_BO1,204,203,200_QL40_&amp;dpSrc=srch\" target=\"_blank\">Information Architecture: For the Web and Beyond</a></li>\n<li><a href=\"https://www.pluralsight.com/courses/information-architecture-introduction-2548\" target=\"_blank\">Information Architecture</a></li>\n<li><a href=\"https://theblog.adobe.com/a-beginners-guide-to-information-architecture-for-ux-designers/\" target=\"_blank\">A Beginner’s Guide to Information Architecture for UX Designers - Nick Babich</a></li>\n</ul>\n",
          "order": 0,
          "durationString": "1h"
        },
        "01-card-sorting": {
          "title": "Card - sorting",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=TbEfjaE94sU",
              "id": "TbEfjaE94sU"
            }
          ],
          "body": "<p>El card sorting es una técnica que nos permite saber, desde el lado del usuario,\ncuál sería la mejor manera de organizar la información que tenemos. Es una\ntécnica común cuando hablamos de organizar el contenido para un producto\ndigital.</p>\n<p>Existen 3 tipos de card-sorting:</p>\n<ul>\n<li>Abierto: los participantes agrupan las tarjetas en categorías y crean nombres\npara las categorías</li>\n<li>Cerrado: los participantes agrupan las tarjetas, pero dentro de las categorías\npreviamente definidas por nosotros</li>\n<li>Híbrido: los participantes agrupan las tarjetas dentro de las categorías\ndefinidas por nosotros, pero tienen la libertad de crear nuevas categorías si\nlo encuentran necesario.</li>\n</ul>\n<p>Para realizar una sesión de card sorting primero tenemos que hacer un inventario\ndel contenido que tenemos. Luego de eso, si es que tenemos mucho contenido,\nnecesitamos decidir si le vamos a dar todo el contenido al usuario o si solo\npriorizaremos algunos. Después, podemos escribir estos contenidos en post-its,\nimprimirlos o usar una herramienta como <a href=\"http://optimalworkshop.com/\" target=\"_blank\">Optimal Workshop</a>\nque nos permite realizar este tipo de técnica de manera remota.</p>\n<p>Para entender más de card sorting puedes leer este <a href=\"http://www.nosolousabilidad.com/articulos/cardsorting.htm\" target=\"_blank\">artículo</a></p>\n<p>Además ver este vídeo:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/TbEfjaE94sU?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://www.nngroup.com/videos/card-sorting-organize-product-offerings/\" target=\"_blank\">Card Sorting: How to Best Organize Product Offerings - KATHRYN WHITENTON</a></li>\n</ul>\n",
          "order": 1,
          "durationString": "1h"
        },
        "02-sitemap": {
          "title": "Sitemap",
          "type": "read",
          "format": "self-paced",
          "duration": 10,
          "body": "<p>El sitemap es uno de los outputs que tendremos luego de trabajar todo un proceso\nde Arquitectura de Información (AI). En el sitemap mostraremos las categorías\nque hemos definido luego de analizar los resultados de los usuarios y de tener\nen cuenta el contexto y el contenido. Aquí un ejemplo de un sitemap de una\nversión antigua de Facebook.</p>\n<p><img src=\"https://lh3.googleusercontent.com/JnIcB_U6TAajcSyP2RJo1WRsGfHuBMxrWwEUMMjsglOa_6R57nxiEIngchCZWDkRkHB6VIfVo1y_4CnHlULAiI9AAFz99OVKFzmSXRwSfw32MDbjony8Y_diWXH_bxNxCEIQx0tYLtY\" alt=\"Sitemap\"></p>\n<p>El sitemap nos servirá como un mapa para ayudar al usuario a navegar a través\nde nuestra información y será una guía para los desarrolladores al momento de\ncrear una estructura de datos para nuestro producto digital.</p>\n",
          "order": 2,
          "durationString": "10min"
        }
      },
      "order": 0,
      "stats": {
        "duration": 130,
        "durationString": "2.2h",
        "exerciseCount": 0,
        "partCount": 3
      }
    },
    "01-user-flows": {
      "title": "User Flows",
      "bonus": false,
      "description": "<p>Conoce cómo crear flujos de usuario que sean eficientes para ayudar al usuario\na cumplir sus objetivos y resolver sus necesidades.</p>\n",
      "parts": {
        "00-user-flows": {
          "title": "User flows",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<p>El flujo de usuario es la representación visual de una secuencia de pasos que el\nusuario debe seguir dentro de tu producto para lograr una meta. Por ejemplo, si\ndeseo unirme a la Comunidad de Interaction Design Foundation (IDF) debo seguir\nlos pasos.</p>\n<p><img src=\"https://public-media.interaction-design.org/images/uploads/675883078a80da923ab2cd0e2bb7cf05.jpeg\" alt=\"User Flow Diagram - IDF\"></p>\n<p>Definir flujos nos permiten evaluar y reflexionar sobre la eficiencia de la\nsecuencia de pasos o acciones que el usuario debe realizar para completar una\ntarea.</p>\n<h2 id=\"objetivos-de-usuario-versus-negocio\">Objetivos de usuario versus negocio</h2>\n<p>Al momento de definir y diseñar los flujos de usuario, debemos tener presente\nsiempre los objetivos de los consumidores y el negocio. Usualmente estos\nobjetivos son complementarios. Por ejemplo:</p>\n<ul>\n<li>Un consumidor desea comprar un regalo en un e-commerce.</li>\n<li>El e-commerce desea conseguir compradores para sus productos.</li>\n</ul>\n<p>El diseño del flujo debe considerar estos dos mundos. Convencer al usuario de\nque el e-commerce tiene el producto que él necesita y facilitar la secuencia de\npasos a seguir para que la compra se realice de manera satisfactoria. Así mismo,\nel flujo debe considerar la posibilidad de incrementar la cantidad de venta tal\nvez ofreciendo productos complementarios al consumidor o tratando de que se\ninscriba a una lista de contactos para que reciba futuras promociones de\nproductos.</p>\n<h2 id=\"cómo-crear-un-los-flujos-de-usuario-de-mi-aplicación\">Cómo crear un los Flujos de Usuario de mi aplicación</h2>\n<p>Para crear mejores flujos de usuarios, tenemos que entender primero qué tareas\nquiere nuestros usuario realizar con nuestro producto o qué tareas queremos\nnosotros que él realice con nuestro producto.</p>\n<p>Dado esto, lo primero que tenemos que hacer es identificar las tareas, por\nejemplo:</p>\n<ul>\n<li>Buscar un televisor (Amazon)</li>\n<li>Cambiar de foto de perfil (Facebook)</li>\n<li>Cambiar de método de pago (Uber)</li>\n<li>Enviar un mensaje a un usuario (Snapchat)</li>\n<li>Postular un trabajo (Linkedin)</li>\n<li>Crear una cuenta familiar (Spotify)</li>\n<li>Continuar el último episodio que vio de una serie (Netflix)</li>\n<li>Comprar un curso nuevo (Platzi)</li>\n</ul>\n<p>Dadas estas tareas, tenemos que pensar en 2 cosas:</p>\n<p>Primero, en cuál es el contexto en que el usuario quiere realizar estas tareas:</p>\n<ul>\n<li>Está o no autenticado</li>\n<li>Ha llegado al sitio a través de Google</li>\n<li>Está decidido del producto que va a comprar o va a hacer * browsing primero</li>\n<li>Está entrando desde un móvil o desde un computador de escritorio o desde un\nApple TV</li>\n<li>Ya tiene una cuenta en la plataforma</li>\n</ul>\n<p>Segundo, cuáles son todas las formas posibles en las que el usuario puede llegar\na culminar con éxito su tarea y cómo es que podemos ayudarlo a optimizar su\nruta.</p>\n<h3 id=\"tips\">Tips</h3>\n<ul>\n<li>Ten claro la meta del consumidor y del negocio. Prioriza los flujos que dan\nvalor agregado a la mayor cantidad de usuarios.</li>\n<li>Considera siempre los puntos de ingreso a tu aplicación o sitio web. Por\nejemplo, si el usuario proviene de una búsqueda en algún motor de búsqueda\ncomo Google o si viene de una campaña de marketing por correo.</li>\n<li>Empezar por describir la secuencia de pasos a realizar y conectarlos con\nflechas. Te sugerimos usar post-its para ir armando y modificando la secuencia\nde manera sencilla.</li>\n</ul>\n<p><img src=\"https://cdn-images-1.medium.com/max/600/1*jATNVQ9OBKGwHIGKpqSAsA.png\" alt=\"UI Flows\"></p>\n<h2 id=\"flujos-de-usuario-vs-flujos-de-tareas-task-flows\">Flujos de Usuario vs. Flujos de tareas (task flows)</h2>\n<p>Al momento de hablar de flujo o secuencias de acciones dentro del diseño de una\naplicación has escuchado o leído sobre dos términos: flujos de usuario y flujos\nde tareas. Los flujos de usuario pueden ser confundidos por los flujos de\ntareas.</p>\n<p><strong>¡Ten cuidado! No son lo mismo.</strong></p>\n<p>La diferencia entre los dos es que los flujos de usuario tienen una visión\nholística a las diferentes tareas de una aplicación. Por ejemplo, un flujo de\ntareas es una secuencia de pasos que el usuario debe seguir para realizar una\ntarea. Esta secuencia no cambia por tipo de usuario, es un flujo genérico. En\ncambio, los flujos de usuario permiten al usuario seguir diferentes caminos o\nrealizar diferentes pasos para lograr cumplir una tarea en el sistema.</p>\n<h2 id=\"ejercicios\">Ejercicios</h2>\n<p>Piensa, lista y crea las formas que tiene un usuario en:</p>\n<ul>\n<li>Netflix para poder entrar y ver el siguiente episodio de la serie que estuvo\nviendo ayer.</li>\n<li>Platzi para poder seguir un curso.</li>\n<li>Comunidad de Desarrolladores de Laboratoria para poder registrarse.</li>\n<li>Facebook/Twitter/Slack para podre crear un post.</li>\n</ul>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2012/01/stop-designing-pages-start-designing-flows/\" target=\"_blank\">Stop Designing Pages And Start Designing User Flows - Morgan Brown</a></li>\n<li><a href=\"https://uxknowledgebase.com/user-flow-496e3187842\" target=\"_blank\">User Flow - Krisztina Szerovay</a></li>\n<li><a href=\"https://www.interaction-design.org/literature/article/7-ux-deliverables-what-will-i-be-making-as-a-ux-designer\" target=\"_blank\">7 UX Deliverables: What will I be making as a UX designer? - Andreas Komninos</a></li>\n<li><a href=\"https://blog.overflow.io/user-flows-in-the-design-process-41e6dee6d0a7\" target=\"_blank\">User Flows in the Design Process - Aimilia Tzanavari</a></li>\n<li><a href=\"https://uxplanet.org/ux-glossary-task-flows-user-flows-flowcharts-and-some-new-ish-stuff-2321044d837d\" target=\"_blank\">UX Glossary: Task Flows, User Flows, Flowcharts and some new-ish stuff - Naema Baskanderi</a></li>\n</ul>\n",
          "order": 0,
          "durationString": "1h"
        }
      },
      "order": 1,
      "stats": {
        "duration": 60,
        "durationString": "1h",
        "exerciseCount": 0,
        "partCount": 1
      }
    },
    "02-content-prototyping": {
      "title": "Prototipado de contenido",
      "bonus": false,
      "description": "<p>Aprende a prototipar el contenido de un producto.</p>\n",
      "parts": {
        "00-content-prototyping": {
          "title": "Prototipado de Contenido (Content prototyping)",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<p>Cuando se empieza a filmar una película, la historia que va a seguir ya está\ndefinida. Los productores y actores han leído el guión y están de acuerdo con el\nproducto final, lo que viene después es sólo plasmar en escenas (con un poco de\nmagia de post-producción) lo que se definió en este guión.</p>\n<p><strong>¿Por qué no usar esta fórmula exitosa de esta industria en el diseño de\naplicaciones?</strong></p>\n<p>Un prototipo de contenido (content prototype) es una versión inicial del flujo y\nconversación que tiene una aplicación o sitio web con el usuario. En vez de\ndibujar elementos de la interfaz, esta herramienta trabaja sólo con texto. El\nprototipo de contenido es como el “guión” de tu aplicación.</p>\n<p>Para entender un poco más las ventajas de aplicar el prototipado de contenido y\naprender cómo hacerlo, te recomendamos leer este artículo:\n<a href=\"https://medium.com/mercadolibre-ux/ux-empieza-por-contar-una-historia-26f23d27a63e\" target=\"_blank\">Las damas, los niños y el contenido primero</a>.</p>\n",
          "order": 0,
          "durationString": "1h"
        }
      },
      "order": 2,
      "stats": {
        "duration": 60,
        "durationString": "1h",
        "exerciseCount": 0,
        "partCount": 1
      }
    },
    "03-ux-writing": {
      "title": "UX Writing",
      "bonus": false,
      "description": "<p>Conoce elegir las palabras y frases exactas para ayudar a tus usuarios.</p>\n",
      "parts": {
        "00-Intro": {
          "title": "UX Writing",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "embeds": [
            {
              "type": "slides",
              "provider": "google",
              "href": "https://docs.google.com/presentation/d/e/2PACX-1vQVJYyTIMFIB85DF_q7tx892qLb3_agzohporRD1TZw27k-FAsS3qjdFpIxIfN-BVQgdpZey9YBf45x/embed?start=false&loop=false&delayms=3000",
              "id": "2PACX-1vQVJYyTIMFIB85DF_q7tx892qLb3_agzohporRD1TZw27k-FAsS3qjdFpIxIfN-BVQgdpZey9YBf45x/embed"
            }
          ],
          "body": "<h2 id=\"qué-es-una-ux-writer\">Qué es una UX Writer</h2>\n<p>Una UX writer organiza las <strong>palabras y elementos conversacionales</strong> en la\n<strong>interfaz del usuario</strong> de un <em>producto digital</em> .</p>\n<p>Crea <strong>historias</strong> donde el <strong>usuario</strong> es el <strong>personaje principal</strong> y la\nhistoria es la <strong>arquitectura de información</strong> de la experiencia que estamos\ndiseñando.</p>\n<h2 id=\"de-dónde-viene-esta-disciplina\">De dónde viene esta disciplina</h2>\n<p>Content strategy es la creación, desarrollo, orquestación y comunicación del\nproducto al usuario correcto. UX Writing es una especialidad de esta disciplina.\nSe enfoca en hacer que los usuarios cumplan sus metas.</p>\n<h2 id=\"cómo-nace-esta-disciplina\">Cómo nace esta disciplina</h2>\n<p>Los roles de UX/UI se crearon a partir de una respuesta directa a las\ntecnologías emergentes y los nuevos comportamientos que tenían las personas al\ninteractuar con ellos. Fue recién hace unos años, en marzo del 2013, que se\ncontrató al primer UX Writer en Youtube.</p>\n<p>En la medida en la que YouTube y Dropbox empezaron a crecer, tuvieron que\nadaptar sus productos a una variedad de dispositivos y plataformas. Esto trajo a\nla luz las inconsistencias del lenguaje que tenían, pues cada dispositivo se\ncomunicaba con los usuarios con un estilo, tono y voz diferente.</p>\n<p>Es por ello que decidieron contratar a un escritor para que viera de manera\ntransversal la voz del producto y pueda uniformizar el lenguaje en todos los\ndispositivos. Así fue que se dio pie a la creación del UX Writer, que trabaja de\nla mano con UX/UI Designers, Content Strategists, Researchers y Desarrolladores.</p>\n<h2 id=\"qué-hace-una-ux-writer\">Qué hace una UX Writer</h2>\n<p>La labor de una UX Writer se puede definir en dos tipos, principalmente:</p>\n<ul>\n<li><strong>Microcopy:</strong> es la parte transaccional y navegacional del diseño de las\npalabras, al que se le llama copy. Las palabras no deben generar fricción, sino\nque deben hacer que los usuarios lleven a cabo sus objetivos sin problemas.</li>\n<li><strong>Copywriting:</strong> es la parte con más personalidad y vitalidad de un producto.\nEs la forma en la que se expresa la voz de la marca y lo que normalmente suele\nllamar la atención de un producto o servicio en particular.</li>\n</ul>\n<p>Los UX Writers, deben de poder modular el tono, la voz y el estilo del producto\ncombinando tanto el microcopy, como el copywriting. Una vez que tengan estas\nparticularidades definidas, las plasman en una guía de estilos que tenga\nespecificado qué y cómo el producto debe comunicarse con sus usuarios. Así, al\nmomento que el producto empiece a escalar, será mucho más sencillo que tenga una\npersonalidad sólida y elocuente que sea fácil de replicar por los demás UX\nWriters del equipo.</p>\n<h2 id=\"en-qué-parte-del-proceso-de-diseño-se-debe-incorporar-una-ux-writer\">En qué parte del proceso de diseño se debe incorporar una UX Writer</h2>\n<p>Es importante que antes de empezar a diseñar las pantallas o elegir los\ncomponentes de interacción, se defina lo que se va a contar. Idealmente, los UX\nWriters deben estar desde el inicio, trabajando de la mano con los stakeholders,\ndiseñadores y desarrolladores, para delimitar la historia que se quiere contar a\ntravés del producto y escribir los contenidos de todas las piezas. Sin embargo,\nesto no es lo que suele ocurrir.</p>\n<p>Lo que normalmente suele suceder en la creación de los productos digitales es\nque no hay un proceso definido y el copy es añadido al final, sin prestarle\nmayor atención. En algunos casos más favorables, el copy sí llega a ser evaluado\ny optimizado antes de ser desarrollado, pero en general, el UX Writing y el\ndiseño de contenido no se integra en su totalidad al proceso de diseño.</p>\n<p>Esto suele ocurrir debido a distintos factores:</p>\n<ul>\n<li>Desconocimiento sobre el usuario y la importancia del diseño del copy.</li>\n<li>Falta de presupuesto en el proyecto.</li>\n<li>Confusión sobre cómo sacar provecho de las habilidades de un UX Writer.</li>\n<li>Falta de herramientas y procesos para integrar diseñadores, desarrolladores y copywriters.</li>\n<li>Dificultad de reclutamiento de estos perfiles.</li>\n</ul>\n<h3 id=\"por-qué-tener-a-una-ux-writer-en-el-equipo\">Por qué tener a una UX Writer en el equipo</h3>\n<ol>\n<li>Las escritoras son diseñadoras: diseñar un flujo de pantallas es muy similar\na escribir una historia. Para crear una buena historia, ayuda tener a un\nescritor en el cuarto.</li>\n<li>Las escritoras unen los puntos: mientras que las diseñadoras se enfocan en\n una sola área del producto, los escritores de producto se enfocan en\n múltiples áreas.</li>\n<li>Las escritoras saben moderar su voz: Normalmente, las palabras no deben de\nresaltar por sí mismas. Pero, hay veces que sí quieres que tus usuarios noten\ntus palabras. Ahí es cuando debes hablar fuerte y ser escuchada, fuerte y\nclaro.</li>\n<li>Las escritoras cuidan el lenguaje: en el momento que los usuarios empiezan a\ndetectar errores y palabras mal escritas, pierden la confianza en el producto\no compañía.</li>\n<li>Las escritoras te empujan a ser una mejor diseñadora: las UX writers siempre\ntienen que explicar conceptos complicados con palabras sencillas.</li>\n</ol>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://docs.google.com/presentation/d/e/2PACX-1vQVJYyTIMFIB85DF_q7tx892qLb3_agzohporRD1TZw27k-FAsS3qjdFpIxIfN-BVQgdpZey9YBf45x/embed\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://medium.com/laboratoria/qu%C3%A9-es-un-ux-writer-f23c2ac0b8e7\" target=\"_blank\">Qué es un UX writer</a>.</li>\n<li><a href=\"https://blog.intercom.com/dropbox-john-saito-ux-writing/\" target=\"_blank\">Entrevista a John Saito, UX Writer en Dropbox</a></li>\n<li><a href=\"https://medium.com/dropbox-design/why-your-design-team-should-hire-a-writer-24d55f1e2d4a\" target=\"_blank\">Why your design team should hire a writer</a></li>\n<li><a href=\"https://blog.prototypr.io/rise-of-the-ux-writer-cb5b0ce8ac31\" target=\"_blank\">Rise of the UX writer</a></li>\n</ul>\n",
          "order": 0,
          "durationString": "1h"
        },
        "01-microcopy": {
          "title": "Microcopy",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"microcopy\">Microcopy</h2>\n<p>El microcopy es el conjunto de pequeños elementos de texto que facilitan y\norientan al usuario al momento de interactuar con un producto digital.</p>\n<p><img src=\"https://lh6.googleusercontent.com/kQI7xITZHzKBK-O389_mBGBnzu3Wx_2Om76HxnJMcBWRw74c6ebNJkej-JtwIS7eLBrCYhQ7XIJ5F-rgkK9vMiJyjlkgWQT9iNz6MDwqQpo1Vl-PjOevgh0KwNH9ShYb20C7uLuNOsA\" alt=\"microcopy\"></p>\n<p><img src=\"https://lh5.googleusercontent.com/C2shORkR8FnJPnni2Ajq5Yw8VNl_yfXbKWnCpF3hrAKRmH4b6cc_FrIextB19QDy_Q4hYF-5_swKFwGy9biJuCNfzvf810NlvRGJNJKcCLesX0MBECk5k2R2td8yn73zD6WuvfODf-U\" alt=\"microcopy 2\"></p>\n<p>El microcopy hace referencia a:</p>\n<ul>\n<li>Pequeñas instrucciones</li>\n<li>Respuestas automáticas</li>\n<li>Indicaciones de actividad</li>\n<li>Recomendaciones de uso</li>\n<li>Mensajes de error</li>\n</ul>\n<p>Por ejemplo: la confirmación de que un formulario se ha enviado, una compra\nrealizada, la instrucción para seleccionar una cantidad de productos en una\ncesta de la compra, resolver dudas que tengan tus visitantes antes de dar clic\nen un botón, completar los campos de un formulario, mensajes de error.</p>\n<h3 id=\"áreas-donde-el-microcopy-puede-mejorar-la-experiencia\">Áreas donde el microcopy puede mejorar la experiencia</h3>\n<ul>\n<li>Formularios de registro</li>\n<li>Formularios de inicio de sesión</li>\n<li>Checkout de compra</li>\n<li>Inscripciónes a boletines</li>\n</ul>\n<h2 id=\"ejemplos\">Ejemplos</h2>\n<h3 id=\"facebook\">Facebook</h3>\n<p>El  microcopy está en todas partes, la mayoría de nosotros simplemente no nos\ndamos cuenta. Está en Facebook, cuyo objetivo n.° 1 es que sus usuarios\ncompartan contenido.</p>\n<p><img src=\"https://lh3.googleusercontent.com/5RdoilxnZGtcjE4tJt3LWjDMl9rASF_px6j6DCod-mdtbl2Jqf_d4RJaZF6tyk22wl95XAle3JkoblYi5iPn_LYPck9V-RTJJx-5l1q9eo4OYszHsBjoJP50tLRVcw48qj2DjpjedIE\" alt=\"microcopy facebook\"></p>\n<p>Esta pequeña pieza de texto \"Qué estás pensando\" es el trigger que incita a que\ncompartas algo en Facebook. Y es lo primero que te sale apenas entras a la red\nsocial.</p>\n<p>Facebook ha probado muchas variaciones de este microcopy, hasta finalmente\nllegar a esto.</p>\n<h3 id=\"gmail\">Gmail</h3>\n<p><img src=\"https://lh4.googleusercontent.com/Y6888xaJFtFPKB15Tvfc1aj9PuzFWLM2qYcDguGMjIipPIwnofLfDC5cF5SlPjOrA45FmbTzsU10lqYmWPLNmC1rlqeNhi1eJsAMG44-8BouhNYkPFx1WnVGgxGtWHW_pXPPcyBSpCk\" alt=\"Image\"></p>\n<p>El microcopy de Gmail te da una sensación de seguridad con respecto a tu propia\ncuenta (¿Utilicé mi correo electrónico hace 1 minuto?).</p>\n<p>Te da una idea de la cantidad de almacenamiento que has usado. Estos son todos\npequeños indicadores de actividad que mejoran tu experiencia al utilizar el\nproducto.</p>\n<h2 id=\"los-tres-principios-del-microcopy\">Los tres principios del microcopy</h2>\n<h3 id=\"claro\">Claro</h3>\n<p>Los verbos expresan una acción y por lo tanto, son la parte más importante de la\noración.</p>\n<p>La acción debe tener en cuenta el contexto del usuario, por ello: claridad ante\ntodo, eliminando términos técnicos.</p>\n<p><img src=\"https://lh3.googleusercontent.com/FMLQ7L3OEFhyKvF-13OSIc3acE0_YjGQRa6sTMRw9ZoejI-MoakubL3PPFaFHAwE7DJ1W8YI0omwZ22GcQWqZdXp6ESQho2MpKcqpkm4c2ALT-a69SwTQgjhW1XCGX9_vurZDIa1v0Q\" alt=\"Image\"></p>\n<h3 id=\"conciso\">Conciso</h3>\n<p>Conciso no solo significa corto, si no también eficiencia al momento de\ncomunicar. Cada palabra en la oración debe ser colocada intencionalmente y tener\nuna razón de existir.</p>\n<p><img src=\"https://lh3.googleusercontent.com/b0xqwy4GTGZRTZB6wdWXiOez0XML8z8lPHJM2bI_W9KwZIm7FngdqZg2DEQ8qpASNnyl-6KxDJ9RlhKOzw4u4CTxKJNQEG8_PyulHH0utUYbDIP5UQSx5hruEwjmc5HtmTeKBF0TiYQ\" alt=\"Image\"></p>\n<h3 id=\"útil\">Útil</h3>\n<p>Dirige al usuario hacia la próxima acción.</p>\n<p><img src=\"https://lh6.googleusercontent.com/KyDmu2B-znXl3ufVzaVg2P1Y3xM_w55mpX--G8Gc_HTpT9ZSne4fe6MFQtilzlm7JT57Kkt3q1_eko6O2r6YB0L1B6uRka0-LwfDEb0mQ-GYrGVmmgowQDrQhCqvRYo6KVyKgw3Y-uM\" alt=\"Image\"></p>\n<h2 id=\"los-6-tipos-de-microcopy\">Los 6 tipos de microcopy</h2>\n<h3 id=\"1-reducir-la-ambigüedad\">1. Reducir la ambigüedad</h3>\n<p>Cuando algo no está claro y puede ser explicado con mayor detalle (e.j. un texto\nde ayuda).</p>\n<p>La utilización de microcopy cuando algo no está claro y puede ser descrito con\nmás detalle (tal vez un texto de ayuda o un enlace que le dice qué significa x).\nEsto se utiliza mejor en lugares donde puede haber cierta ambigüedad en torno a\nlo que dices y ofrece una forma más clara de explicarlo.</p>\n<p>Mucha gente no sabe que es el CVV al momento de ingresar una tarjeta de crédito.\nEl ejemplo que ven en la pantalla muestra un signo de interrogación que, al\nmomento de pasar el cursor sobre el, te explica qué significa. Elimina la\nambigüedad. Esto permite que alguien usando su tarjeta por primera vez entienda\nlo que significa el CVV.</p>\n<p><img src=\"https://lh6.googleusercontent.com/2epKuvTl25y0dTQJo9YaolU2G-N_7g_LlUi6PcnwJaalYP2yzDuplknPsRXNgytoz9TyLUHicrai_3H8WEeFvglsnlB3OEYahNyN_WLtmQP1hFmWb-ReSwy_dG-S1LxoIMJr8wef-QM\" alt=\"Image\"></p>\n<h4 id=\"slack\">Slack</h4>\n<p>Slack te guía a través de la experiencia en casi toda parte del proceso de\nregistro.  Como usuario puede existir cerca ambigüedad con respecto al “team\nname.’’ o nombre de equipo. Podría estar preguntándome si se refieren al nombre\nde mi empresa o a qué exactamente? Acá usan microcopy para explicarte dónde va a\naparecer ese nombre y que sí, efectivamente se suele poner el nombre de la\nempresa.</p>\n<p><img src=\"https://lh4.googleusercontent.com/yRjnfgpBgUD8fNGlgAh2y8iLVAcQbb8lacMHcxHfcFz-n1K2lzFgNwFy25jeMJICDKQHjwqvGokpDxXGbn8SP2yRm-5ymwoliQvOP7sKx66vZPudsnlh6BgKOUWIT855P62HjT2v3Lw\" alt=\"Image\"></p>\n<h4 id=\"snapchat\">Snapchat</h4>\n<p>El usuario puede ser usado de distintas formas, dependiendo de la plataforma\ndonde estés. En algunos casos solo se usa para log-in, pero en otros casos lo\nutilizan como tu identidad, como es el caso de Snapchat. A que te explican,\ntravés de un microcopy, lo que significa el \"username\" en snapchat.</p>\n<p><img src=\"https://lh4.googleusercontent.com/J63u6BoFcQXTll9Cny4Ntz8K4SP-PgyWqr1A2pC2Db3XCJTwkggyVDMEXrBWiNUGe8qCg9FoQPvTVbUDtPfvo5vu4NfjalN51OYk8_Mtxx4JS9-vDM2CsplSaf5Tco1Yee1gCbDTFto\" alt=\"Image\"></p>\n<h4 id=\"fivver\">Fivver</h4>\n<p>Fiverr, un marketplace de servicios donde personas ofrecen realizar diversas\ntareas y servicios, comenzando con un costo de $ 5 por trabajo realizado. Al\nmomento que creas una cuenta, Fiverr te da la opción de subir una foto. Usan\nmicrocopy para dejar en claro donde aparecerá tu foto de perfil. Sin este\nmicrocopy, puede surgir ambigüedad con respecto a donde va a aparecer tu foto.</p>\n<p><img src=\"https://lh6.googleusercontent.com/1_zJn1NImR_7qmEytUciCCpGzoDRgc9LCOce91HPLXBetZrpbUEnwamvTAriInyzzCIX1CJaKDRTMfWX1YORwFmvthFjgHJxafgDGkVnoLwUKSGrdvpoCmkDqHJBMhds7ei55qUJO24\" alt=\"Image\"></p>\n<h4 id=\"yoastcom\">Yoast.com</h4>\n<p>Yoast.com (ofrece servicios de SEO), agregaron un pequeño texto al costado del\ntotal “No habrán costos adicionales\". La adición de este pequeño texto resultó\nen un aumento del 11.30% en conversion. Y es porque costos escondidos es la\nprincipal razón por la cual las personas abandonan los carritos de compra.</p>\n<p><img src=\"https://lh5.googleusercontent.com/cb0aIp0CRIeeY5XhU8Y2Jy1WGmqcHT0umz-OFarJPxxDX4FwgAH-sBngYCB-l5SBRKTzOdORgkchJBdarDMJzR4nrOhmYca2lllAtGpRg3B9jMtjujzXETz0BK3WJcqeUgFqsbU0zRE\" alt=\"Image\"></p>\n<h3 id=\"2-instrucciones-de-uso\">2. Instrucciones de uso</h3>\n<p>Enfócate en lo que el usuario está intentando hacer, no en las funcionalidades\nde tu producto. Escribe desde su perspectiva. Piensa en lo que están tratando de\nhacer.</p>\n<p><img src=\"https://lh5.googleusercontent.com/6DAB6I4qkSfk5-OMnBrOuRoemW1fgmTJskUppOevbtxKOcjaXIgtsVoKtN-Cum5Al-7hd4OK7O6F9M1p0LfXXCdxiKwAcu7K7UHhHpnnujJk56U3qy55QlDJf_kusS7y_owFwMRd6Mg\" alt=\"Image\"></p>\n<p>Se genera una mala sensación cuando indicas repetidamente al usuario lo que\ntiene que hacer. Para evitar esto, debemos usar su voz (primera persona).</p>\n<ul>\n<li>Hazlo con moderación</li>\n<li>Procura ser claro y específico</li>\n</ul>\n<p><img src=\"https://lh3.googleusercontent.com/buVBGqitwUIIFM9GuiB94n2zzQXtA4DLxLIMnu39Dwn9nSOKunS8AJwKHGOkgwdCf-ycFECz_k8wbviam6kwdCdqdjbs-FzcwxcKVNfk_0iwUZ-IKvqcWHFFNhcLFHelQ2FfsRIwU9Y\" alt=\"Image\"></p>\n<h3 id=\"3-recojo-de-datos\">3. Recojo de datos</h3>\n<p>El usuario tiene el derecho a saber la razón detrás de cualquier pedido de\ninformación personal que se le haga.</p>\n<h3 id=\"4-próximos-pasos\">4. Próximos pasos</h3>\n<p><img src=\"https://lh6.googleusercontent.com/dNNrTeE9LVY-mM_FjR-3dY0Fx8BgEuJBtMp7mVXaqq7p5hY2td_3UFGl5NymTbdg_21Iba9qQ9CSlcTAv8W-I-NjS7GxBVOVSoSjGmhLgGKuVhJXby_NcqcunZ-ssXkOGVX71a9Lado\" alt=\"Image\"></p>\n<p><img src=\"https://lh5.googleusercontent.com/lax10uBdop3Q22gquttKS60zdVrDjKVRyQbzEAGoDnVGegMAAGoovfd02T_hZm-JoMkp34eJVyMSOyxaoHHXAR5DnKiX-QP-6t0HeQwTurYRbseXlFfLDbKxkLrpch97uM2zxVD0dKs\" alt=\"Image\"></p>\n<h3 id=\"5-mensajes-de-error\">5. Mensajes de error</h3>\n<p>¿Cómo podríamos hacer que la experiencia del usuario sea más agradable, de\nmanera que, cuando cometa un error, no sienta que es el fin del mundo?</p>\n<p>Debe ser:</p>\n<ul>\n<li>Específico</li>\n<li>Proveer contexto</li>\n<li>Cortés</li>\n<li>Útil</li>\n</ul>\n<p><img src=\"https://lh5.googleusercontent.com/REEim84apdohDMaLr3ffbMbCNtLRt66sfenJAc97GA5pPBq9iirsPut65slzXEXMs-YMLzKrmVrQvz7fn_8PchFXE7kLmGeauWOTL7OdExr3FmKk27BWfKDJw1HIRKngwZv0Ad7JNeg\" alt=\"Image\"></p>\n<h3 id=\"6-mensajes-de-éxito\">6. Mensajes de éxito</h3>\n<p><img src=\"https://lh5.googleusercontent.com/REEim84apdohDMaLr3ffbMbCNtLRt66sfenJAc97GA5pPBq9iirsPut65slzXEXMs-YMLzKrmVrQvz7fn_8PchFXE7kLmGeauWOTL7OdExr3FmKk27BWfKDJw1HIRKngwZv0Ad7JNeg\" alt=\"Image\"></p>\n<p><img src=\"https://lh6.googleusercontent.com/xVarB5SjQp9onlchuNQdzKoNHBDDV7OPA5p7yETmoxOCVIOaIW9WBO70TX2X_U-mLWmqM3igAdDVbghsC7fEmhx0AYSS2wL-5UXGSrWfXPrXRq_cjzFIHwCcKs2lJgupoH83ci7p-Kg\" alt=\"Image\"></p>\n",
          "order": 1,
          "durationString": "1h"
        }
      },
      "order": 3,
      "stats": {
        "duration": 120,
        "durationString": "2h",
        "exerciseCount": 0,
        "partCount": 2
      }
    }
  },
  "grades": "",
  "contributors": "",
  "books": "",
  "benchmarks": "",
  "references": "",
  "repo": "Laboratoria/bootcamp",
  "path": "topics/content-management",
  "version": "3.1.0",
  "parserVersion": "3.0.0",
  "track": "ux",
  "locale": "es-ES",
  "stats": {
    "duration": 370,
    "durationString": "6.2h",
    "exerciseCount": 0,
    "unitCount": 4,
    "partCount": 7
  }
}
