{
  "slug": "interaction-design",
  "createdAt": "2021-06-24T00:52:54.826Z",
  "title": "Interaction Design",
  "description": "<p>En este curso aprenderás las bases fundamentales para hacer que tus productos\nsean fáciles de usar, accesibles y luzcan profesionales visualmente hablando.</p>\n",
  "tags": {
    "secondary": {},
    "primary": {}
  },
  "targetAudience": "<p>Este curso está dirigido a personas sin conocimientos previos de diseño que\ntienen el interés de aventurarse al mundo del desarrollo de productos digitales.</p>\n",
  "dependencies": "<p>Ningún conocimiento previo diseño o de programación es necesario para completar\neste curso. Está diseñado para principiantes.</p>\n",
  "learningObjectives": "<ul>\n<li>La importancia del Sketching en el diseño de productos digitales</li>\n<li>Fundamentos de diseño visual</li>\n<li>Breve historia de diseño visual para web</li>\n<li>Reglas básicas de diseño visual</li>\n<li>Color y tipografía</li>\n</ul>\n",
  "product": "<p>En este curso pondrás en práctica los conceptos aprendidos para crear\nexperiencias que tengan en cuenta al usuario desde su concepción.</p>\n",
  "syllabus": {
    "00-sketching": {
      "title": "Sketching",
      "bonus": false,
      "description": "<p>En esta unidad nos sumergiremos en Sketching. Qué es, por qué es importante,\ncuáles son las mejores técnicas.</p>\n",
      "parts": {
        "00-sketching": {
          "title": "Sketching",
          "type": "read",
          "format": "self-paced",
          "duration": 90,
          "embeds": [
            {
              "type": "video",
              "provider": "vimeo",
              "href": "https://vimeo.com/35986473",
              "id": "35986473"
            }
          ],
          "body": "<h2 id=\"qué-es-un-sketch\">Qué es un Sketch</h2>\n<p>Es un dibujo o esbozo de la solución del proyecto que queremos realizar de una\nmanera simple y ordenada. En él se encuentran todos los elementos necesarios\npara la planeación de un proyecto/plataforma digital.</p>\n<p><img src=\"https://image.ibb.co/hyZVfo/sketch.jpg\" alt=\"Sketch\"></p>\n<h2 id=\"¿por-qué-hacerlo\">¿Por qué hacerlo?</h2>\n<p>Cuando te dan un proyecto a realizar ¿no te ha pasado que en automático tu\ncerebro comienza a trabajar e idear? Y no ves la hora de comenzar a trabajar, ya\nsea en el diseño o el desarrollo. Pero ¡alto! Te estás saltando varios pasos\nimportantes en la planeación de un proyecto digital. No te preocupes, es normal,\ntodas nos enfrentamos a eso. Y por eso, ahora te vamos a contar más\ndetalladamente sobre este paso tan importante.</p>\n<p>Antes que nada debes tener en cuenta que para comenzar a planear un producto\ndigital hay un flujo de trabajo:</p>\n<ol>\n<li>Tener un problema que resolver</li>\n<li>Pensar diversas soluciones que puedan resolver las necesidades del cliente y\ndel usuario en armonía</li>\n<li>Hacer listas de los contenidos necesarios a mostrar</li>\n<li>Comenzar a materializar esas ideas en un sketch, tomando en cuenta los\ncontenidos y elementos gráficos</li>\n<li>Probar y experimentar hasta que llegues a la mejor solución</li>\n<li>Y cuando este punto te haya satisfecho, puedes comenzar a pensar en visual\ndesign para empezar a hacer tu prototipo</li>\n</ol>\n<p>Cuando estás en ese momento entre lo que quieres proponer y el cómo lo vas a\nhacer, la mejor estrategia es hacer uno o varios <em>sketches.</em></p>\n<p><img src=\"https://image.ibb.co/c1sVD8/sketch_hand.jpg\" alt=\"Sketching\"></p>\n<p>Este es el momento para aterrizar tus ideas ya que es un método flexible,\nportable, accesible y fácil de testear. Al ser fácil de testear, te permite\nhacer cambios en un corto tiempo y a bajo costo. Incluso te permite distribuir\nelementos gráficos sin el uso directo de ellos, utilizando ‘‘the big ‘x’\nimage’’.</p>\n<p>Por lo anterior mencionado, sin duda el proceso de sketching te va a ahorrar\nmuchos recursos a la hora de desarrollo y te va a dar una idea clara de cómo y\nhacia dónde ir. Además de que son tus primeras ideas materializadas en búsqueda\nde la mejor solución, con esa flexibilidad en prueba y error puedes comenzar a\nidear.</p>\n<p><em>‘No hay nada más simple que papel y lápiz para aterrizar ideas’.</em></p>\n<p><strong>Herramientas necesarias:</strong> Dos herramientas indispensables: papel y lápiz.</p>\n<h2 id=\"preguntas-necesarias-que-debes-hacerte-antes-de-practicar-sketching\">Preguntas necesarias que debes hacerte antes de practicar sketching</h2>\n<p><em>¿Cuento con todos los elementos necesarios para comenzar?</em> Debes pensar en\n  todo: la información a transmitir (en este punto te recomiendo hacer listas de\n  los contenidos necesarios por transmitir en cada punto de tu vista de página o\n  tarea), para quién lo vas a hacer (usuarios), de parte de quién (clientes) y\n  con qué recursos lo vas a lograr(Landing Page, formulario, etc).</p>\n<p><em>¿Cómo lo voy a hacer?</em> Aquí es donde comienza la magia. Debes planear una\n  estrategia para comunicarle a tu usuario lo que tu cliente necesita transmitir.\n  Debes pensar cómo lo harás y de qué manera, pensando en que tu usuario\n  interactúa con tu plataforma y que al entrar a un sitio necesita informarse o\n  realizar una tarea, entonces va a necesitar seguir un flujo dentro de la\n  aplicación. También es importante comenzar a pensar en la priorización de\n  elementos o información que queremos incluir y pensar en dónde lo vamos a\n  hacer. Cuando estés haciendo las listas de contenidos, te recomiendo\n  acomodarlas según el orden de importancia con la respectiva información interna\n  a cada punto de información.</p>\n<p><img src=\"https://image.ibb.co/iUP5fo/sketch_flow_2.jpg\" alt=\"sketch flow\"></p>\n<p>Como has podido ver, el hacer un sketch es un proceso totalmente creativo que\nrequiere de un momento de mucho análisis para transmitir lo que queremos y de la\nmejor forma posible. Y sobre todo, para tener el esqueleto de lo que vamos a\ndesarrollar antes de hacerlo, y no tener que ir improvisando.</p>\n<p><strong>Recuerda:</strong> En este proceso no es importante el grado de fidelidad. Lo\nimportante es comenzar a pensar en el contenido a transmitir, la distribución de\néste y de los elementos que van a ir dentro de tu propuesta de solución.</p>\n<p><strong>Consejo:</strong> Practica, practica y practica.</p>\n<p>Mira el siguiente video para ejemplificar mejor este proceso:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://player.vimeo.com/video/35986473?title=0&amp;byline=0&amp;portrait=0\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n",
          "order": 0,
          "durationString": "1.5h"
        }
      },
      "order": 0,
      "stats": {
        "duration": 90,
        "durationString": "1.5h",
        "exerciseCount": 0,
        "partCount": 1
      }
    },
    "01-visual-design": {
      "title": "Fundamentos de diseño visual",
      "bonus": false,
      "description": "<p>Conoce los fundamentos de diseño visual. Aprende cuáles son las reglas básicas\ndel diseño visual, la teoría de color y el uso de tipografías.</p>\n",
      "parts": {
        "00-web-design-history": {
          "title": "Historia del diseño visual para web",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"historia-breve-de-diseño-visual-para-web\">Historia breve de diseño visual para web</h2>\n<p>Para empezar a entender el mundo del diseño web actual, es muy útil entender\ncómo llegamos a este punto. Aquí hacemos un breve recorrido por la historia del\ndiseño web.</p>\n<h3 id=\"la-era-oscura-de-diseño-web-1989\">La era oscura de diseño web (1989)</h3>\n<p><img src=\"https://lh4.googleusercontent.com/F8BiT90a9GYamkiMsW9lo-sgJ50sEtYLKSkDjWC-6xO53DCmPM-7HzVqerz4ZbtNFvbc1n2xbl0ymgCSNBNb2Bws17TS-ZtY-kakyMg39FmqVnz_NvGOSexdP0j_EV7We1CaNdhi\" alt=\"la era oscura\"></p>\n<p>El principio de diseño web fue la era oscura — todas las pantallas eran negras y\nen ellas vivían un par de pixeles verdes. El diseño se basaba sólo en símbolos y\ntabulación.</p>\n<h3 id=\"tablas--el-principio-1995\">Tablas — el principio (1995)</h3>\n<p><img src=\"https://lh4.googleusercontent.com/fI81YJ_Ckh63U83cMxKIoIDvhop207GwQFzfwue90gcUJ_O-Z5i4CnbuSlkhpIE-USVS153izfwTb_3V2rwt3f7nk76YDwL0Nx1aLUvQSJPQyCKfcou59ZMeDWTNqrhJKiWY5gFP\" alt=\"tablas\"></p>\n<p>El primer paso hacía el diseño web como ahora lo conocemos eran navegadores que\npodían mostrar imágenes. La mejor opción que existía para darle estructura a la\ninformación era el concepto de tablas, que ya existían en HTML. Meter tablas\ndentro de tablas y encontrar formas de mezclar células estáticas con células\nfluídas era lo más avanzado. No funcionaba a la perfección ya que el propósito\nde una tabla era estructurar números pero fue el método más común de diseño web\ndurante mucho tiempo.</p>\n<p>Mantener esas estructuras tan frágiles resultaba muy problemático. Lo que sí,\nlas tablas daban la posibilidad de alinear elementos verticalmente y definir\nelementos tanto en pixeles como en porcentajes. El principal beneficio era que\nen ese momento era lo más cercano a lo que después llamaríamos un <em>grid.</em> Fue en\nesta época que el desarrollo front-end se empezó a poner más de moda.</p>\n<h3 id=\"javascript-al-rescate-1995\">JavaScript al rescate (1995)</h3>\n<p><img src=\"https://lh5.googleusercontent.com/ZGVFlov_TN0AxibIXkXxGIctGKb5P2nCmi9PRnaqKwuykYBas1b7XTPhacCz-kcyUnwwnxZBTGAArbKWhvhFHGFNBpXdBNpybGSdQIB-8kRKMobqTFDDiAzy7aaazTJ_2yT_WSmq\" alt=\"Javascript al rescate\"></p>\n<p>JavaScript fue la respuesta a muchas de las limitaciones de HTML. Por ejemplo,\nnecesitas un <em>popup</em> o modificar dinámicamente el orden de algo? La respuesta\nera JavaScript. El problema es que JavaScript se tiene que cargar por separado y\nmuchos desarrolladores lo empezaron a usar como solución fácil, haciendo que las\npáginas con mucho JavaScript tardaran mucho en cargarse.</p>\n<h3 id=\"la-era-dorada-de-la-libertad--flash-1996\">La era dorada de la libertad — Flash (1996)</h3>\n<p><img src=\"https://lh5.googleusercontent.com/SUeDnmoVg4KR2W-235o3m0-VjLhDPfyHYU6-1slJ6Oi0kWf_UDyqKWBIovugja5ECd3zwSXOegTUKW9dZNG_EuD-6B_kSKP1ixkhtsmbiG1-MgsQXb1CUHiP30-NSRq3VuYoa2sj\" alt=\"la era dorada de la libertad\"></p>\n<p>En el ’96 nació una tecnología con un nivel de libertad nunca antes visto en\ndiseño web…Flash. Un diseñador podía diseñar cualquier forma, <em>layout</em>,\nanimación, interacción, o usar cualquier tipografía. El resultado final se\nempaca en un solo archivo y se manda al navegador para allí mostrarse. Era como\nmagia… mientras el usuario tuviera el último plugin de Flash y tiempo de sobra\npara esperar a que se cargara. Fue la era dorada de páginas splash, animaciones\ncomo intro y todo tipo de efectos interactivos. Desafortunadamente no era muy\namigable para los buscadores y requería un procesador potente. Apple decidió no\nusarlo en el primer iPhone (2007) y fue el principio del fin para Flash.</p>\n<p>Ejemplo:<a href=\"http://www.mono-1.com/monoface/main.html\" target=\"_blank\">http://www.mono-1.com/monoface/main.html</a></p>\n<h3 id=\"css-1998\">CSS (1998)</h3>\n<p><img src=\"https://lh6.googleusercontent.com/MXF9nxupWtawgUHnkLwjBoNnkOBaLRQ5cbV2YmGiVY8lyHjQVAlvaEbGptxOfrp9sNSQptSGwF3l9TirqXhB1dEwHsQt2c54Dzv7qhNaeQsI99CuO5lrFY1PCQREEat3Qxyf4bFM\" alt=\"css\"></p>\n<p>Más o menos al mismo tiempo que Flash, una mejor forma de estructurar el diseño\nestaba en pañales — <em>Cascading Style Sheets</em> (CSS). El concepto básico es\nseparar el contenido de la presentación. El formato y <em>look</em> se definen en CSS,\npero el contenido en HTML. Las primeras versiones de CSS eran poco flexibles y\ntenía niveles bajos de adopción entre los navegadores. Pasaron varios años antes\nde que hubiera adopción general y muchas veces se encontraban muchos <em>bugs</em>.\nAdemás todos los navegadores tenían parámetros diferentes -- una pesadilla para\nlos desarrolladores.</p>\n<h3 id=\"el-alzamiento-móvil---grids-y-frameworks-2007\">El alzamiento móvil - <em>grids</em> y <em>frameworks</em> (2007)</h3>\n<p><img src=\"https://lh3.googleusercontent.com/Bq5zM-2NooVjbLlvwcI5Pbs3rMMuO4Qgb39onVRPHk5wjr0D4p3JhyUlXR6KcbBlLUiFT2l-E2sRTy3t8u9IchtCmtplzF_s_WE0Fvm4MrUKWaHHdWS6fKhTd0EWjmGLJ4r0QPYX\" alt=\"grids\"></p>\n<p>Navegar la web en un teléfono móvil fue todo un reto. Aparte de requerir un\nlayout diferente para cada aparato, existía también un tema de control de\ncontenidos ¿El diseño debería de ser igual en cualquier pantalla o se debería de\nimplementar un diseño más básico en móvil? ¿Dónde poner todos los anuncios en\nesa pantallita tan chiquita? La velocidad también era un tema ya que cargar\nmucho contenido rápidamente agota los datos de los usuarios.</p>\n<p>La primera mejora fue la idea de un grid dividido en columnas. Un grid de 960\npíxeles y 12 columnas se volvió el estándar. El siguiente hacia la\nestandarización fue diseñar los elementos más comunes — tipo la navegación, los\nbotones, los formularios, etc. — de manera que fueran fáciles de usar muchas\nveces. Por esto surgieron las bibliotecas de elementos visuales que ya contienen\ntodo el código para cada elemento. <em>Bootstrap</em> y <em>Foundation</em> son las\nbibliotecas más conocidas y demuestra que la línea entre una página y una app\nestá desapareciendo. Lo malo de esto es que muchas páginas se ven iguales y\ndiseñadores aún no pueden cambiarlas sin saber escribir código.</p>\n<h3 id=\"diseño-web-responsivo-2010\">Diseño web responsivo (2010)</h3>\n<p><img src=\"https://lh5.googleusercontent.com/StAV3qK4xxN0eHtTcMB798X81CfV7tucwkji3qsZl6Dy61QsMyKA1o8PY4fk99bi2L-6xu40p6xi4vOwQkNZi3QWV-qAUNE_CHOGWfPG3ozgtNvX_9anbbMjjboMVq4aEwojzhe1\" alt=\"diseño responsivo\"></p>\n<p>Un tipo llamado Ethan Marcotte propuso usar el mismo contenido pero cambiar el\nlayout. Se le llamó diseño web responsivo. Técnicamente seguimos usando HTML y\nCSS entonces es más un que nada un avance conceptual. La principal ventaja es\nque el contenido es el mismo - es una misma página que funciona en cualquier\npantalla.</p>\n<h3 id=\"todo-se-aplana-2010\">Todo se aplana (2010)</h3>\n<p><img src=\"https://lh5.googleusercontent.com/Z84zG6VGhn94oR-S02K3yynzcagHfB-pdmL1FNNYUALrEQ-zAES7JcQQcUMJ-gLYhcelBsayj8QdHPyN6SKjIiYGYq1aCk9RujMUPMX8B5HMLLSizrDKyi7cz4XjvdghA0GOu6Y6\" alt=\"todo se aplana\"></p>\n<p>Diseñar varios <em>layouts</em> para el mismo contenido toma más tiempo así que por\nsuerte la moda se ha alejado de efectos sofisticados (como las sombras) y ha\nvuelto a las raíces del diseño, dándole prioridad al contenido. Buena\nfotografía, tipografía, ilustraciones y layouts bien pensados son los elementos\nimportantes del diseño ahora. Esta simplificación quiere decir que hay mucho más\npensamiento detrás del contenido, la jerarquía del mensaje y el contenido en\ngeneral.</p>\n<h3 id=\"un-futuro-brillante-2014\">Un futuro brillante (2014)</h3>\n<p><img src=\"https://lh6.googleusercontent.com/YhDAD4JsM8nozDMPo28_wbh2cR1EJFv4U7Z36BBfam7bzNIDx_gPkwL1bOTfmGz1PbqGlaghGwZRSom29gihg-0Yt-2s8LvgNaGTq9LAPh4Oe0I8IQsrxQ8L1Yh6cusVK7mfeXen\" alt=\"futuro\"></p>\n<p>El santo grial del diseño web es llevar lo visual directamente a los\nnavegadores. Imagínense que los diseñadores pudieran tan solo mover algo en la\npantalla y que salga código limpio! Que tengan control y flexibilidad total y\nque los desarrolladores no tuvieran que preocuparse por compatibilidad entre\nnavegadores y pudieran enfocarse realmente en resolución de problemas.</p>\n",
          "order": 0,
          "durationString": "30min"
        },
        "01-visual-design-basics": {
          "title": "Reglas básicas de diseño visual",
          "type": "read",
          "format": "self-paced",
          "duration": 120,
          "body": "<p>Ahora que entendimos cómo llegamos hasta aquí, vamos a empezar a entender las\nreglas básicas del diseño visual aplicado al contexto digital. Aquí vamos a\ncubrir los 4 principios básicos para empezar a pulir el ojo crítico y entender\nqué funciona y qué no funciona para lograr una producto bien diseñado que sea\nfácil de entender, usar y leer.</p>\n<h2 id=\"principio-1-contraste\">Principio 1: Contraste</h2>\n<p><strong>El contraste en una página nos llama la atención, a nuestros ojos les gusta el\ncontraste. Si pones dos elementos en la página que no son iguales (como dos\ntipos de letra o dos anchos de línea), no pueden ser similares: para que el\ncontraste sea efectivo, los dos elementos deben ser muy diferentes.</strong></p>\n<p>El contraste tiene dos propósitos inseparables entre sí. Un propósito es crear\nun interés en la página: si una página es interesante para mirar, es más probable\nque se lea. La otra es ayudar en la organización de la información. Un lector\ndebe poder comprender instantáneamente la forma en que se organiza la información,\nel flujo lógico de un elemento a otro. Los elementos de contraste nunca deben\nservir para confundir al lector o para crear un enfoque que no se supone que sea\nun enfoque.</p>\n<h3 id=\"contraste-textofondo\">Contraste texto/fondo</h3>\n<p>El color del fondo y de la tipografía tienen que ser lo suficientemente\ndiferentes para no esforzar al ojo. Texto negro sobre fondo blanco suele ser la\nopción más legible. Grises claros, amarillo y verde son colores complicados. Si\ntienes que bizquear para leerlo entonces no hay contraste suficiente.</p>\n<p><img src=\"https://i.ibb.co/XjkK0S9/Artboard-Copy-4.png\" alt=\"contraste\"></p>\n<p>Si en algún caso no estas segura, en <a href=\"webaim.org/resources/contrastchecker\">este sitio web</a>\npuedes probar tu color de tipografía sobre el color de fondo y te entrega la\nrelación de contraste (si es suficiente como para usarlo).</p>\n<p>Como en todas las reglas, existe un contraste que puede resultar excesivo: el\nnegro (#000000) sobre blanco crea un efecto de movimiento para el ojo y es más\ndifícil enfocar las letras, en especial para personas con dislexia. Por eso es\npreferible usar tonos de gris casi negro (como #333333) sobre blanco, o\nreemplazar el blanco por grises muy claros.</p>\n<p><img src=\"https://i.ibb.co/9TwVKD4/Artboard-Copy-5.png\" alt=\"Casi negro\"></p>\n<h3 id=\"contraste-entre-elementos\">Contraste entre elementos</h3>\n<p>Por el contrario, cualquier cambio en las características visuales indican un\ncambio en jerarquía y/o funcionalidad de los elementos, por lo que el diseño\nvisual debe reflejar esa relación diferenciando evidentemente elementos de\njerarquía/funcionalidad distinta y manteniendo igual los elementos que cumplen\nla misma función.</p>\n<p>En la tipografía es importante diferenciar claramente los diferentes elementos\n(H1, H2, H3, P, etc) según su jerarquía. Esto da al usuario una pista\ninstantánea del orden de los contenidos, cuál es más importante, cuál es el tema\ncentral y subtemas, etc.</p>\n<p><img src=\"https://i.ibb.co/5GmXPRb/Artboard.png\" alt=\"Contraste en textos\"></p>\n<p>Lo mismo para los cambios en funcionalidad en los elementos, por ejemplo tiene\nque haber un contraste grande entre un botón activo e inactivo para que el\nusuario no pierda ni un segundo preguntándose si puede o no hacer click.</p>\n<p><img src=\"https://i.ibb.co/HT5bFpW/Artboard-Copy-3.png\" alt=\"Contraste entre botones\"></p>\n<h2 id=\"principio-2-repetición\">Principio 2: Repetición</h2>\n<p><em><strong>Una repetición de elementos visuales aprendidos por el usuario, en otros\n sitios y en tu mismo sitio, baja la curva de aprendizaje y fortalece el diseño\nal unir las partes separadas de otra manera.</strong></em></p>\n<h3 id=\"consistencia-entre-elementos-dentro-del-sitio-web\">Consistencia entre elementos dentro del sitio web</h3>\n<p>Percibimos los objetos que comparten características visuales (tamaño, color,\ntextura, dimensión, forma u orientación) como pertenecientes a un mismo grupo ya\nsea en funcionalidad como en jerarquía.</p>\n<p>El el diseño visual la forma debe seguir la función, y elementos que tienen una\nmisma función, estado y jerarquía deben mantener las mismas características\nvisuales (color, tamaño, icono, tipografía, forma).</p>\n<p><img src=\"https://cdn.pbrd.co/images/HSD6eRY.png\" alt=\"Consistencia\"></p>\n<p>Esta consistencia no sólo marca la relación o distinción entre contenidos, sino\nque además da unión a todas las páginas demostrando que pertenecen a un mismo\nsitio. Esto es pecialmente importante en aquellos elementos que se deben repetir\nen todas las vistas como el header y el footer. Cualquier discontinuidad en\naquellos elementos indicaría al usuario que ya no se encuentra en el mismo sitio\n(con toda la desconfianza que eso podría significar).</p>\n<h3 id=\"consistencia-con-otros-sitios-web\">Consistencia con otros sitios web</h3>\n<p>La Ley de Jakob explica que los usuarios pasan la mayor parte de su tiempo en\notros sitios, lo que significa que los usuarios prefieren que tu sitio funcione\nde la misma manera que todos los demás sitios que ya conocen.</p>\n<p>Esto se logra respetando la locación y forma de los elementos según el usuario\nacostumbra. Por ejemplo el usuario espera encontrar el logo del sitio arriba a\nla izquierda, el menú arriba a la derecha, la información de contacto en el\nfooter, una introducción a lo que es el sitio al inicio, etc. Y la forma de los\nelementos de la interfaz debe mantenerse como el usuario está acostumbrado para\nque entienda instantáneamente que es y cómo se usa, por ejemplo que un select\nsea una cajita con un \"Selecciona una opción\" a la izquierda y una flecha hacia\nabajo a la derecha, o que una etiqueta sea un rectángulo pequeño con un color de\nfondo y una palabra en su interior, normalmente localizado bajo el título o\nelemento que está clasificando.</p>\n<p><img src=\"https://cdn.pbrd.co/images/HSD6UdC.png\" alt=\"Consistencia con otros sitios\"></p>\n<h2 id=\"principio-3-alineación\">Principio #3: Alineación</h2>\n<p><strong>Nada debiese estar posicionado arbitrariamente en la página. Para que el sitio\nse vea limpio y ordenado, cada elemento debiese tener una conexión visual con\notro elemento y ésta se logra a través de la alineación.</strong></p>\n<p><img src=\"https://cdn.pbrd.co/images/HSD5KBb.png\" alt=\"Alineación\"></p>\n<p>Cuando los elementos están alineados en la página, el resultado es una unidad\ncohesiva más fuerte. Incluso cuando los elementos alineados están separados\nfísicamente entre sí, hay una línea invisible que los conecta, tanto en tu ojo\ncomo en tu mente. Aunque es posible que haya elementos separados para indicar\nsus relaciones (utilizando el Principio de proximidad), el Principio de\nalineación le dice al lector que aunque estos elementos no están cerca,\npertenecen a la misma pieza. Para que esta alineación sea evidente, mantén la\nmenor cantidad de ejes de alineación posible.</p>\n<p>Al momento de escoger la forma de alinear prioriza a la izquierda. La alineación\na la izquierda es la más natural para la forma de lectura occidental a la que\nestamos acostumbrados. Evita alinear al centro o derecha a menos que sea en\nelementos específicos y con una intención en el diseño o jerarquía. Los textos\njustificados en el mundo digital no son recomendables porque generan espacios\nentre letras y palabras que se perciben como lagunas en blanco dentro del texto\nque dificultan la lectura, en especial para personas con dislexia.</p>\n<p>Veamos un ejemplo:</p>\n<p><img src=\"https://lh3.googleusercontent.com/DuhhwjtP4rV1EeeDPyBJ7ETaWW6G_HDjLtrUu2xBO5EomKceKa82vHBBSgNkncsW8MBAFiy79d6dLmevDNOoFEsxWUbn3OyIXNRoIeFQ9iOiF6OKqBCSHNojsNPIcWmNvLRcYiZ6\" alt=\"medium\"></p>\n<p>Esto es un layout modificado de Medium.com — ¿qué les parece? ¿qué no está\nfuncionando en este layout?</p>\n<p><strong>Tip:</strong> mirar la justificación de la primera imagen…¿cómo se ve?</p>\n<p><img src=\"https://lh5.googleusercontent.com/s-cPH27PfaEoJdPsDYiipLoaZ1bhfGMoicmnf85TZcCZTAP-3J0hPqaM_51xKZzyvxcrImMU8zKkCehFDM8DZVLPfvykcw7qxvviCL-E2cY85TD1w_dRxOcpWgECukDZ-RE_nOtH\" alt=\"regla 4 - alineación 1\"></p>\n<p><img src=\"https://lh6.googleusercontent.com/QBFXJsGVTruYfhSJXkbmfy_ut16chdYhYFDaRGDTR8oA2r66ccDXz2TVjMvMWyMTmRd6FiL0sUPOFnB35Ch-oiTyr8LvMv1qkRm7jQoPH9BzKCPLqV-eu3RmtYFucqDV2_2-v3cy\" alt=\"regla 4 - alineación 2\"></p>\n<p>En la primera imagen, se ve un río visual generado por una falta de alineamiento\nentre todos los bloques de contenido. En la segunda imagen, los bloques de\ncontenido <strong>sí</strong> están alineados.</p>\n<p><img src=\"https://lh5.googleusercontent.com/Jq7xNl2Htg3pERzKsP3LW25upa0D9YGBCMT1ni0mQQ2J0F_HNnd3feuMGRjLnTvo_Gdcan2Zo6_kyVuANd37vJ76eq0xRZSeIcJ3URhGMo5v-d4e7DPdE8GWY5Au5JKbzd7bTVql\" alt=\"regla 4 - alineación 3\"></p>\n<p>Aquí está todo alineado al grid. Se ve más limpio y la página es más legible.</p>\n<h2 id=\"principio-4-proximidad\">Principio #4: Proximidad</h2>\n<p><em><strong>Los elementos relacionados entre sí deben presentarse agrupados. Cuando varios\nelementos están cercanos los unos a los otros, se perciben como una unidad visual\nen vez de varios elementos. Esto ayuda a organizar la información, reduce el\ndesorden y le da al lector una estructura clara.</strong></em></p>\n<p>En el trabajo de nuevos/as diseñadores/es los textos y gráficas están repartidos\npor todo el espacio, sin dejar espacio en blanco. Cuando las piezas de diseño\nestán repartidas, la página se ve desorganizada y la información está menos\naccesible para el lector. Según el Principio de Proximidad los elementos\nrelacionados deben ser agrupados. Acerca los ítems cuyo contenido esté\nrelacionado, de manera que se vean como un sólo grupo en vez de en vez de un\nmontón de elementos sueltos.</p>\n<p>Así mismo, ítems o grupos de información que no estén relacionados deben estar\nseparados. Esto da al lector una pista visual instantánea como está organizado\nel contenido de la página.</p>\n<p><img src=\"https://i.ibb.co/Bf73wgp/1-CAUr4-Sp-Pf-Pf3-Lz-NWt-XT2w.png\" alt=\"Ley de proximidad\"></p>\n<p>Percibimos los objetos que están cerca unos de otros como similares. Por lo\ntanto, tendemos a agrupar las cosas que son cercanas, incluso si son diferentes.</p>\n<p><img src=\"https://i.ibb.co/9GvMKs7/Proximity.png\" alt=\"Proximidad\"></p>\n<p>Esto funciona siempre que la agrupación próxima tenga un límite definido, ya sea\nexplícitamente delineado o con margin / padding.</p>\n",
          "order": 1,
          "durationString": "2h"
        },
        "02-color": {
          "title": "Color",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Hasta este punto, seguramente ya realizaste un sketch con lápiz y papel que más\ntarde pasaste a un prototipo blanco y negro ¿verdad? Seguramente estás contenta\ncon el resultado, pero ahce falta algo: <em><strong>COLOR.</strong></em></p>\n<p>Ésta, sin duda es la gloria o el tormento de muchas, pero para que esto sólo sea\nun momento de creatividad fluida, te vamos a dar algunas pautas para que con\npráctica te conviertas en una experta ;)</p>\n<p>Al pensar en el color, por tu mente no sólo debe pasar: ''Este color está lindo,\neste me gusta y estos combinan''. El pensar en el color y en todos los elementos\nque hemos visto hasta ahora, los debemos ver como elementos que aportan\nsignificado, y en términos de nuestro producto, van a reafirmar o contradecir el\nmensaje que queremos transmitir.</p>\n<p><strong>Ahora, ¿qué nos dicen de los colores?</strong></p>\n<p>Retomando el punto anterior, cada color tiene una personalidad única que nos\nsignificado en conjunto.</p>\n<p><em>Como este azul:</em> que es como el color base en una composición.</p>\n<p><img src=\"https://lh5.googleusercontent.com/SN4omjyMehr27O6iMqKTqEr7xYDJAEdfqJrJ_rEtDgv70xYUxpHp8i8WZ7w92Xy4hM5bP2q5-L5W2NDk_Yxex7WFs-O7aA2acHQ_S0UF_FW8dG-hazdK2QyacwsMJM963ppspxQJ\" alt=\"image alt text\"></p>\n<p><img src=\"https://lh6.googleusercontent.com/mhsVv2MpHxhwqxhRp0-urtAETZ3b6f9l0l0cGc_y1GJtNt_PCnSKNUwwvrGu3Y6h24-23GJCMw8C13ZsfN_YdegmIifhlTcKzMiji1TNJG7HpIG4dk6nUHaSY7tNonWFKz2pruAu\" alt=\"image alt text\"></p>\n<p>Y el <em>naranja</em> es el color acento que se va a usar para dar énfasis a elementos\nque tienen que llamar la atención. Por lo cuál, para la elección de ambos se\ndebe pensar en contraste con el color base.</p>\n<p>Para esto, puedes usar una herramienta tipo<a href=\"http://paletton.com/\" target=\"_blank\">Paletton</a> para\nencontrar tu acento.</p>\n<p><img src=\"https://lh3.googleusercontent.com/oavXsdFyCHStUR_Ne7y5v191_a-LwXhV01tRTUt0XqQ0dr4zZLWZ3xJDS7is1SAsDypt7iQB3OSuvmZJJ4RT77quyz4FvcVXQnQ2oY5ljSg9zVstYZx4Hl7EvNn8ibLcLgEaEVY7\" alt=\"image alt text\"></p>\n<p>En este caso podrías tomar#37733FE (azul) y  #FFB520 (naranja) junto con 2 o 3\ntonos de gris para completar tu paleta básica.</p>\n<p><img src=\"https://lh3.googleusercontent.com/2qSXbIVrjUEbixbFscn1AjOp3r8-c6K68EiHmeKzqcMa_DDCh-w9xdoD5Pz9_EDDJbfk5AkAmWDUcTJTpL4FgurZU4MqEhaGN661Hs_ey6mcQdbgZqVE0rGkDEtBydyEAVOvZRt5\" alt=\"image alt text\"></p>\n<p>Hay otras herramientas como <a href=\"https://coolors.co/\" target=\"_blank\">Coolor</a>, que de manera fácil\nte ayuda al dar paletas de colores de manera automática.</p>\n<p><img src=\"https://image.ibb.co/f6Jefo/colores.png\" alt=\"Coolors\"></p>\n<p>Y como te mencioné anteriormente, el color va más allá de una simple elección y\npara ello, debes tener en cuenta elementos como:</p>\n<ul>\n<li><a href=\"http://www.fotonostra.com/grafico/colorescalifrios.htm\" target=\"_blank\">Colores cálidos y fríos</a></li>\n<li><a href=\"https://lamenteesmaravillosa.com/psicologia-del-color-curiosidades/\" target=\"_blank\">Psicología del color</a></li>\n<li><a href=\"https://www.w3schools.com/colors/colors_rgb.asp\" target=\"_blank\">Colores RGB</a></li>\n</ul>\n<p>Este es un tema apasionante, te invito a que te vuelvas una experta y que lleves\ntus proyectos a otro nivel visual :)</p>\n",
          "order": 2,
          "durationString": "30min"
        },
        "03-color-exercises": {
          "title": "Ejercicios sobre color",
          "type": "practice",
          "format": "self-paced",
          "duration": 40,
          "body": "<h2 id=\"reto-1\">RETO 1</h2>\n<p>Crear un sketch sobre una tienda de accesorios pero sin título ni productos.\nSobre esta página, vas a hacer tres variaciones con paletas de colores\ndiferentes.</p>\n<p>Sobre esto:</p>\n<ul>\n<li>Preguntar sobre qué transmite cada página con base a la paleta de colores y\ndocumentarlo en un README</li>\n</ul>\n<h2 id=\"reto-2\">RETO 2</h2>\n<p>Crear una paleta de colores para cada palabra y docuementarlo en el mismo\nREADME.md que el reto de arriba.</p>\n<ul>\n<li>Alegría</li>\n<li>Depresión</li>\n<li>Libertad</li>\n<li>Infantil</li>\n<li>Inclusión</li>\n<li>Tecnología</li>\n</ul>\n",
          "order": 3,
          "durationString": "40min"
        },
        "04-typography": {
          "title": "Tipografía",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"tipografía-y-composición\">Tipografía y composición</h2>\n<p>Ya tienes una base con las reglas básicas del diseño visual también viste cómo\nusar el color y ahora vas a aprender a utilizar las tipografías.</p>\n<h3 id=\"clasificaciones-tipográficas\">Clasificaciones tipográficas</h3>\n<p>Algunos dicen que elegir tipografías es como elegir tu ropa — ¿qué dice tu ropa\nde ti? La ropa que te pones va a formar la idea que los demás tengan de ti — de\ntu estilo, tu personalidad, tu nivel socio-económico, tu edad, etc. También, se\nelige según la ocasión — no te pondrías un traje de baño para ir a una\nentrevista de trabajo y no te pondrías un traje sastre para ir a la playa.</p>\n<p>Las tipografías que elijas para tus proyectos tienen la misma función que la\nropa — la tipografía forma parte de la primera impresión de cualquier página.\nPor eso, las elecciones tipográficas tienen que ser muy consideradas. ¿Tu\ntipografía está diciendo “vacaciones en la playa” cuando tendría que decir\n“entrevista de trabajo”?</p>\n<p>Las dos clasificaciones tipográficas principales se llaman\n<em>serif</em> y <em>sans-serif</em>. Otras clasificaciones incluyen <em>oldstyle</em>, <em>script</em> y\n<em>decorative</em>.</p>\n<p><img src=\"https://lh4.googleusercontent.com/7bB_CEYhhThwZ340hWD0Y-9Fqc2ZHjtdM6gZXEj3NQ31bW8XvK2knhjIRkOFGT2EoZdMFYDJX4vS0LYoBZxUepKDThHrvEG-Ky9U3bF0Y33RhaULLQBIBXjrF4noljnVXkiW1uqzgTk\" alt=\"Ejemplo\"></p>\n<ul>\n<li><strong>Serif:</strong> <em>serif</em> se refiere a las patitas decorativas que tienen las letras.\nPor lo general, se ven más serias y tradicionales. Si es un texto largo, esas\npatitas ayudan a que el texto sea más legible y fácil de leer porque las letras\nse distinguen bien entre sí.</li>\n</ul>\n<p><img src=\"https://lh6.googleusercontent.com/tKuboloGErNhtiLSZhDOrfxPj_8QS4WNVOlrwzZgWEt3ZfW6pFe2vsakC0MZFfcsiXi4w4wn8yA6bQIj0jRKpfRCJuF6vppxdibWW3DIs3C89oStpP208laeRSK61wXN393RVSgkoEM\" alt=\"Marcas más tradicionales o de lujo muchas veces usan tipografías serif para\ndarle un toque elegante.\"></p>\n<ul>\n<li><strong>Sans-serif:</strong> <em>sans-serif</em> literalmente significa “sin serif”… osea no\ntiene esas patitas decorativas. Sin ellas las letras se ven más modernas y\nminimalistas. Adecuadas para un público que tiene poca experiencia leyendo - por\nejemplo los niños - son más fáciles de leer porque las letras son más sencillas.</li>\n</ul>\n<p><img src=\"https://lh4.googleusercontent.com/n8ciNTf_To3PqRGT8JbCWInEusS-DazNTK6r9xI-gYz-CEt0FTYQRY3Lmqz-2yXcPg4OTCzL5IlUl9OnidCqjkl98EMNWp0-JkdwLFDpDRjJe0K7OiLY-z5VJ-J3FoRQ31E9B0mJgwE\" alt=\"Uber, como la mayoría de las empresas de tecnología, usa tipografías\nsans-serif para posicionarse como una marca moderna. \"></p>\n<ul>\n<li><strong>Inglés antiguo:</strong> se distinguen por sus trazos dramáticos y remolinos en la\nparte del serif. No son tan populares hoy como en el año 1500 — son difíciles de\nleer entonces normalmente solo se usan para encabezados.</li>\n</ul>\n<p><img src=\"https://lh6.googleusercontent.com/PpuhyIBf8TpdHwANL3zvwsaNmEp-skD3bRUCa8YaUfgwY2i5g5-crc4LCOmT_uwopWdglBATIqonxJ639L1BMeGPXAythab1-XdcwjXstZzzPd5ESKBoTKM1ImU9d1yBjPjGY2V3o6A\" alt=\"Muchos periódicos usan estas tipografías para hacer pauta en sus raíces, la\ntradición, y por ende en la confiabilidad de sus reportajes.\"></p>\n<ul>\n<li><strong>Cursivas:</strong> éstas son tipografías que parecen escritas a mano. Por lo\ngeneral, las letras están conectadas y hay muchos estilos — desde elegantes a\ndivertidas a dibujadas.</li>\n</ul>\n<p><img src=\"https://lh4.googleusercontent.com/nP5Racuxs9Ya90s1-kNbw5ssGWf0Gvwwrmn-o6wsVUj3XPFdNNA8oM3mT1qehKyetMk1_zShNC4qFjigtUFmS673U-fxTdtseO2xvL9kAiPGsjWaPPOlCPjnkEHCowZIOWL0hyCrRgk\" alt=\"Cursivas se usan mucho en marcas que quieren verse muy accesibles. También,\nvan bien con productos orgánicos o infantiles. \"></p>\n<ul>\n<li><strong>Decorativo:</strong> son tipografías con la intención de llamar la atención. Por\nlo general, son muy originales y poco prácticas. Se deben de usar muy poco y con\nuna intención específica.</li>\n</ul>\n<p><img src=\"https://lh3.googleusercontent.com/xVoVMag_OIb-rm6XV5s9Gx4lfT92p3LXExQzIDaXPW0PqM3jYKoHnAruC8m6emAcGuaXzm-8klCne46X-ZyZaz5_1gvwBYKsFiTW2ig7VOZtdp_el2UatSXkzgk7WRQlIHeRyjgLDoE\" alt=\"Tipografías decorativas son poco prácticas pero pueden tener un impacto visual\nimportante. Se usan mucho en obras más artísticas, conceptuales o abstractas.\"></p>\n<h3 id=\"familias-tipográficas\">Familias tipográficas</h3>\n<p>El término “Fuente tipográfica” se usa para describir variaciones de una misma\ntipografía. Por ejemplo, pueden ver que Gotham, una familia muy extensa, tiene\n16 variaciones:</p>\n<p><img src=\"https://lh4.googleusercontent.com/YIuIVacgi6-NHfdgyLyyI9nmui1wPY1X0ZpOuZf6dpJDPxQREdEkGEqPBQxjKX3FhyHhd3cAxTZs7OgbhI7n5n9QNYN-haWrBBBnf9EFRt-N21hhwgRzpezdVboN52pqLgVB2a0wL38\" alt=\"Ejemplo\"></p>\n<p><a href=\"https://tiposformales.com/2010/09/04/clasificacion-tipografica/\" target=\"_blank\">Si quieres profundizar en las clasificaciones tipográficas vista este link</a></p>\n<h4 id=\"cómo-elegir-qué-tipografías-usar\">Cómo elegir qué tipografías usar</h4>\n<p>De nuevo volvemos a las bases que definimos al principio del proyecto. ¿Qué\nrepresenta tu marca y cómo es tu público? Antes de empezar a buscar tus\ntipografías, es útil primero pensar en un par de cualidades que quieras\ncomunicar con tu diseño. Así cuando elijas tipografías, ya tienes un esquema en\nmente. ¿Debería de ser casual, serio, elegante o juguetón? Si las\ncaracterísticas de la tipografía no encajan con el carácter de tu mensaje, vas a\ngenerarles una desconexión visual a tus usuarios. Hay que pensar en esto y no en\ngustos personales a la hora de elegir. Una tipografía que te parezca divertida o\nbonita tal vez no sea útil o apropiada para tu proyecto.</p>\n<h4 id=\"cómo-combinar-tipografías\">Cómo combinar tipografías</h4>\n<p>Depende del uso que se le vaya a dar. No es lo mismo elegir una tipografía para\nel texto de una revista digital (hay que priorizar la legibilidad) que elegir\nuna tipografía para el encabezado de un poster para tu banda favorita. Para este\nproyecto, vamos a elegir sólo tres.</p>\n<ol>\n<li>Encabezados: aquí se pueden tomar más riesgos y elegir tipografías más\noriginales, siempre y cuando peguen con la personalidad de la marca</li>\n<li>Cuerpo del texto: para el cuerpo del texto siempre se eligen tipografías\nserif o sans serif, priorizando tanto la personalidad de la tipografía como\nla legibilidad</li>\n<li>Botones y links: para los links la legibilidad también es muy importante ya\nque son de los componentes más útiles de una interfaz</li>\n</ol>\n<ul>\n<li>No todas las tipografías tienen todos los caracteres del alfabeto, para\nnuestros proyectos hay que asegurar que tengan mínimo acentos y la ‘ñ’.</li>\n</ul>\n<p>Combinar tipografías es un poco un arte — quieres elegir dos tipografías que\nsean complementarias pero no demasiado parecidas. Diferentes, pero no tanto que\nchoquen. No caer en los extremos de demasiado contraste o no lo suficiente puede\nser un proceso de prueba y error. Hacer buenas combinaciones se trata de\nexperimentar e ir desarrollando tu ojo. Aunque sí hay algunas tips que pueden\nayudar:</p>\n<ul>\n<li><p>Encuentra alguna característica compartida: tipografías que se ven muy\ndiferentes pero que comparten alguna cualidad por lo general funcionan bien.\nEsa cualidad puede ser las proporciones generales como el alto o ancho de las\nletras, o dos tipografías que compartan una estructura o esqueleto subyacente.\nAunque los parecidos sean sutiles, le da una aire cohesivo a tu combinación.</p>\n</li>\n<li><p>Encontrar tipografías del mismo diseñador: diseñadores de tipografías muchas\nveces emplean una estética parecida en sus diferentes tipografías. Compartirán\nuna estructura parecida que las permita combinarse bien. Busca familias\ntipográficas llamadas “super familias” que vienen con una versión serif y\nsans-serif que están diseñadas específicamente para que se complementen.\n<a href=\"https://fonts.google.com/specimen/Alegreya\" target=\"_blank\">Alegreya</a> y <a href=\"https://fonts.google.com/specimen/Alegreya+Sans\" target=\"_blank\">Alegreya Sans</a>\no <a href=\"https://fonts.google.com/specimen/Merriweather\" target=\"_blank\">Merriweather</a> y\n<a href=\"https://fonts.google.com/specimen/Merriweather+Sans\" target=\"_blank\">Merriweather Sans</a>\nson super-familias tipográficas (y gratuitas).</p>\n</li>\n</ul>\n<p><img src=\"https://lh4.googleusercontent.com/FiJeJZ7iWQ9ciGQlzYzvNqQz8aDLq3wruNW2UAG4ur7I8Jc8F81rG8oEJVwqFcBTTZOVm_2FrP9IGc-f46v1Vi-ROG60gpysRfc4ItnlVNF_tlXOszcJnHQEtEB23IQ72SPyrcaLvBw\" alt=\"Ejemplo\"></p>\n<ul>\n<li>Hay otras reglas para saber cómo usar tipografías, por ejemplo: que\ncontrasten.</li>\n</ul>\n<p><img src=\"https://image.ibb.co/ejT1t8/tipo.png\" alt=\"Tipografías\"></p>\n<p>Un buen punto de partida es tomar alguna combinación ya hecha. <a href=\"https://www.reliablepsd.com/ultimate-google-font-pairings/\" target=\"_blank\">Aquí</a>\ny <a href=\"http://fonts.greatsimple.io/eczar-worksans/\" target=\"_blank\">aquí</a> hay muy buenas combinaciones\ny todas las tipografías vienen de <a href=\"http://fonts.google.com/\" target=\"_blank\">Google Fonts</a>\ny se pueden bajar gratuitamente. El chiste es jugar con diferentes combinaciones\npara ver qué funciona.</p>\n<h2 id=\"recursos-extra\">Recursos Extra</h2>\n<ul>\n<li>Herramientas<ul>\n<li><a href=\"http://fonts.google.com/\" target=\"_blank\">Google Fonts</a></li>\n<li><a href=\"https://www.reliablepsd.com/ultimate-google-font-pairings/\" target=\"_blank\">The Ultimate Collection of Google Font Pairings</a></li>\n<li><a href=\"http://fonts.greatsimple.io/\" target=\"_blank\">2017 TRENDY GOOGLE FONTS COMBINATIONS</a></li>\n</ul>\n</li>\n<li>Lectura<ul>\n<li><a href=\"https://www.canva.com/learn/font-design/\" target=\"_blank\">Learn Font Design</a></li>\n<li><a href=\"https://www.canva.com/learn/typography-mistakes/\" target=\"_blank\">20 Typography Mistakes Every Beginner Makes</a></li>\n</ul>\n</li>\n</ul>\n",
          "order": 4,
          "durationString": "30min"
        },
        "05-hierarchy": {
          "title": "Jerarquía y diseño responsivo",
          "type": "read",
          "format": "self-paced",
          "duration": 90,
          "body": "<h2 id=\"objetivos-de-aprendizaje\">Objetivos de aprendizaje</h2>\n<ul>\n<li>Identificar técnicas comunes para utilizar jerarquizar el contenido de nuestras\ninterfaces</li>\n<li>Conocer los siete principios básicos de diseño responsivo</li>\n</ul>\n<h2 id=\"jerarquía-crear-equilibrio-y-organizar-el-resto-de-tu-diseño\">Jerarquía: crear equilibrio y organizar el resto de tu diseño</h2>\n<p>Después de crear un punto de enfoque para captar la atención de tu usuario, el\nresto del contenido se tiene que organizar de manera que el usuario pueda\nfácilmente navegar tu página. Aquí es donde entra la <strong>jerarquía</strong> para crear\nuna secuencia clara que guíe al usuario por el resto de la composición. ¿Sus\nojos deberán de ir hacía abajo? ¿Hacía la izquierda? ¿De una sección a otra?</p>\n<p>Cómo el diseño fluye del punto de enfoque hacia el resto de la composición es la\nclave. Puedes guiar al usuario usando algunas de las técnicas que vimos en la\nclase pasada, pero la mayoría de los diseños van a mejorar si tienen alguna\nestructura u organización general. En vez de simplemente ir colocando el\ncontenido en donde haya espacio, hay que ser considerados y colocar las cosas\ncon intención para lograr una composición más utilizable y visualmente\natractivo. Algunas técnicas comunes son las siguientes:</p>\n<h3 id=\"usar-un-grid\">Usar un grid</h3>\n<p>Alinear tu diseño con un grid es una forma fácil y efectiva de mantener todo\norganizado. Las posibilidades para layouts siguiendo con grid son casi\ninfinitas. La página abajo usa un grid para darle una estructura a la navegación\ny contenido y así organizar y separar elementos. Resulta en una composición\nlimpia y ordenada que establece una forma clara de explorar la página y\nencontrar lo que necesitas.</p>\n<p><img src=\"https://lh5.googleusercontent.com/K5EhlHQgaUSrOagGDmHYUVtDjpaFJ1ZycQATtfL5lXgJ1waNjY5pMX2ItIS-WJRRXY7SsDnKDTDsTcglCvPoSN1gkDRC-3TcN0jGPKnAcmY72O_72bWBnupo_-DYhNRa5eeIf1zcI0U\" alt=\"grid\"></p>\n<h3 id=\"usar-la-regla-de-los-tercios\">Usar la “regla de los tercios”</h3>\n<p>La regla de los tercios es una técnica de composición clásica de artes visuales\ny fotografía. Cuando el punto de enfoque está justo en el centro de una\ncomposición, el resultado es aburrido y predecible. Para crear una composición\nmás dinámica e interesante, puedes desplazar el punto de enfoque hacia un lado.\nEl grid que usa la regla de los tercios (abajo) es un atajo para crear una\ncomposición equilibrada pero dinámica. Divide un espacio en tres partes iguales\nhorizontal y verticalmente con 6 líneas. Los 4 puntos en los que esas líneas se\ncruzan son buenos lugares para poner tus puntos de enfoque.</p>\n<p>El anuncio abajo pone el punto de enfoque (el logo y nombre de la marca que\npromueve) en el primer tercio vertical de la composición. También noten cómo las\ncarteras crean la forma de la bandera británica (el anuncio es para una empresa\ninglesa de productos de piel y también apuntan directamente hacia la marca. Esta\nes una técnica componente que se llama líneas de dirección.</p>\n<p><img src=\"https://image.ibb.co/gGEn17/Rule_of_Thirds.png\" alt=\"regla de los tercios\"></p>\n<h3 id=\"considera-la-simetría\">Considera la simetría</h3>\n<p>La simetría es uno de los factores más importantes para lograr equilibrio en un\ndiseño. Un diseño simétrico (aunque no sea exacto) mejora el equilibrio visual\nde un layout. El diseño abajo tiene simetría tanto vertical como horizontal\nentonces aunque sea de un diseño muy recargado, mantiene cierto equilibrio.</p>\n<p><img src=\"https://speckyboy.com/wp-content/uploads/2013/01/symmetry_06.jpg\" alt=\"simetria\"></p>\n<h3 id=\"deja-algo-de-espacio-vacío\">Deja algo de espacio vacío</h3>\n<p>Las áreas blancas de una página no es espacio desaprovechado — es más bien\nesencial para una composición equilibrada. Dejar espacio vacío suficiente es\nimportante para evitar que tu diseño se vuelva desordenado. También ayuda a que\nel ojo tenga dónde descansar entre elementos o secciones de contenido. Esto es\nsúper importante para que una composición con mucho contenido no abruma al\nusuario.</p>\n<p>Por ejemplo, los espacios vacíos entre el contenido de esta página ayuda a que\ntu ojo vaya de una cosa a la siguiente. Fluye y mantiene un estilo limpio y\nmoderno.</p>\n<p><img src=\"https://lh5.googleusercontent.com/HDsKf1c4VcQnpR_yFOZ5vGys0AOV5mrGOlCSWGPKexXRVby0rAZeV0dmcNRtXm2b6sKZaXM9--tpPcSePvEdfi4i61gEiEIiE0Famsg-Tr5GxNfpVGpQiyICsY0XJ2HQV76soIVIFUA\" alt=\"deja espacio vacío\"></p>\n<h2 id=\"líneas-de-dirección-crear-movimiento-para-guiar-al-ojo\">Líneas de dirección: crear movimiento para guiar al ojo</h2>\n<p>Líneas de dirección pueden ser literales o implícitas que llevan al ojo de tu\nusuario a donde quieres que miren — por lo general a un punto de enfoque pero a\nveces simplemente de una sección o elemento a otro. Líneas de dirección pueden\nvariar en forma:</p>\n<h3 id=\"líneas-diagonales\">Líneas diagonales</h3>\n<p>Diagonales generan movimiento o insinúan dirección en un diseño, muchas veces de\narriba a abajo o de izquierda a derecha, como en la lectura.</p>\n<p>Otra técnica común es usar dos líneas diagonales que vienen de direcciones\nopuestas para enfocar el ojo del usuario en un punto singular. Si alguna vez\nhas tomado una clase de arte, un ejercicio común es dibujar una calle que\ndesaparece yendo hacía el horizonte: dos líneas diagonales provenientes de\ndirecciones opuestas que empiezan ancho pero se va haciendo más estrecho hasta\nque se unen en algún punto del horizonte. Este punto se conoce como el punto de\nconvergencia. Es un ejemplo muy básico de líneas diagonales en acción y es una\nde las formas más fáciles de crear profundidad y perspectiva en una composición.</p>\n<p>La página abajo usa este concepto para organizar su galería de productos. Nota\ncómo las líneas diagonales formadas por la forma amarilla en el fondo crean una\nsensación de profundidad en el diseño.</p>\n<p><img src=\"https://lh3.googleusercontent.com/Lx6QrF0oBCLlhe6RYRH8SA_np4zf5PR9d8sBsAVsH90_i47VY3M85nATLaX4XHAA-YvMNqAmLiV5WlAv6UI4voB5st797IVvxhNP4RAk3BBKm0p6gc2zfg8O7ILEOpfNXxUjxoy0YEM\" alt=\"lineas diagonales\"></p>\n<p>En el siguiente ejemplo, noten cómo la ilustración principal en la portada del\nlibro crea una línea diagonal que apunta hacia el título. Después tu ojo puede\nseguir el mismo camino hacía los subtítulos y el autor. Es una composición\ninteligente y eficaz, además de establecer visualmente el tema del libro.</p>\n<p><img src=\"https://lh5.googleusercontent.com/Z1SO-g18efO-zZU0GBwhLz3pI1qjuR0wXRo1aGhN7T7ifu4LDpDmRlTocnGsRF1an5KMZCVJ_mYE3Uz8cJGH0sFP_R18exUzdYppY6fcb6v2oEVDel9tBCC7MAK9AWp9163_dxIHtBQ\" alt=\"Ejemplo\"></p>\n<p>Por otro lado, el movimiento diagonal en este ejemplo no se guía con una línea\nen sí, pero implícito por la colocación y la superposición de cada elemento.\nResulta en una composición más interesante visualmente que un diseño basado en\nel grid tradicional.</p>\n<p><img src=\"https://lh4.googleusercontent.com/uPr9V6P-216V-n-3Pom71QuCEsThu7b1UBPgwexStGMTn_U6YA-f4c_8r5c1J2_eAW0IyMB4aPs_l8uUbN7Wilm4v0FjR2ChwkD1gJOSBjGy20V9kARQeecDMaIz7_UwlLnmfdQPinQ\" alt=\"Ejemplo\"></p>\n<h2 id=\"diseño-responsivo\">Diseño responsivo</h2>\n<p>El espectro de pantallas, tamaños y resoluciones crece cada día y crear un\ndiseño específico para cada tamaño sería imposible. El diseño web responsivo\nsoluciona este problema. No podemos pensar en tamaños fijos ni en sólo diseñar\nen píxeles. Ahora la web se va volviendo algo más fluido y orgánico y los\nprincipios de diseño responsivo ayudan a ir con la corriente en vez de luchar\ncontra ella. Una página se debería de verse y funcionar bien independientemente\nde si la estás viendo en una computadora o un teléfono o usándola con tu mano o\ncon un mouse. Lograr esto es un conjunto de conceptos y técnicas que, en su\nconjunto, se llaman ‘diseño responsivo’.</p>\n<p>Vamos a ver siete principios básicos de diseño responsivo:</p>\n<ol>\n<li>Diseño responsivo vs. diseño adaptable</li>\n<li>Desplazamiento</li>\n<li>Unidades relativas</li>\n<li>Los breakpoints</li>\n<li>Valores max y min</li>\n<li>Objetos anidados</li>\n<li>Tipografías web vs. tipografías del sistema</li>\n</ol>\n<h3 id=\"diseño-responsivo-vs-diseño-adaptable\">Diseño responsivo vs. diseño adaptable</h3>\n<p>Pareciera que es lo mismo pero no lo es. Con diseño responsivo, el mismo layout\nresponde automáticamente al tamaño de la pantalla, como una pelota que crece o\nencoge para pasar por diferentes aros. Se logra usando grids fluidos entonces un\nsolo layout puede funcionar en cualquier pantalla. La ventaja es que las páginas\nresponsivas se cargan más rápido pero son más complejos de implementar.</p>\n<p>Diseño adaptable es diferente porque no hay un solo layout, sino varios layouts\ndiferentes que se diseñan para múltiples pantallas. El layout que se use depende\ndel tamaño de la pantalla. Por ejemplo, puede haber un layout específico para\nmóvil, tablets y computadora y cada una se diseña por separado. Cada diseño se\ncarga cada que alguien visita la página y el que se le presenta al usuario\ndepende del dispositivo. En vez de una misma pelota que crece y encoge, tienes\nvarias pelotas para cada aro. La ventaja es que es más fácil de implementar pero\nes menos flexible.</p>\n<p>Las dos metodologías se complementan entonces no hay una forma correcta o\nincorrecta de manejarlo. Que el contenido lo defina.</p>\n<p><img src=\"https://lh6.googleusercontent.com/BD1wuEk30KhzKp_vh5Cpl9IjEO1KbPT50yaGuv2Eutw_DLxZBHia_necnWSyGm1LJL_Fpl-IPGImb2_3jwSUJ8Od5DaxUIkMHPyCy5gIKiBbIytHdGTa-qyIIK95RLqSW92wR4iS\" alt=\"Ejemplo\"></p>\n<h3 id=\"desplazamiento\">Desplazamiento</h3>\n<p>Cuando una pantalla se va haciendo más chica, el contenido empieza a ocupar más\nespacio vertical. Todo el contenido que esté abajo se desplaza hacia abajo.</p>\n<p><img src=\"https://lh5.googleusercontent.com/PgtX3IMH1WAMXL1hK9NtivItdfmhYw51b2zqy-HLFwaU-Strmuc_SLPvF9TJijBhYN76nWk_uRCCa2QZ0-C8XPag-vZt7rbrW8cGko-jTrzFKLAir03xHgh_9TZIrv-3_yEVIVPV\" alt=\"Ejemplo\"></p>\n<h3 id=\"unidades-relativas\">Unidades relativas</h3>\n<p>Las pantallas varían muchísimo de tamaño como también la densidad de pixeles de\ncada pantalla. Por eso hacen falta unidades que sean flexibles y siempre\nfuncionen. Por eso usamos unidades relativas como porcentajes. Diseñar algo que\nocupe el 50% de la pantalla quiere decir que siempre ocupará el 50% sin importar\nel tamaño de la pantalla.</p>\n<p><img src=\"https://lh3.googleusercontent.com/mccBdn2xrDTktj0cGYcX1yaEurNUTTuf3yB_OL5us1-m1Wr8qV-RW-ZUXnjDI4T7oUJJ-0bBdQG4al_m8HkWA9EPlVLsE0yK4jcDo8KCrh1o_CLlAzqI9TOiUXmyv6RZJ6uaW6jf\" alt=\"Ejemplo\"></p>\n<h3 id=\"los-breakpoints\">Los breakpoints</h3>\n<p>Breakpoints te permiten cambiar el layout en puntos predefinidos. Por ejemplo,\ntener 12 columnas en una pantalla de 1440px pero sólo 4 columnas para móvil. Los\nbreakpoints te permiten combinar diseño responsivo con diseño adaptable para\nlograr experiencias óptimas en cada tamaño de dispositivo.</p>\n<p><img src=\"https://lh4.googleusercontent.com/smxQoqYXtj4XcY2lZ2VHQTyIC0I0AK7TopO2CLhcAgkE6kY8VueoBPbujvVIY6u26aAKDaqWf39onrxezB59xZ4z1rjhjsevtKVEnWHmKB9FeupxwBavLGdbctE0KXSZY1ONcfMp\" alt=\"Ejemplo\"></p>\n<h3 id=\"valores-max-y-min\">Valores max y min</h3>\n<p>A veces queremos que el contenido ocupe todo el ancho de una pantalla, en un\nmóvil por ejemplo, pero que el mismo contenido ocupe todo el ancho de una\npantalla como tu tele igual y no tiene sentido. Por esto tenemos valores\nmax/min. Por ejemplo, fijar un ancho de 100% y y ancho max de 1,000px significa\nque el contenido va a ocupar toda la pantalla pero nunca será de más de 1,000\npíxeles.</p>\n<p><img src=\"https://lh5.googleusercontent.com/XvmTHgRkwM-YHZDri1dQlDFcI6jVsJ1k3Zuw57qyYqpl27w0fpxWBh4QsZsCnQ3E_W0t_1Nol1WSkrykvmovrUazl_X06xEwcQAkE-8OoHbnW7xLtQFkQBW_m-cttPo3yu1erCjn\" alt=\"Ejemplo\"></p>\n<h3 id=\"objetos-anidados\">Objetos anidados</h3>\n<p>Se acuerdan de posición relativa? Muchos elementos que dependen de otros sería\ndifícil de controlar entonces meterlos en un contenedor ayuda a mantener\nclaridad y organización. Aquí ayudan las unidades estáticas como los píxeles.\nSon útiles para objetos anidados que no quieres que escalar, como logos y\nbotones.</p>\n<p><img src=\"https://lh4.googleusercontent.com/73sKFCPcNvwPau5cwb7EeggPD-_jhFWD-qPcmaX6rXYIGBHionKEzYM-4lSQzDzLbZWgGuWlSSXiTPjs-bRw2pe_-5AoPrjMTnPrgt8fjOm7-I65nN70yF1dcODDP_s85UxDS4z_\" alt=\"Ejemplo\"></p>\n<h3 id=\"tipografías-web-vs-tipografías-del-sistema\">Tipografías web vs. tipografías del sistema</h3>\n<p>Quieres usar una tipografía interesante como Futura o Didot? Usa tipografías\nweb! Aunque se van a ver increíbles, acuérdate que cada una se tiene que cargar\ny entre más uses, más tardará la página en cargar. Tipografías del sistema, en\ncambio, son rapidísimas de cargar excepto cuando el usuario no la tiene y\nentonces se presentará alguna otra tipografía default.</p>\n<p><img src=\"https://lh6.googleusercontent.com/WClWPvX71XDbEr5ic7fqjBMaqxYXp3_GZr7VX3W32IhQSij4mkndghwPuq2pIDdBw1zH-hFgsRIVfSE4-mzVdCS80bpI2JPqwYx0m57EwdtLuauBfYt4sSi1khwjFDGbKJcn7nVu\" alt=\"Ejemplo\"></p>\n<h2 id=\"recursos-extra\">Recursos Extra</h2>\n<ul>\n<li>Herramientas<ul>\n<li>Para ver cómo diseño responsivo afecta diferentes elementos:\n<a href=\"http://www.material-ui.com/#/components/app-bar\" target=\"_blank\">Component Library</a></li>\n</ul>\n</li>\n<li>Lectura<ul>\n<li><a href=\"https://designschool.canva.com/blog/visual-hierarchy/\" target=\"_blank\">The Design School Guide To Visual Hierarchy</a></li>\n<li><a href=\"https://learn.canva.com/learn/grid-design/\" target=\"_blank\">15 Reasons Why Using a Grid-Based Approach Will Improve Your Designs</a></li>\n<li><a href=\"https://www.canva.com/learn/responsive-web-design/\" target=\"_blank\">Responsive web design: What the Internet looks like in 2016</a></li>\n<li><a href=\"http://bradfrost.com/blog/post/the-principles-of-adaptive-design/\" target=\"_blank\">The principles of adaptive design</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"ejercicio\">Ejercicio</h2>\n<p>Evaluar tu página según los últimos conceptos que aprendimos — jerarquía,\nsimetría, espacios vacíos, líneas de dirección, etc. Puedes hacer cambios y\najustes como creas convenientes. Después, actualizar su archivo y alinear todo\nal grid tamaño 1440px (sus composiciones igual pueden variar pero cada elemento\ndebe de ir alineado al grid). Una vez diseñada la página para computadora,\ndiseñar la versión tablet y la versión móvil en base al grid ya definido en el\narchivo.</p>\n<p>Después presentar diseños finales resumiendo la meta de la página, el público\ndefinido. Hablar de elecciones de colores y composición y justificar esas\ndecisiones en base a la meta y el público. Abajo hay una serie de preguntas que\npueden ayudar a evaluar un diseño bien logrado.</p>\n<ol>\n<li>¿Tiene un punto de enfoque?</li>\n<li>¿Tiene buen flow visual?</li>\n<li>¿El diseño se siente equilibrado?</li>\n<li>¿El mensaje y el tono van de la mano?</li>\n<li>¿Tiene contraste suficiente?</li>\n<li>¿Aprovecha bien el espacio?</li>\n<li>¿La paleta de colores es harmoniosa? ¿Va con el tono definido?</li>\n<li>¿Sigue las bases que definiste al principio?</li>\n</ol>\n",
          "order": 5,
          "durationString": "1.5h"
        }
      },
      "order": 1,
      "stats": {
        "duration": 340,
        "durationString": "5.7h",
        "exerciseCount": 0,
        "partCount": 6
      }
    },
    "02-design-of-everyday-things": {
      "title": "El diseño de las cosas cotidianas",
      "bonus": false,
      "description": "<p>Conoce los principios de diseño qué debes tener en cuenta en todo producto ya\nsea físico o digital.</p>\n",
      "parts": {
        "00-design-principles": {
          "title": "Clase de Conceptos",
          "type": "read",
          "format": "self-paced",
          "duration": 120,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/tZkP9evOAtI",
              "id": "tZkP9evOAtI"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/tmw1T-xqw5U",
              "id": "tmw1T-xqw5U"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/a6F0EYCUjcE",
              "id": "a6F0EYCUjcE"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/iDrlD0kGaQo",
              "id": "iDrlD0kGaQo"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/ZQ-jirlAoD4",
              "id": "ZQ-jirlAoD4"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/gCj1YwBYfQw",
              "id": "gCj1YwBYfQw"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/aYOXN0i9i24",
              "id": "aYOXN0i9i24"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/pAOyWFOFhsg",
              "id": "pAOyWFOFhsg"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/313T70aeixc",
              "id": "313T70aeixc"
            }
          ],
          "body": "<h2 id=\"agenda\">Agenda</h2>\n<ul>\n<li>En squads parejas vean estos videos y lleguen a un entendimiento común</li>\n<li>Hagan resúmenes y ejemplos de lo que van viendo para que lo puedan presentar\ncon el resto de la clase</li>\n<li>Listen las dudas que les quedan para poder resolverlas al final de la sesión</li>\n</ul>\n<h2 id=\"los-principios-de-diseño\">Los principios de diseño</h2>\n<p>En su libro y curso <a href=\"https://www.udacity.com/course/intro-to-the-design-of-everyday-things--design101\" target=\"_blank\">The Design of Everyday Things</a>\n, Don Norman nos habla de distintos principios de diseño que revisaremos en esta\nlección.</p>\n<p>Para empezar miremos estos videos:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/tZkP9evOAtI?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div>\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/tmw1T-xqw5U?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div>.</p>\n<h3 id=\"affordances--signifiers\">Affordances &amp; signifiers</h3>\n<h4 id=\"affordances\">Affordances</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/a6F0EYCUjcE?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<blockquote>\n<p>Affordances (acciones posibles) son las relaciones que existen entre un objeto\ny una entidad (una persona). Los affordances permiten las interacciones entre\nestos objetos y las personas. La presencia de un affordance está determinada\npor las propiedades de un objeto y las habilidades de la persona que está\ninteractuando con la persona.</p>\n</blockquote>\n<p>Ejemplo:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/iDrlD0kGaQo?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<ul>\n<li>¿Qué es un affordance y cuál es su relación con un producto digital?</li>\n<li>Si te mostramos esta foto, qué crees que puede estar pasando:</li>\n</ul>\n<p><img src=\"https://lh5.googleusercontent.com/zYKvjSGgc6rwLt3Y24VPOlDmyb4C1sTmn2xfboy73HFjbP6FV7t-4xchymGuboRf8qAiOGh0ah_yw4TGsj7YAGjQrWbB_IUe5G6H6cQ1YgwrdN9RmmpiATzCNoYg8CKMD1z8_5jSKRo\" alt=\"itau ingresar\"></p>\n<h4 id=\"signifiers\">Signifiers</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/ZQ-jirlAoD4?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<blockquote>\n<p>Signifiers son señales que te indican las posibles acciones que puedes hacer\ncon un objeto y donde o en qué parte. Los signifiers, normalmente, son visibles.</p>\n</blockquote>\n<p>Ejemplo:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/gCj1YwBYfQw?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div>\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/aYOXN0i9i24?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h3 id=\"conceptual-models--system-image\">Conceptual models &amp; System image</h3>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/pAOyWFOFhsg?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<blockquote>\n<p>Los modelos conceptuales son explicaciones de cómo algo debe funcionar. Son\nútiles para que el usuario pueda predecir cómo es que un objeto funcionará y qué\nse puede hacer en caso algo salga mal.\nLas personas forman modelos conceptuales todo el tiempo. Una vez que\ninteractúas con un objeto, formas un modelo conceptual de cómo funciona. Es\nresponsabilidad del diseñador ayudar al usuario a formar un modelo útil. Los\nmejores modelos conceptuales a menudo se pueden deducir de un objeto en sí\nmismo.\nLos diseñadores tienen un modelo conceptual claro al diseñar el producto, pero\nlos usuarios no pueden hablar con el diseñador para comprender su modelo de\ndiseño, por lo que confían en la imagen del sistema del producto para formar\nun modelo de usuario. Una imagen del sistema es cualquier información que\ntransmita el producto. Información como su forma, forma, significantes,\naccesos y documentación en los manuales.\nPara que las personas utilicen un producto con éxito, deben tener el mismo\nmodelo mental (el modelo del usuario) que el del diseñador (el modelo del\ndiseñador). Pero el diseñador solo habla con el usuario a través del producto\nmismo, por lo que toda la comunicación debe tener lugar a través de la \"imagen\ndel sistema\": la información transmitida por el producto en sí.</p>\n</blockquote>\n<h3 id=\"discoverability--feedback\">Discoverability &amp; feedback</h3>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/313T70aeixc?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<blockquote>\n<p>Golfo de ejecución: el estado mental donde los usuarios descubren cómo\nejecutar. Este lleva al concepto de descubribilidad (discoverability) ¿Cómo sé\nlo que puedo hacer? ¿Qué acciones son posibles? ¿Cuáles son mis alternativas?\n¿Qué puedo hacer ahora? ¿Cómo lo hago?\nGolfo de evaluación: el estado mental donde los usuarios averiguan la\nrespuesta a una acción tomada. Lleva al concepto de retroalimentación(feedback\n) ¿Cómo sé lo que pasó? ¿Que pasó? ¿Funcionó? Qué significa eso? ¿Esta bien?\n¿He logrado mi objetivo?</p>\n</blockquote>\n<h2 id=\"ejercicio\">Ejercicio</h2>\n<ul>\n<li>Revisa esta <a href=\"http://www.pacifico.com.pe/\" target=\"_blank\">web</a> e identifica cuáles son los\naffordances y signifiers. Además, análizala en términos de discoverability y\nfeedback.</li>\n<li>Analiza <a href=\"https://www.hipmunk.com/\" target=\"_blank\">la web de hipmunk</a> en términos de modelos\nconceptuales e imagen del sistema.</li>\n<li>Analiza la web de <a href=\"https://www.virginamerica.com/book\" target=\"_blank\">Virgin América</a>\nbasándote en los 6 principios de diseño.</li>\n</ul>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://www.interaction-design.org/literature/topics/affordances\" target=\"_blank\">Affordances - IDF</a></li>\n<li><a href=\"http://udacity.com/courses/design101\" target=\"_blank\">The design of everyday things - Udacity</a></li>\n<li><a href=\"https://www.amazon.com/Design-Everyday-Things-Revised-Expanded/dp/0465050654/ref=sr_1_1?ie=UTF8&amp;qid=1518564635&amp;sr=8-1&amp;keywords=design+of+everyday+things\" target=\"_blank\">The design of everyday things - libro</a></li>\n<li><a href=\"https://gist.github.com/dideler/8018644\" target=\"_blank\">Notes</a></li>\n</ul>\n",
          "order": 0,
          "durationString": "2h"
        }
      },
      "order": 2,
      "stats": {
        "duration": 120,
        "durationString": "2h",
        "exerciseCount": 0,
        "partCount": 1
      }
    },
    "03-usability-and-accessibility": {
      "title": "Usabilidad y accesibilidad",
      "bonus": false,
      "description": "<p>Aprende sobre heurísticas de usabilidad y los principios básicos para crear un\nproducto accesible para todos.</p>\n",
      "parts": {
        "00-usability": {
          "title": "Usabilidad",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"usabilidad-en-productos-digitales\">Usabilidad en productos digitales</h2>\n<h3 id=\"10-heurísticas-de-usabilidad-de-jakob-nielsen\">10 Heurísticas de Usabilidad de Jakob Nielsen</h3>\n<p>Adicionalmente, para poder crear productos más usables tenemos que tener en\ncuenta las 10 heurísticas de usabilidad que propuso Jakob Nielsen en 1995.</p>\n<h4 id=\"01---visibilidad-del-estado-del-sistema\">01 - Visibilidad del estado del sistema</h4>\n<p>Debe quedar siempre claro para el usuario qué esta pasando con el sistema. Por\nejemplo, si alguna información está cargando como en este ejemplo de Linkedin.</p>\n<p><img src=\"https://lh3.googleusercontent.com/BTkm0J0DVpuIKXBGwPx8E9Y8ydGy7C5ty5CsA4sMIjMScFV14ccqXkrdcRaQ5MpxynA7ZBHVQjz50Uc1Nokz9ngWqj7rxiEiXGxZxBT8est503TN_h_EYiSRz519Oxjg68OBdcmmaeA\" alt=\"01-visibilidad\"></p>\n<p>O si un archivo está cargando como en este ejemplo de Google Drive</p>\n<p><img src=\"https://lh5.googleusercontent.com/n4ejtZQhW2FqQjNZgfP6jcJcL91lNruGU6lKAXEUZ1sCEuIdnjcmKFeVCnhzhgiy8CCFkIYDEEkHMaXtbPWzZzyq_QzM4-42j5l9kXTbHUFMn2t07w_LSss8qoxasPJiXMvu44qM7bQ\" alt=\"01-visibilidad\"></p>\n<p>¿A qué principio de diseño te hace recordar?</p>\n<h4 id=\"02---match-entre-el-sistema-y-el-mundo-real\">02 - Match entre el sistema y el mundo real</h4>\n<p>Deben relacionarse los términos usados por los usuarios en su vida cotidiana con\nlos términos que usamos en el sistema.</p>\n<p>En este ejemplo, vemos que el término en el sistema es <code>autos</code> (seguro de\nautos), sin embargo, si un usuario ingresa el término <code>carro</code> (término común en\nPerú y México), el sistema relacionará ambos términos.</p>\n<p><img src=\"https://lh6.googleusercontent.com/czcFaaYJxqZyFXVjOSNVVmOUzS34Ve0TrJJWW41Bm0RUwOUyXBE68WsI-kHFodmAUKT6FA-C5i9kDmQMB9ljhsxG7wAds7DZkoX-rDduobRZom331gzZcgQRFdk7nwFzayJMUodkbJ0\" alt=\"02-Match\"></p>\n<h4 id=\"03---control-y-libertad-al-usuario\">03 - Control y libertad al usuario</h4>\n<p>Este prinicipio se refiere a darle al usuario control sobre las acciones que\nrealiza dentro del producto. Incluso darle la libertad de deshacer algo que\nhizo.</p>\n<p>En este ejemplo de Gmail, la plataforma da la opción al usuario de deshacer el\nenvío de un correo electrónico.</p>\n<p><img src=\"https://lh4.googleusercontent.com/HqXm5aFz3Bla9BD2kKI-76iKCDN8h15V51KPTMKPQiLhVrNjmFEu6bQ8-y6QtuNtmShrvYmIDaH8fS5io7pNXI0cxieWv-NhoxkN536zOQeIc9TFdL3aXfgKPStCFWCN-hy1pL3KMjM\" alt=\"03-control-al-usuario\"></p>\n<h4 id=\"04---consistencia-y-estándares\">04 - Consistencia y estándares</h4>\n<p>La idea es mantener nuestras interfaces consistentes. Si el botón <code>continuar</code> es\nverde con letras negras deberían mantenerse las mismas características siempre\nque incluyamos un botón con la misma acción dentro de nuestro producto. Cuando\nhablamos de consistencia hablamos de colores, jerarquías, fuentes, interacciones\ny hasta del mismo contenido.</p>\n<p>En este ejemplo, cuando le das tap al ícono del teléfono, en una pantalla va\ndirecto a hacer la llamada, mientras que en otra te muestra primero los números\ndel contacto para que elijas a cuál marcar. Son dos acciones distintas para un\nmismo ícono que confunden al usuario.</p>\n<p><img src=\"https://lh4.googleusercontent.com/X-aOlTlpVJkCUju0PO-aqgp4xNjPis9yQczL3k0GvMiVjTiBMZz9Mhyux0dO4WALg5MdA5yHMbzhXBlUQga21hChdGqkr18k46RmmxFNqIOdi42Z1hNxzDuEeLPnueMsQg1PzqkKZ00\" alt=\"04-consistencia-y-estándares\"></p>\n<h4 id=\"05---prevención-de-errores\">05 - Prevención de errores</h4>\n<p>El sistema debe prevenir que el usuario cometa errores.</p>\n<p>En este ejemplo de Gmail, el usuario escribe <code>adjuntar</code> pero se olvida de añadir\nel archivo y el sistema se lo hace saber.</p>\n<p><img src=\"https://lh6.googleusercontent.com/B6w9E-FYOgZn5mHiup6-6D2xdJhffQKEAscutPJhHPvDZ450D4h6cCP24MAvAYgiyhBFuvcdWx62UaAYmClJ7S-TnVRYhcqf8kl2g3hwtQRoIbA8bGC5hFDvi1VnXQXCf2AOAZnEuL0\" alt=\"05-prevencion-de-errores\"></p>\n<h4 id=\"06---reconocimiento-en-lugar-de-recordación\">06 - Reconocimiento en lugar de recordación</h4>\n<p>Es siempre más fácil para un usuario reconocer elementos/cosas/acciones en lugar\nde tener que recordarlas por sí mismo.</p>\n<p>En este ejemplo, en lugar de preguntarle al usuario qué cosas te interesan\n(corriendo el riesgo de que se olvide de muchas), el sistema le muestra algunas\nalternativas para que reconozca que cosas son las que le interesan.</p>\n<p><img src=\"https://lh4.googleusercontent.com/--a2sP4O1QEjIVkxdvnRxbX0ftgx9e6JkjKeNKkEknofJ2zNSO1TW_N-kUwpZJ8ZwW-_Fauqk8b-uvNuJCBwDeGr5kpS0lBVKAELNGruB9_8ZW9P8hT2KNwvcUdZFRAA7ZFVYpAsjH0\" alt=\"06-reconocimiento-vs-recordación\"></p>\n<h4 id=\"07---flexibilidad-y-eficiencia-en-el-uso\">07 - Flexibilidad y eficiencia en el uso</h4>\n<p>El sistema debe permitir que todo tipo de usuarios puedan usar el producto según\nsu nivel de experiencia.</p>\n<p>En este ejemplo de Outlook se muestran las opciones básicas para los usuarios\nnormales, pero hay una opción <code>avanzada</code> para usuarios con otras necesidades y\nexpertise.</p>\n<p><img src=\"https://lh6.googleusercontent.com/Gy4ChOAjWn9-ipX-25jkNUDAzFuuc7siEshF1XSNJchd3J5W3G491X264mLp-_O1AO9F2weg8KJdRWh-8SFPnc7xbcCLU4asf4nzjlrPJCkKLSeZ53KpM4YMiEl1hVMHE0dmgRfoz5s\" alt=\"07-flexibilidad\"></p>\n<h4 id=\"08---diseño-estético-y-minimalista\">08 - Diseño estético y minimalista</h4>\n<p>El espacio en las pantallas es poco así que tenemos que utilizarlo de la mejor\nmanera. En lugar de llenar la pantalla con cosas, es mejor priorizar y mostrar\nlo más importante.</p>\n<p>En este ejemplo del Apple Watch, hay poco texto y una foto grande, facilitando\nla lectura y sumergiendo al usuario en el contexto.</p>\n<p><img src=\"https://lh6.googleusercontent.com/jMBm835ZAk3hTN9qvs5bAu0pRcU5s2xQ3DfW8uWLrpSeqYXglhLWbar7kkn19mDiQfHfcByiN6I7HgiM8X3j3ehz1INNhFtalAUbm5yUVa_Y7XNZJITrYRQlumC-Oc61z-JuicxCJyU\" alt=\"08-diseno-estético\"></p>\n<h4 id=\"09---ayuda-a-los-usuarios-a-reconocer-y-recuperarse-de-los-errores\">09 - Ayuda a los usuarios a reconocer y recuperarse de los errores</h4>\n<p>Hay veces que es inevitable que los usuarios cometan errores en nuestros\nsistemas. Si los comenten, debemos ofrecerles maneras rápidas y amigables de\nrecuperarse de esos errores.</p>\n<p>En este ejemplo, Mailchimp le avisa a un usuario que el <code>username</code> que había\nseleccionado ya está tomado por otro usuario.</p>\n<p><img src=\"https://lh4.googleusercontent.com/BAfIGumWXDhnkfKlMsXFhiaCyTkJh4hDCB5FR3NqT6-fVcna8sXrCJPijJ-VX3nez2ZnJiVYyAFcuLwG4tIh8b_XOXPXHnSsbwBRoQtBexBtOwplKJW_Jr8205pfgfPTQZbhOhxqkxY\" alt=\"09-ayuda-a-los-usuarios\"></p>\n<h4 id=\"10---ayuda-y-documentación\">10 - Ayuda y documentación</h4>\n<p>Cuando tenemos sistemas muy complejos o novedosos es, a veces, necesario tener\ndocumentación adicional para el usuario para que pueda utilizar el sistema.</p>\n<p>En este ejemplo, GoDaddy nos muestra todas las opciones que tiene disponible\npara sus usuarios.</p>\n<p><img src=\"https://lh4.googleusercontent.com/V70mjXoCv4puywzb21JooEXciDoyenfVRiQbgF7_Gg_ANWDThfHuVoMIzAp1xdEDSgHI7CGd079e5tOABy0e5s-1vturcSFD5rp6SR4L2RpwozCsVklaZC1HhiHsvkyIGfLKbToO5mI\" alt=\"10-ayuda-documentacion\"></p>\n<hr>\n<h2 id=\"ejercicio\">Ejercicio</h2>\n<ul>\n<li>Intenta encontrar 2 nuevos ejemplos para cada uno de los principios de\nusabilidad propuestos por Nielsen.</li>\n</ul>\n<hr>\n<h3 id=\"no-me-hagas-pensar\">No me hagas pensar</h3>\n<ul>\n<li>Lee los primeros 4 capítulos del libro <em>\"No me hagas pensar\"</em> de Steve\nKrug.</li>\n</ul>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://www.nngroup.com/articles/ten-usability-heuristics/\" target=\"_blank\">10 Usability Heuristics for User Interface Design</a></li>\n<li><a href=\"https://blog.prototypr.io/10-usability-heuristics-with-examples-4a81ada920c\" target=\"_blank\">10 Usability Heuristics with examples</a></li>\n<li><a href=\"https://www.amazon.com/Dont-Make-Think-Revisited-Usability/dp/0321965515\" target=\"_blank\">No me hagas pensar</a></li>\n</ul>\n",
          "order": 0,
          "durationString": "1h"
        },
        "01-accessibility": {
          "title": "Accesilidad",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=BEFgnYktC7U",
              "id": "BEFgnYktC7U"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/_ey8cjuDZW8",
              "id": "_ey8cjuDZW8"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Mira este video y reflexiona sobre el concepto de accesibilidad <div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/BEFgnYktC7U?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Accesibilidad según la <a href=\"https://www.w3.org/WAI/intro/accessibility.php\" target=\"_blank\">W3org</a>:</p>\n<blockquote>\n<p>La accesibilidad web significa que los sitios web, las herramientas y las\ntecnologías están diseñados y desarrollados para que las personas con\ncapacidades diferentes puedan usarlos. Más específicamente, las personas\npueden:</p>\n</blockquote>\n<ul>\n<li>percibir, comprender, navegar e interactuar con la Web</li>\n<li>contribuir a la web</li>\n</ul>\n<p>La accesibilidad incluye todas las capacidades diferentes que están relacionadas\ncon la interacción con productos digitales y la web:</p>\n<ul>\n<li>Visual: ceguera total o parcial, baja visión o daltonismo.</li>\n<li>Auditiva: sordera parcial, total y otras dificultades para escuchar.</li>\n<li>Motriz: dificultad para usar el mouse, respuesta lenta, control limitado de la\nmovilidad</li>\n<li>Cognitiva: dificultades para aprender,deficiencias de atención, dificultad\npara recordar cosas o enfocarse cuando se está frente a grandes cantidades de\ninformación.</li>\n</ul>\n<p>Ahora, mira este:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/_ey8cjuDZW8?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Y revisemos algunas consideraciones sobre accesibilidad.</p>\n<h3 id=\"tips-para-diseñadores\">Tips para diseñadores</h3>\n<h4 id=\"no-uses-el-color-como-única-manera-de-dar-información-al-usuario\">No uses el color como única manera de dar información al usuario</h4>\n<p>Recuerda que hay usuarios que no distinguen todos los colores. (En este\n<a href=\"https://www.smashingmagazine.com/2014/10/color-contrast-tips-and-tools-for-accessibility/\" target=\"_blank\">artículo</a>\npuedes ver los distintos problemas de visión que existen.) Un buen ejemplo es no\nusar solo el color rojo para dar a entender que hay un error. Siempre es bueno\nexplicarle al usuario cuál fue el error con un mensaje explícito.</p>\n<h4 id=\"utiliza-colores-que-tenga-el-suficiente-contraste\">Utiliza colores que tenga el suficiente contraste</h4>\n<p>Recuerda los conceptos de Visual Design. Siempre revisa el contraste de color\nentre el texto y el fondo. Utiliza esta <a href=\"https://webaim.org/resources/contrastchecker/\" target=\"_blank\">herramienta</a>\npara asegurarte que el contraste cumpla los estándares mínimos.</p>\n<h4 id=\"cuando-subas-un-video-a-la-web-agrégale-subtítulos-y-ofrece-las-transcripciones\">Cuando subas un video a la web agrégale subtítulos y ofrece las transcripciones</h4>\n<p>Los subtítulos y/o transcripciones ayudan a las personas que tienen dificultades\nde audición o cuando no puedes ejecutar un video en un lugar muy silencioso.\nIntenta agregar subtítulo y/o transcripciones cuando tengas videos o audios.</p>\n<h4 id=\"siempre-usa-labels-o-un-sustituto-equivalente-en-los-formularios\">Siempre usa labels (o un sustituto equivalente) en los formularios</h4>\n<p>Los labels nos ayudan a enfocarnos en los campos que vamos a llenar del\nformulario. Cuando usamos solo placeholders corremos el riesgo de confundir al\nusuario y de hacer su experiencia menos fluida. Puedes leer estos artículos:\n<a href=\"https://www.nngroup.com/articles/form-design-placeholders/\" target=\"_blank\">Inglés</a>/<a href=\"https://translate.google.com/translate?sl=pt&amp;tl=es&amp;js=y&amp;prev=_t&amp;hl=en&amp;ie=UTF-8&amp;u=https%3A%2F%2Fwww.nngroup.com%2Farticles%2Fform-design-placeholders%2F&amp;edit-text=\" target=\"_blank\">Español</a>\npara entender un poco más sobre esto.</p>\n<h4 id=\"utiliza-alt-en-todas-las-imágenes-que-subas\">Utiliza alt=”” en todas las imágenes que subas</h4>\n<p>Los textos <code>alt</code> en las imágenes ayudan a los screen-readers a decirles a los\nusuarios qué hay en una imagen. Si bien es una tarea que puedas ver relacionada\ncon un programador. Es importante darle las herramientas e instrucciones\nnecesarias a los stakeholders para que incluyan los <code>alt</code> en las imágenes de sus\nposts. Por ejemplo, si en la empresa en que trabajes utilizan un CMS deberías\nasegurarte de que hay la opción de agregar <code>alt</code> cuando los editores estén\ningresando/editando contenido. También, cuando hagas un prototipo y se lo pases\na un developer, podrías darle en un archivo aparte los <code>alt</code> texts que deberá\nutilizar para cada imagen. Adicionalmente, los <code>alt</code> texts te ayudan para el\n<a href=\"https://es.wikipedia.org/wiki/Posicionamiento_en_buscadores\" target=\"_blank\">SEO</a> también.</p>\n<h4 id=\"herramientas\">Herramientas</h4>\n<ul>\n<li><a href=\"https://www.deque.com/products/axe/\" target=\"_blank\">Axe</a></li>\n<li><a href=\"https://webaim.org/resources/contrastchecker/\" target=\"_blank\">Color contrast checker</a></li>\n<li><a href=\"http://www.getstark.co/\" target=\"_blank\">Stark para sketch</a></li>\n<li><a href=\"https://www.w3.org/TR/WCAG21/\" target=\"_blank\">Web accessibility guidelines</a></li>\n</ul>\n<h2 id=\"ejercicio\">Ejercicio</h2>\n<ul>\n<li>Encontrar problemas de accesibilidad en una web financiera, listarlos y\npresentarlos al salón.</li>\n</ul>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://medium.com/salesforce-ux/7-things-every-designer-needs-to-know-about-accessibility-64f105f0881b\" target=\"_blank\">7 Things Every Designer Needs to Know about Accessibility</a></li>\n<li><a href=\"https://www.udemy.com/aprende-accesibilidad-web-paso-a-paso/learn/v4/overview\" target=\"_blank\">Aprende Accesibilidad Web paso a paso</a></li>\n<li><a href=\"https://medium.com/laboratoria-how-to/accesibilidad-en-la-web-o-algunos-tips-para-hacer-una-web-para-todos-3152616ac5fc\" target=\"_blank\">Accesibilidad en la Web o algunos tips para hacer una web para todos</a></li>\n</ul>\n",
          "order": 1,
          "durationString": "1h"
        }
      },
      "order": 3,
      "stats": {
        "duration": 120,
        "durationString": "2h",
        "exerciseCount": 0,
        "partCount": 2
      }
    }
  },
  "grades": "",
  "contributors": "",
  "books": "",
  "benchmarks": "",
  "references": "",
  "repo": "Laboratoria/bootcamp",
  "path": "topics/interaction-design",
  "version": "3.0.0",
  "parserVersion": "3.0.0",
  "track": "ux",
  "locale": "es-ES",
  "stats": {
    "duration": 670,
    "durationString": "11.2h",
    "exerciseCount": 0,
    "unitCount": 4,
    "partCount": 10
  }
}
