{
  "slug": "talent-fest",
  "createdAt": "2021-06-24T00:52:52.832Z",
  "title": "Talent Fest",
  "description": "<p>En este curso conocerás lo que es el Talent Fest. Podrás conocer qué te espera\nen este evento y qué cosas te recomendamos hacer durante él.</p>\n",
  "tags": {
    "secondary": {},
    "primary": {}
  },
  "targetAudience": "",
  "dependencies": "",
  "learningObjectives": "<ul>\n<li>Qué es el Talent Fest</li>\n<li>Los momentos claves de un Talent Fest</li>\n<li>Consejos para tener éxito en el Talent Fest</li>\n</ul>\n",
  "product": "",
  "syllabus": {
    "00-talent-fest": {
      "title": "Talent Fest",
      "bonus": false,
      "description": "<p>Esta unidad te ayudará a estar preparada para que puedas aprovechar al máximo\nel Talent Fest. En las siguientes secciones te contamos un poco más sobre el\nTalent Fest, con detalles de cada etapa, tips de cómo enfrentarlo y algunos\nejemplos de los retos en los que podrías trabajar.</p>\n",
      "parts": {
        "00-intro": {
          "title": "Talent Fest",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"qué-es-el-talent-fest\">Qué es el Talent Fest</h2>\n<p>Es el primer hito en el proceso de conectarte con empresas interesadas en\ncontratarte y, además, es el evento final de tu paso por el bootcamp de\nLaboratoria. Durante las 36 (o más) horas que dura este evento, trabajarás con\nun grupo de compañeras de Laboratoria en resolver un reto propuesto por una de\nlas empresas más importantes del país y así demostrar y probar tu talento.</p>\n<p>El formato de este evento es el de una hackathon. Una hackathon es una “maratón”\nde hackeo (<em>hack-athon</em>) en la que cada squad desarrolla un producto. Al decir\n“maratón” nos referimos a varias horas intensas de trabajo. Y, al decir\ndesarrollar un producto nos referimos a todo lo que esto puede involucrar,\ndesde el diseño de la experiencia y la GUI (graphical user interface), hasta la\nimplementación. Si bien en nuestro Talent Fest premiamos a algunos equipos, es\ndistinto a una hackathon normal porque la meta no es tener un equipo ganador,\nsino que tú (ustedes) puedas demostrar tu talento a las empresas durante el\ndesarrollo del reto, y que luego esto se pueda traducir en una oferta de\ntrabajo.</p>\n<p>Te asignaremos un reto y un equipo. Como el reto es propuesto por una empresa,\nesta empresa traerá a alguien, un product owner, para que trabaje con ustedes\ndurante estos dos días. En algunos casos el product owner las puede acompañar\npor casi toda la hackathon y en otros casos será más esporádico, estará para dar\ninstrucciones/feedback y resolver las consultas puntuales. Dependerá de las\ncaracterísticas del reto y de la empresa.</p>\n<p>Luego de la hackathon del Talent Fest, habrá un día designado exclusivamente\npara entrevistas. Este espacio es para que los encargados de las empresas\nparticipantes puedan conocerte mejor y evaluar si hay un match contigo para\nofrecerte un trabajo.</p>\n<p>Estas son algunas de las  las empresas que ya han participado en nuestros Talent\nFests. Este evento es una gran oportunidad para estar un paso más cerca de tener\nuna oportunidad de trabajo en ellas.</p>\n<p><img src=\"https://lh3.googleusercontent.com/52MVz5zlHLok68HaZl48pbwe1AzVzFmmHj24CIp280fnZ0DTZU0GKQEhguXugA9ym4DdspJQjqiNx23-u-kFd1918XP8aZ9ukvl9Va_bhTQGbN5tagr7vpehR-G1bMrR6intwp_V\" alt=\"empresas1\"></p>\n<p><img src=\"https://lh5.googleusercontent.com/UEh_tJf4Z4I87FSvhupQHyiXl_VQjxcoMIN0cXZ6yqhHjgdEMn5UXh2LbHdu41WjnHln0k_Q7EfMwtui7QE5uGaG_7xeYy-Ael62PHE-mh-2x_vIyiuDLfpkTwXUXJZDwZstAkkR\" alt=\"empresas2\"></p>\n<p>Si quieres saber un poco más sobre cómo les explicamos a las empresas lo que es\nel Talent Fest puedes leer el siguiente <a href=\"https://medium.com/laboratoria/el-talent-fest-de-laboratoria-la-mejor-forma-para-contratar-talento-femenino-en-la-regi%C3%B3n-60d959905af\" target=\"_blank\">artículo</a></p>\n<hr>\n<p>Sabemos que la experiencia será única y la recordarás para siempre, por eso\nqueremos ayudarte a estar preparada para que puedas aprovechar al máximo la\noportunidad. En las siguientes secciones te contamos un poco más sobre el TF,\ncon detalles de cada etapa, tips de cómo enfrentarlo y algunos ejemplos de los\nretos en los que podrías trabajar.</p>\n",
          "order": 0,
          "durationString": "30min"
        },
        "01-key-moments": {
          "title": "Etapas",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"etapas-del-talent-fest\">Etapas del Talent Fest</h2>\n<h3 id=\"kick-off\">Kick-off</h3>\n<p>El <em>kick-off</em> es la primera parte del Talent Fest. Dependiendo de la\norganización, el <em>kick-off</em> será la noche previa o en la mañana del mismo día\nque empieza el evento. Independientemente de cuándo suceda, la idea del\n<em>kick-off</em> es que conozcas a la empresa, el reto, y a las personas de la empresa\nque trabajarán contigo durante estos dos días.</p>\n<p>En la primera parte del <em>kick-off</em>, el equipo de Laboratoria facilitará una\ndinámica para que todos puedan conocerse mejor y así “romper el hielo”. Durante\nel Talent Fest, no solo tus compañeras serán parte de tu equipo, sino también\nlos miembros de la empresa, así que es bueno ir generando confianza desde un\ninicio.</p>\n<p><img src=\"https://lh5.googleusercontent.com/qVjMOTxNJgHyduTDBtKvAJUCRzSLE8OqOZ-r6pvr1GFXkLbmhI8_F6Mvk61H3XVckfsvYH0hv-tP_ycZU0IWb5jvvxUnfUtziqU8mvbscmeMyV1xOpA6jKJvP_Uo8odvD4qmAGPP\" alt=\"kick-off-talent-fest-laboratoria\"></p>\n<p>En la segunda parte del <em>kick-off</em>, el <em>product owner</em> te contará sobre el reto,\nel contexto en el que nace la necesidad en la empresa y cuáles son los desafíos\nque enfrentan. Este es el momento para hacer miles y millones de preguntas. Haz\ntodas las preguntas que necesites para entender mejor el reto, no asumas nada,\nno temas preguntar algo “obvio”, es mejor estar segura. Recuerda que cuanto\nmejor entiendas el reto y sus desafíos, mejor será tu solución.</p>\n<h3 id=\"planning-del-trabajo\">Planning del trabajo</h3>\n<p>Una vez que conozcas el reto, es hora de juntarte con tu equipo (recuerda que tu\nequipo incluye a la empresa) y planificar cómo trabajarán en él: qué actividades\nvan a realizar, cómo se van a dividir, que hitos van a cumplir, qué deadlines\ntienen, qué herramientas/tecnologías utilizarán, etc.</p>\n<p>Aquí es bueno ponerse algunas reglas de equipo: qué hacemos si nos trabamos, qué\nhacemos si nos falta algo, quién se encargará de medir los tiempos, cómo nos\norganizaremos para los breaks, de cuántas horas serán los sprints, etc. Es mejor\ntener estos puntos definidos desde el principio para que el resto del tiempo sea\nsolo de desarrollo del producto.</p>\n<p>Te recomendamos crear con tu equipo un tablero de kanban para organizar y darle\nseguimiento al trabajo. Planifica en períodos cortos de tiempo, por ejemplo por\nmini-sprints de 4 o 6 horas (no necesariamente los dos días de una sola vez).\nAsegúrate de acordar la definición de terminado de todo con tu <em>product owner</em>.\nPrioriza, prioriza y <strong>PRIORIZA</strong>. Huye del “mucho a medias” y persigue el “lo que\nda más valor terminado, completo, completísimo”.</p>\n<h3 id=\"trabajo-en-el-proyecto\">Trabajo en el proyecto</h3>\n<p>Esto será lo que harás durante la mayor parte del tiempo en la hackathon.\nDurante tu paso por Laboratoria aprendiste a resolver problemas, aprendiste a\nusar herramientas/tecnologías nuevas, y muchas cosas más… es tu momento de\nutilizar todo eso de la mejor manera. Piensa en la mejor estrategia y en qué\nherramientas son las ideales para resolver este reto y utilízalas. Comuníquense\nconstantemente entre ustedes para saber cómo van. Para el caso de las\nactividades de UX, ten en cuenta que incluso en un período de tiempo tan corto,\nigual debes entrevistar y testear con usuarios. Para ello puedes buscar usuarios\ncerca del lugar donde es el TF.</p>\n<p><img src=\"https://lh5.googleusercontent.com/nlr5TDG55_23BnY32zgz8rVjAQXl3Sw0RC5x46RhXjO0FPMQsm4BCNjrIj-p5CDQek_WfpkaG88FHgO5H1wt14IFSJIJnLpYQ095E0fmZqCsjyJMkOK-LRa1BcUaytG-u7zYAsgF\" alt=\"talent-fest-laboratoria-trabajo-equipo\"></p>\n<h3 id=\"demo-night\">Demo night</h3>\n<p>Aproximadamente a las 4 pm del segundo día deberías estar terminando con tu\nsolución y preparándote para la presentación final del producto.</p>\n<ul>\n<li>Recuerda que el demo es corto, así que tienes que prepararte y mostrar lo más\nimportante.</li>\n<li>Como las presentaciones son cortas, no se espera que todas presenten, por eso\nles sugerimos que elijan a 1 o 2 representantes para hacerlo.</li>\n<li>Pregúntate si te añade valor presentar una pantalla de login o un splash\nscreen. Intenta priorizar y muestra <strong>lo más importante de tu solución.</strong></li>\n<li>Usa un tiempo, para explicar los desafíos s o dificultades que tuvieron que\nsuperar para llegar a la solución.</li>\n<li>Prepárate para las preguntas que la audiencia te pueda hacer.</li>\n</ul>\n<p><img src=\"https://lh6.googleusercontent.com/vx4OIYLp0ZfMtUKasRujmimfHM44Ize8xR5sJ4u-2BSbTiCscq40ES-8l0cL61aQzpGWF39Z28AKJ-g0R8xuDa4GXCxJGOWeE-ccMKF_kZP2f4n0VOwZYtltDMCFzJ5oJhk82t7u\" alt=\"demo-night-talent-fest-laboratoria\"></p>\n<p>A las 6 pm, iniciaremos el demo night. Cada equipo contará con 3 minutos para\npresentar y luego un espacio de preguntas. La solución ganadora será elegida por\nel jurado. El jurado estará compuesto por algunos representantes de Laboratoria\ny por líderes de la industria.</p>\n<p>Al final de las presentaciones, el jurado elegirá al equipo ganador y al segundo\npuesto.</p>\n<p><img src=\"https://lh6.googleusercontent.com/TxuFaQGcyISiav0Hv5Qo6xFnrhQB2WbI6iyx0gU-EYOru_V7SmaycipZlYeUlnGDo_eryxlOUMj8TULbYFEHy8UQiWOv6earM3fjZ2ojqb7vy2RYkr1F9MYHk2GnX-Hym4bF8Lst\" alt=\"demos-finales-talent-fest-laboratoria\"></p>\n<h3 id=\"entrevistas\">Entrevistas</h3>\n<p>Como dijimos antes, esta etapa se da después de la hackathon y es un espacio\npara que las empresas puedan conocerte mejor.\nPara decidir a quiénes entrevistar, los miembros de las empresas toman en cuenta\nel perfil que aparece en el <a href=\"http://app.talento.laboratoria.la\" target=\"_blank\">app de talento</a>\ny lo que puedan haber observado de cada estudiante durante la hackathon.\nAsegúrate de subir todos tus datos requeridos hasta tener tu perfil completo en\nel app <strong>antes</strong> del Talent Fest y de demostrar de la mejor manera tu forma de\ntrabajar y tus habilidades durante todo el Talent Fest, no sólo a las personas\nde la empresa con quienes estarás trabajando, si no a todos los miembros de las\ndemás empresas.</p>\n<h3 id=\"logística\">Logística</h3>\n<p>Durante el Talent Fest nosotros nos encargamos de toda la logística. Te\nbrindaremos todo lo que necesites: post-its, marcadores/plumones, pizarras, etc.\nhabrá comida, bebidas, snacks y <strong>mucho</strong> café. Habrá un lugar para que puedan\ndescansar/dormir. Además, recuerda que si necesitas algo adicional, puedes\ncontactar a cualquiera del equipo de Laboratoria que esté alrededor. La idea es\nque te enfoques en crear una súper solución. Nosotros estamos para facilitar\ntodo lo demás.</p>\n",
          "order": 1,
          "durationString": "30min"
        },
        "02-challenges": {
          "title": "Los retos",
          "type": "read",
          "format": "self-paced",
          "duration": 10,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Los retos en un Talent Fest son muy variados, tanto en el enfoque (equipos solo\nFront-end o solo UX o equipos mixtos), como en el detalle (hay retos mucho más\ndetallados que otros). Los retos pueden venir en forma de un “cómo podríamos”\n(HMW) o en algunos casos con indicaciones y requerimientos súper detallados.</p>\n<p>Independientemente del reto que te toque, es muy importante que hagas muchas\npreguntas al <em>product owner</em> para entender mejor el reto.\nSi te toca un reto abierto, piensa bien en qué herramientas son las mejores para\nresolver el reto y con cuáles te sientes más cómoda. Intenta siempre optar por\nla solución más simple y directa (K.I.S.S.). Por ejemplo, si es un reto de\ncódigo y no te especifican qué tecnología usar, tú puedes decidir si usar\nvanilla JS, React o Vue o Angular y si quieres desplegar en Github o Heroku o\nFirebase. Igual en la parte de diseño, tú puedes decidir qué técnicas utilizar.\nEn el caso de UX, no olvides el probar tus soluciones con usuarios. Recuerda que\nUX sin U es X (o sea malo , error, etc).</p>\n<h3 id=\"entregables\">Entregables</h3>\n<p>Los entregables varían de reto en reto. Es por eso que es un punto que debes\ndejar en claro con tu <strong>product owner</strong> en las primeras horas del Talent Fest.\nEn algunos casos, el product owner dejará los entregables a criterio del equipo.\nSi este es el caso, piensa bien en qué entregables son los que generarían más\nvalor para el cliente y cuáles son los que, como equipo, son capaces de hacer en\nel tiempo que tienen. En cualquiera de los casos, asegúrate de acordar una\ndefinición de terminado para cada cosa.</p>\n",
          "order": 2,
          "durationString": "10min"
        },
        "03-recommendations": {
          "title": "Recomendaciones",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/iZcSIEBfgzs",
              "id": "iZcSIEBfgzs"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/TTWZ1SH7E3U",
              "id": "TTWZ1SH7E3U"
            },
            {
              "type": "video",
              "provider": "wistia",
              "href": "https://laboratoria-1.wistia.com/medias/lbwg1p7aej"
            }
          ],
          "body": "<h2 id=\"qué-te-recomendamos\">Qué te recomendamos</h2>\n<ul>\n<li><strong>Haz muchas preguntas</strong>, inicialmente sobre el reto en el que trabajarás y\nluego si alguna compañía te interesa mucho, hazles preguntas sobre la compañía.\nAquí algunas que te pueden servir tanto con la empresa que te de el reto como\ncon las otras que estén en el Talent Fest:<ul>\n<li>Cuáles son los principales retos que están enfrentando ahora. (Podrías\najustar también la pregunta y hacerla específica a diseño o a desarrollo).</li>\n<li>De qué tamaño es su equipo de desarrollo/diseño</li>\n<li>Cómo está conformado su equipo</li>\n<li>Cuál es su stack de tecnología</li>\n<li>Qué herramientas normalmente usan en la empresa</li>\n<li>Cómo es su metodología de trabajo</li>\n<li>Qué es lo que más les preocupa actualmente sobre la competencia</li>\n<li>etc.</li>\n</ul>\n</li>\n<li><strong>Piensa en MVP.</strong> No intentes tener todo de golpe, planeen y avancen de a\npocos. Para presentar es mejor presentar algo pequeño que funciona que algo\ngrande que no funciona.</li>\n<li>Si te toca trabajar en un reto mixto, <strong>no planifiques en cascada</strong>. No\nesperes que el equipo de diseño termine primero su trabajo para que luego siga\nel equipo de desarrollo. Planifica bien qué actividades pueden ir haciendo en\nparalelo para poder avanzar.</li>\n<li><strong>Practica tu presentación varias (más de 5) veces</strong> con tu equipo. Tómate un\ntiempo para eso una hora antes del inicio de las presentaciones. Esto implica\nprobar que tu demo se vea bien en el computador en el que se presentará.</li>\n<li><strong>No cambies nada a último minuto.</strong> Ese cambio de último minuto puede romper\ntodo lo que han hecho y puede ser fatal.</li>\n<li><strong>Haz commits constantes.</strong></li>\n<li>Despliega tu código (de ser el caso) a un servidor, <strong>NO SE PODRÁ PRESENTAR EN\nLOCALHOST.</strong></li>\n<li><strong>Pide ayuda.</strong> Si estás en duda pide ayuda, no tengas miedo de preguntar.\nCuando tengas una duda intenta primero resolverla con tu equipo y tu product\nowner antes que con un coach. Los product owners valoran mucho que tengas la\ncapacidad de preguntar y pedir ayuda. Esto implica también validar tus\nsuposiciones (sobre el producto o los usuarios) con tu product owner.</li>\n<li><strong>Pide ayuda con tiempo.</strong> No esperes al último minuto para preguntarle a tu\ncoach por algún error. A último minuto todos estamos yendo de un lugar a otro.\nAdemás, los errores se resuelven mejor con tiempo que con la intensidad del\núltimo minuto.</li>\n<li>Antes del Talent Fest, <strong>practica varias veces tu pitch personal.</strong></li>\n<li>El Talent Fest no es un evento en el cual las estudiantes compiten por\ndemostrar quiénes pueden trabajar más rato sin dormir o descansar. Así que\n<strong>tómate algunos momentos para descansar.</strong> Conversa con tu equipo para que se\npuedan turnar en ir a dormir a los espacios asignados.</li>\n<li><strong>No te olvides de tus grandes amigos Google y Stackoverflow.</strong></li>\n</ul>\n<h3 id=\"testimonios-de-egresadas\">Testimonios de egresadas</h3>\n<p>En los siguientes videos, algunas egresadas te comparten sus experiencias en el\nTalent Fest de Laboratoria y te dan algunas recomendaciones:</p>\n<ul>\n<li><p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/iZcSIEBfgzs?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n</li>\n<li><p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/TTWZ1SH7E3U?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n</li>\n<li><p><div class=\"iframe-container\"><iframe width=\"100%\" height=\"100%\" src=\"//fast.wistia.net/embed/iframe/undefined?videoFoam=true\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" oallowfullscreen=\"true\" msallowfullscreen=\"true\" allowtransparency=\"true\"></iframe></div></p>\n</li>\n</ul>\n",
          "order": 3,
          "durationString": "30min"
        },
        "04-examples": {
          "title": "Ejemplos de retos",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"retos-anteriores\">Retos anteriores</h2>\n<p>Aquí unos ejemplos de retos que nuestras egresadas han resuelto en Talent Fests\npasados en distintas sedes. Léelos y piensa en cómo los enfrentarías. En los\npróximos días te asignaremos un reto para que trabajes en él a manera de\npreparación para el TF.</p>\n<h3 id=\"canal-de-televisión\">Canal de televisión</h3>\n<p><em>“Se debe desarrollar una aplicación web que permita a los anunciantes y\nagencias de publicidad poder reservar anuncios (publicidad), y que permita\ncalcular y recalcular los montos de acuerdo a ciertos parámetros.”</em></p>\n<h3 id=\"empresa-de-telecomunicaciones\">Empresa de telecomunicaciones</h3>\n<p><em>“Se requiere un sistema que permita al usuario comparar y decidir sobre la\noferta de equipos (celulares) disponibles en el sitio web de la empresa.”</em></p>\n<h3 id=\"cruz-roja\">Cruz Roja</h3>\n<p>Haremos una intervención en el actual portal de la Cruz Roja, para ello deberán\ntrabajar en conjunto pero con entregables por separado.</p>\n<p>Equipo UX:</p>\n<p><em>Rediseño del portal pensando en usuario más que repositorio de información.</em></p>\n<ul>\n<li>Analizar portal actual de la Cruz Roja, utilizando Design Thinking, que esté\norientado al usuario.</li>\n<li>Realizar entrevistas de distintos tipos de usuarios sobre el portal actual.</li>\n<li>Testear funcionamiento del rediseño.</li>\n<li>Considerar en su rediseño el chatbot del equipo Front End.</li>\n</ul>\n<p>Equipo Front End:</p>\n<p><em>Chatbot de emergencia para la Cruz Roja.</em></p>\n<ul>\n<li>Crear un chatbot que resuelva la mayoría de las preguntas que surgen en\nemergencia</li>\n<li>Investigar la manera de instalar el chatbot en el portal actual y documentarla\ncorrectamente donde se refleje el diseño del proyecto, la codificación de este\ny las pruebas realizadas para su correcto funcionamiento.</li>\n<li>Recuerden que el principal objetivo de la documentación es facilitar el\ndesarrollo, corrección y futuro mantenimiento.</li>\n<li>Probar en el Talent Fest el chatbot en el portal actual en tiempo real.</li>\n</ul>\n<h3 id=\"catálogo-de-ventas-en-línea\">Catálogo de ventas en línea</h3>\n<p>Somos un catálogo online de todo lo que se vende en Redes Sociales. La necesidad\nde los consumidores nos llevó a la idea de reducir el tiempo de búsqueda y\nreunir en una sola plataforma toda la variedad de productos que se ofrecen en\nRR.SS.</p>\n<p>Reto: <em>rediseñar la experiencia de usuario de la plataforma.</em></p>\n<p>Objetivos específicos</p>\n<ol>\n<li>Aumentar el tiempo de estadía promedia en el sitio.</li>\n<li>Reducir tasa de rebote.</li>\n<li>Diseñar interfaces para nuevas funcionalidades.</li>\n<li>Mejorar posicionamiento SEO.</li>\n</ol>\n<h3 id=\"centro-comercial\">Centro comercial</h3>\n<p>La situación: la alta competencia en ciudad 1 y la próxima apertura de un\ncompetidor en ciudad 0  nos lleva a pensar en acciones de fidelización de\nclientes actuales. Además, de la necesidad de profundizar en el conocimiento que\ntenemos de nuestros clientes actuales para poder ofrecerles productos y servicios\nque se adecuen a sus necesidades.</p>\n<p>Reto: <em>Ofrecer un sistema de recompensas por visitas y/o compras.</em></p>\n<p>Te pedimos que:</p>\n<ul>\n<li>Identifiques cuál es la experiencia adecuada para ofrecer ese servicio.<ul>\n<li>Qué ofrecer como recompensas.</li>\n<li>La usabilidad.</li>\n<li>Las funciones del producto.</li>\n</ul>\n</li>\n<li>Nos ayudes a conocer mejor a nuestros clientes y saber qué esperan de nosotros\ny que gatilladores pueden reforzar la fidelidad.</li>\n<li>Basado en los aprendizajes, crear un prototipo de servicio y testearlo con\nalgunos usuarios.</li>\n</ul>\n",
          "order": 4,
          "durationString": "30min"
        }
      },
      "order": 0,
      "stats": {
        "duration": 130,
        "durationString": "2.2h",
        "exerciseCount": 0,
        "partCount": 5
      }
    }
  },
  "grades": "",
  "contributors": "",
  "books": "",
  "benchmarks": "",
  "references": "",
  "repo": "Laboratoria/bootcamp",
  "path": "topics/talent-fest",
  "version": "3.0.0",
  "parserVersion": "3.0.0",
  "track": "ux",
  "locale": "es-ES",
  "stats": {
    "duration": 130,
    "durationString": "2.2h",
    "exerciseCount": 0,
    "unitCount": 1,
    "partCount": 5
  }
}
