{
  "slug": "ux-research",
  "createdAt": "2021-10-07T19:47:50.368Z",
  "title": "UX Research",
  "description": "<p>En este curso concerás distintas herramientas que te ayudarán a entender mejor\na los usuarios y su interacción con los productos digitales. Además, aprenderás\na identificar mejor los problemas del negocio y la relación que tienen esos\nproblemas con los del usuario.</p>\n",
  "tags": {
    "secondary": {},
    "primary": {}
  },
  "targetAudience": "<p>Este curso está dirigido a personas que hayan llevado el curso de intro a UX\nDesign.</p>\n",
  "dependencies": "<p>Haber llevado el primer curso de intro a UX Design.</p>\n",
  "learningObjectives": "<ul>\n<li>Qué es <strong>User Research</strong> y por qué es importante</li>\n<li>La relación y diferencia entre research <strong>cualitativo</strong> y <strong>cuantitativo</strong></li>\n</ul>\n",
  "product": "<p>En este curso pondrás en práctica los conceptos aprendidos para crear\nexperiencias que tengan en cuenta al usuario desde su concepción.</p>\n",
  "syllabus": {
    "00-problem-understanding": {
      "title": "Entendimiento del problema",
      "bonus": false,
      "description": "<p>Antes de empezar a trabajar en research, tenemos que entender el problema en\nel que estamos trabajando y cuáles son los objetivos del negocio en este reto.</p>\n",
      "parts": {
        "00-problem-understanding": {
          "title": "Entendimiento del problema",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Al iniciar un proyecto para un cliente externo o interno, debemos entender bien\ncuáles son los objetivos del cliente, cuál es el estado actual del producto,\nqué problemas están habiendo (si es que hubiese algunos) y entender al actor\nprincipal: el usuario y saber quién es, qué problemas tiene, qué busca, etc.</p>\n<p>Un paso inicial para llegar a este entendimiento es la reunión de kick-off con\nel cliente.</p>\n<h2 id=\"reunión-de-kick-off\">Reunión de kick off</h2>\n<p>Nos ayuda a conocer más a detalle el producto y los alcances del trabajo que\nvamos a realizar. En esta reunión deberíamos resolver las siguientes preguntas:</p>\n<ul>\n<li>¿Cuál es el producto o feature? ¿De qué trata?</li>\n<li>¿Quiénes son o serán los usuarios?</li>\n<li>¿Qué es lo que más necesitan los usuarios?</li>\n<li>¿Quiénes son los sponsors o las personas encargadas de tomar decisiones para\nel largo plazo? (Agencia)</li>\n<li>¿Qué usuarios y/o clientes son los más importantes para el negocio?</li>\n<li>¿Quiénes son los principales competidores? ¿Inspiración?</li>\n<li>¿Qué documentos externos o internos deberíamos revisar para familiarizarnos\ncon el producto?</li>\n</ul>\n<h2 id=\"research-question\">Research Question</h2>\n<p>La idea es que, saliendo del kick-off de investigación, tengas más claridad\nacerca de los objetivos principales del estudio y de las preguntas que quieres\nhacer a tus usuarios.</p>\n<p>Algunas formas de enfocar las preguntas son:</p>\n<ul>\n<li><p>Lo que conocemos: ¿qué cosas ya sabemos sobre nuestros usuarios? ¿Hace falta\nconfirmar algunos de estos conocimientos?</p>\n</li>\n<li><p>Lo que desconocemos: ¿Qué cosas no sabemos? ¿En qué preguntas nos tenemos que\nconcentrar para poder obtener esa información?</p>\n</li>\n</ul>\n<p>Una vez que tengamos claro esto podremos plantear cómo será nuestra\ninvestigación.</p>\n",
          "order": 0,
          "durationString": "30min"
        },
        "01-analisis-competitivo-y-comparativo": {
          "title": "Análisis competitivo y comparativo",
          "type": "read",
          "format": "self-paced",
          "duration": 10,
          "embeds": [
            {
              "type": "video",
              "provider": "wistia",
              "href": "https://laboratoria-1.wistia.com/medias/mlv6jy6lm2"
            },
            {
              "type": "video",
              "provider": "wistia",
              "href": "https://laboratoria-1.wistia.com/medias/wq71jjy6kb"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Este análisis nos ayudará a saber cómo estamos en relación a la competencia y\nnos ayudará a entender mejor el contexto actual en el que trabaja / compite\nla empresa con la que estamos trabajando. Entender el contexto actual nos ayuda\na poder manejar las expectativas de nuestros usuarios y de nuestros clientes.</p>\n<h3 id=\"listado-de-competidores\">Listado de competidores</h3>\n<p><div class=\"iframe-container\"><iframe width=\"100%\" height=\"100%\" src=\"//fast.wistia.net/embed/iframe/undefined?videoFoam=true\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" oallowfullscreen=\"true\" msallowfullscreen=\"true\" allowtransparency=\"true\"></iframe></div></p>\n<h3 id=\"revisión-de-competidores\">Revisión de competidores</h3>\n<p><div class=\"iframe-container\"><iframe width=\"100%\" height=\"100%\" src=\"//fast.wistia.net/embed/iframe/undefined?videoFoam=true\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" oallowfullscreen=\"true\" msallowfullscreen=\"true\" allowtransparency=\"true\"></iframe></div></p>\n<p>Al final de este análisis podremos realizar una tabla como el ej, que nos ayude\na tener un mejor panorama.</p>\n<p><img src=\"https://lh6.googleusercontent.com/yrMUrO_YP0cqeqrAyNVZvU3ardIUVf6xgKuVQjLn0khOPTQL36U7RkbXw2MrViYL3YxDvx1uS95Yurbgor2t84ClTct9_LHWuV49K5pUWu48kNQLmyky-2YybJfU3bYzWhVGNIFrsSg\" alt=\"análisis competitivo\"></p>\n",
          "order": 1,
          "durationString": "10min"
        }
      },
      "order": 0,
      "stats": {
        "duration": 40,
        "durationString": "40min",
        "exerciseCount": 0,
        "partCount": 2
      }
    },
    "01-qualitative-research": {
      "title": "Entendimiento del Usuario: investigación cualitativa",
      "bonus": false,
      "description": "<p>En este curso concerás distintas herramientas que te ayudarán a entender mejor\na los usuarios y su interacción con los productos digitales. Además, aprenderás\na identificar mejor los problemas del negocio y la relación que tienen esos\nproblemas con los del usuario.</p>\n",
      "parts": {
        "00-interviews": {
          "title": "Entrevistas",
          "type": "read",
          "format": "self-paced",
          "duration": 120,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=1jULaA68HS0",
              "id": "1jULaA68HS0"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/WpzmOH0hrEM?t=45m00s",
              "id": "WpzmOH0hrEM"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Las entrevistas con usuarios son una herramienta muy importante para poder\nobtener más datos sobre cómo se sienten los usuarios con un producto o servicio.\nPara realizar una buena entrevista debemos hacer un buen planeamiento y seguir\nalgunos tips.</p>\n<h3 id=\"ser-curiosa\">Ser Curiosa</h3>\n<p><img src=\"https://www.jpl.nasa.gov/images/msl/20160613/pia20602-16.jpg\" alt=\"curiosity\"></p>\n<p>La foto de la presentación, es una foto del explorador \"Curiosity\" de Marte,\nque fue lanzado por la NASA en el 2011 con la meta de determinar si Marte algún\ndía sería capaz de sostener vida microscópica. La segunda meta del explorador\nera recolectar data sobre Marte y comprender cómo era el ambiente y ecosistema.\nDemoró más de una semana de investigación, desarrollo y prueba poder construir\nun explorador que trabajaría en otro planeta.</p>\n<p>Tal como los astrofísicos que diseñaron el explorador de Marte, como\ninvestigadores tenemos que poner a prueba nuestros diseños continuamente para\nasegurarnos de que podemos generar soluciones \"de otro mundo\" para nuestros\nclientes.</p>\n<p>Y como el nombre de esta nave, \"Curiosidad\", debemos tener curiosidad por\nrecolectar data y preguntar las preguntas correctas a nuestros usuarios para\nasegurar que estamos diseñando productos que cumplen con sus necesidades.</p>\n<p>Para este curso, hicimos una mini investigación preguntándole a personas que han\ntrabajado en investigación por décadas (gente que trabaja para Google Ventures,\nFacebook, WeWork e incluso bancos y corporaciones internacionales). Les\npreguntamos cuál era la característica más importante que tenía que tener\nalguien que sobresalía en el mundo de la investigación.</p>\n<p>La respuesta más común fue que los investigadores necesitan tener curiosidad.\nTienen que estar interesados en entender el motor que mueve a sus usuarios y a\nlos seres humanos en general.</p>\n<p>Deben cuestionar todo y preguntarse constantemente:</p>\n<ul>\n<li>¿Cómo realiza la gente ciertas tareas?</li>\n<li>¿Por qué hacen ciertas cosas?</li>\n<li>¿Cuándo hacen ciertas cosas?</li>\n<li>¿Qué factores los llevan a tomar decisiones?</li>\n<li>¿Qué es lo que las personas valoran?</li>\n</ul>\n<p>Nunca recibimos respuestas que dijeran que un investigador debe ser\n<code>extrovertido</code>, creemos que ese es un mito que no está basado en la realidad.\nLos grandes investigadores pueden ser introvertidos o extrovertidos, pero tienen\nque ser inquisitivos y buscar siempre formas de aprender más sobre la gente.</p>\n<h3 id=\"haciendo-mejores-preguntas\">Haciendo mejores preguntas</h3>\n<p>Ahora, en una situación de entrevista con usuarios, lo más probable es que no\npreguntemos \"por qué\" 5 veces seguidas. Esto es porque sería muy molesto para el\nusuario y probablemente no nos ayudaría a lograr nuestros objetivos de\ninvestigación.</p>\n<p>Así que no solo tenemos que ser curiosos, tenemos que aprender a hacer mejores\npreguntas.</p>\n<p>Hacer las preguntas correctas es realmente importante por 2 razones:</p>\n<ul>\n<li>Si obligamos a los usuarios a responder una respuesta que estamos buscando, o\nlos dirigimos a creer que hay una respuesta correcta, no lograremos capturar\ninformación adecuada.</li>\n<li>Si hacemos preguntas directivas, podemos incomodar al participante y es muy\nimportante que no hagamos esto.</li>\n</ul>\n<p>Una cosa por mencionar, es que, como investigador, estás representando a la\ncompañía para la que trabajas, y hay una política en la que nos debemos\nconcentrar durante las sesiones de investigación, sobre todas las cosas:\n<code>Nunca hagas daño</code>. Si una entrevista va mal y sientes que no has aprendido nada\nde lo que saliste a buscar, como mínimo deberías asegurarte que el participante\ndebería salir de la sesión sintiendo que su punto de vista fue apreciado y\nescuchado. Lo peor que puede pasar en un estudio es que el participante sienta\nque fue puesto a prueba y se equivocó en todas las respuestas, o peor aún, que\nse lleve una imagen negativa de la empresa por la forma en que lo trataste.</p>\n<p>Vamos a discutir algunas tácticas para evitar esto después, podría sonar como\nsentido común, pero son cosas importantes para tener en mente. Es especialmente\nimportante si trabajas con stakeholders de la empresa con un interés en el\nresultado de la investigación, y que podrían intentar jalar la conversación con\nusuarios en una dirección particular.</p>\n<p>Siempre debes poner la comodidad y necesidades de tus usuarios primero, y los\nobjetivos de la investigación en un cercano segundo lugar.</p>\n<h4 id=\"para-una-entrevista\">Para una entrevista</h4>\n<ul>\n<li>Lleva una guía de discusión</li>\n<li>Usa lenguaje positivo</li>\n<li>Valora el silencio</li>\n<li>No interrumpas</li>\n<li>Reconoce las respuestas de los entrevistados</li>\n<li>Haz preguntas para ir más a fondo (follow up questions)</li>\n<li>Sal de la guía cuando sea necesario</li>\n<li>Responde a preguntas con preguntas</li>\n<li>Ten alguna forma de documentar las respuestas (notas, grabaciones, etc)</li>\n</ul>\n<h4 id=\"consejos-para-hacer-preguntas-en-entrevistas\">Consejos para hacer preguntas en entrevistas</h4>\n<ul>\n<li>Haz preguntas abiertas: ¿Qué medios de transporte usas?</li>\n<li>Pregunta sobre el comportamiento real: Cuéntame sobre tus hábitos de transporte.</li>\n<li>Enfócate en casos específicos: Cuéntame sobre la última vez que pediste un taxi</li>\n<li>Haz que las personas se concentren: ¿Me ayudas a resumir eso en una oración?</li>\n<li>Usa el silencio: *Las personas se sienten obligadas a rellenar los silencios.</li>\n<li>Haz preguntas simples: ¿Qué medios de pago usas cuando compras online?</li>\n<li>Pregunta ¿por qué seguido?: Me puedes hablar un poco más sobre eso.</li>\n</ul>\n<h2 id=\"arco-de-una-entrevista\">Arco de una entrevista</h2>\n<p>Muchos investigadores mencionan el arco de una entrevista, que básicamente es la\nforma en que la entrevista progresa a través del tiempo que tienes con los\nparticipantes. En el eje horizontal tienes el tiempo y en el eje vertical tienes\nun promedio de cuánto es probable que aprendas durante ese momento.</p>\n<p>Típicamente en los primeros cinco minutos vas a pasar la mayoría del tiempo\ntratando de hacer que tu participante se sienta cómodo, y ponerlo en contexto\ncon el proyecto. Puedes empezar por presentarte y explicar por qué lo has\nelegido como participante a él o ella.</p>\n<p>El siguiente paso se llama <code>construir rapport</code>, que básicamente significa hacer\nque la otra persona se sienta cómoda y sienta que puede confiar en ti. En esta\nfase en verdad no vas a aprender mucho. Eso está bien, porque todo el tiempo que\ninviertas en hacer que tu participante se sienta cómodo es increíblemente\nimportante. Si se sienten cómodos, hay mucha más probabilidad de que te de sus\nopiniones y pensamientos honestos. Puedes charlar un rato con el participante -\npreguntarle por su día o conversar sobre un tema neutral.</p>\n<p>Durante el calentamiento, te concentrarás en una lista de preguntas que te darán\nun mejor entendimiento sobre la persona que estás entrevistando, así como de\ntodo el contexto en el que usa el producto. Como verás, en este punto ya estás\nempezando a aprender un poco más.</p>\n<p>Una vez que has hecho algunas preguntas de fondo, puedes pasar a la \"carnecita\"\nde la entrevista. Si estás haciendo una investigación de observación o de\nusabilidad, este es el momento en que todas tus preguntas de ese tipo irán. En\neste momento en la entrevista generalmente será cuando más aprendes sobre el\ntema o producto particular para el que hiciste la investigación.</p>\n<p>Luego de completar las preguntas detalladas, puedes hacer unas cuantas preguntas\nde resumen. Esta parte es muy importante porque los usuarios típicamente te\ndarán buenos insights y citas acerca de su experiencia en general. Como verás,\nlos aprendizajes en el arco de la entrevista se disparan justo al final, porque\npedirle a la gente que resuma su experiencia los hace reflexionar y conectar los\npuntos un poquito. (Algunas veces la gente necesita un poco de tiempo para\npensar antes de poder articular lo que funcionó y lo que no funcionó.)</p>\n<p>Algunos ejemplos de preguntas de informe:</p>\n<ul>\n<li>Entonces, ¿cuál fue tu impresión en general de lo que viste hoy?</li>\n<li>¿Cuáles son algunos de tus pensamientos generales?</li>\n<li>¿Qué partes te gustaron?</li>\n<li>¿Qué partes no te gustaron tanto?</li>\n<li>¿Hay algún otro comentario que te gustaría compartir?</li>\n</ul>\n<h2 id=\"building-rapport\">Building rapport</h2>\n<p>Muchos investigadores hablan de la importancia de \"construir rapport\", que\nesencialmente significa generar confianza y un espacio seguro donde tu\nparticipante sienta que realmente puede abrirse y compartir sus experiencias.</p>\n<p>Es importante que no empieces inmediatamente con preguntas detalladas para la\nentrevista. Por ejemplo, nunca saltes directo a preguntas de testeo de\nusabilidad porque realmente necesitas que tu usuario se acostumbre y se sienta\ncómodo contigo primero. Usa los primeros minutos para preguntarle un poco sobre\nsí mismo.</p>\n<p>Algunos consejos que pueden ayudarte mientras te preparas para entrevistar\nusuarios:</p>\n<ul>\n<li>Métete en el personaje de \"investigador\" - Muchos investigadores hablan de\n\"meterse en el personaje\" antes de una entrevista. La entrevista no es momento\nde ser crítico o juzgar a tu interlocutor, así que prepárate antes de la\nentrevista para tener una mente abierta. Muchos de nosotros estamos\nacostumbrados a demostrar todo lo que sabemos sobre nuestros productos,\ntecnología o diseños de nuestro trabajo diario, pero este no es un momento\npara presumir. No importa para nada lo que tú sabes, ya que estás ahí para\nescuchar, observar y aprender de tus usuarios.</li>\n<li>Sonríe - te ayudará mucho a poner cómodo a tu participante. Algunos\ninvestigadores incluso recomiendan sonreír en entrevistas por teléfono: tu voz\nsimplemente suena diferente cuando sonríes.</li>\n<li>Estar realmente interesado y conectado con lo que dice el usuario ayuda\nmuchísimo.</li>\n<li>Demuestra que estás escuchando - No hace falta que respondas a cada cosa que\ndicen.</li>\n<li>Alienta a tus participantes para que compartan feedback, comentarios y\ncríticas constructivas.</li>\n<li>No juzgues las opiniones de tus usuarios - No te preocupes, tendrás mucho\ntiempo luego para analizar todo el comportamiento que observaste, y las cosas\nque aprendiste durante la entrevista.</li>\n<li>No lances ideas - Esta no es una oportunidad para proponerle ideas nuevas a\nnadie. Trata de mantenerte lo más neutral posible para conseguir buena data.</li>\n</ul>\n<h2 id=\"los-5-actos-de-una-entrevista\">Los 5 actos de una entrevista</h2>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/1jULaA68HS0?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"el-arte-de-entrevistar\">El Arte de entrevistar</h2>\n<ul>\n<li><strong>Para ser un gran investigador, tienes que conversar como conductor de\ntelevisión, pensar como escritor, entender el subtexto como un psicoanalista y\ntener el oído de un músico.</strong></li>\n</ul>\n<p><em>¿Qué entendiste de esta frase?</em></p>\n<ul>\n<li>Conversar como conductor de televisión - pon claros el contexto del proyecto y\nlas metas por las que elegiste entrevistar a tu participante.</li>\n<li>Piensa como escritor - más adelante en el proyecto vas a pensar en cómo\nconstruir una narrativa para contar la historia de los hallazgos con tus\nusuarios.</li>\n<li>Entender subtexto como psicoanalista - debes observar el comportamiento y\nlenguaje corporal del consumidor. Observar lo que están haciendo, además de\nescuchar lo que dicen.</li>\n<li>Tener el oído de un músico - escucha cuidadosamente todo lo que los usuarios\ndicen. No es tu turno de mostrar todo lo que sabes.</li>\n</ul>\n<h2 id=\"los-problemas-más-comunes\">Los problemas más comunes</h2>\n<h3 id=\"las-personas-normalmente-no-te-dan-a-conocer-sus-malos-hábitos\">Las personas normalmente no te dan a conocer sus malos hábitos</h3>\n<p>Uno de los retos de la investigación cualitativa en general es que la gente\nsuele sub-reportar el mal comportamiento. No es porque sean malas personas, o\nestén tratando de engañarte, pero los humanos en general quieren ser vistos como\nbuenas personas. Solemos racionalizar el mal comportamiento convenciéndonos de\nque lo hacemos mucho menos de lo que en verdad hacemos.</p>\n<p>Por ejemplo, podríamos observar a las personas en lugar de preguntarles por su\ncomportamiento.</p>\n<p>Esta foto es un ejemplo de un tipo de mal comportamiento que la gente\nsub-reporta. Cuando se trata de contraseñas, mucha gente no usa claves seguras y\nelige algo como 123456 siempre que no hay requerimientos obligatorios de\nseguridad. Muchas personas también guardan sus contraseñas escritas en post-its\nen su escritorio. La mayoría de personas saben que no es seguro hacer esto, pero\nlo hacen porque es seguro y conveniente.</p>\n<p>En una entrevista, si preguntamos a las personas si siempre usan contraseñas\nseguras, es posible que digan que sí, pero esto no necesariamente representa lo\nque en verdad hacen. Este es un ejemplo clave de cómo las personas no siempre\nhacen lo que dicen que harán, y vice versa.</p>\n<p>Para evitar este problema potencial, podríamos pedir para observar a alguien\nmientras entra a una página web con su contraseña, en lugar de preguntarle si\nusa una contraseña segura.</p>\n<h3 id=\"las-entrevistas-ofrecen-información-sobre-lo-que-la-gente-dice-que-hará\">Las entrevistas ofrecen información sobre lo que la gente dice que hará</h3>\n<p>...pero esto no es una buena representación de su comportamiento real</p>\n<p>El segundo problema común es que muchas veces en entrevistas hacemos preguntas\nhipotéticas sobre lo que la gente haría en una situación particular, pero esto\nno siempre es una buena representación de cómo actuarían en verdad. Los humanos\nen general no son buenos para explicar su comportamiento potencial en el futuro,\nporque muchísimo de nuestro comportamiento depende del contexto específico en el\nque nos encontramos.</p>\n<p>Una táctica bastante útil es pedir a tus participantes que te cuenten sobre\nexperiencias reales y anécdotas relacionadas al tema que estás investigando.</p>\n<p>Una mala pregunta que le encanta a los investigadores es \"Pagarías por este\nproducto?\" o \"Crees que usarías este producto en el futuro?\" Estas no son\npreguntas valiosas en una entrevista.</p>\n<p>En el caso de \"Pagarías por este producto?\" podrías preguntarle por otros\nproductos por los que han pagado en el pasado que puedan compararse, y en esos\ncasos cuánto pagaron y por qué. También puedes intentar de hacer preguntas más\ngenerales sobre otros productos que han usado y seguir esas preguntas con otras\nsobre el precio.</p>\n<p>Apégate al dicho \"Mostrar, no contar\" siempre que puedas, porque el feedback que\nrecibas será mucho más rico y valioso.</p>\n<h3 id=\"los-humanos-tienen-problemas-de-memoria-que-el-cerebro-trata-de-compensar\">Los humanos tienen problemas de memoria que el cerebro trata de compensar</h3>\n<p>Otro problema frecuente que vemos como investigadores es que la gente normalmente\nno tiene tan buena memoria para recordar cualquier cosa que haya pasado hace más\nde una semana.</p>\n<p>Una opción para evitar este problema es hacer preguntas sobre una experiencia\nmuy específica. Por ejemplo, en lugar de preguntarle de manera general si leyó\nlos Términos y Condiciones, podrías preguntarle acerca de la última vez que tuvo\nque registrarse para un servicio como AirBnB y cómo lo hicieron. Puedes seguir\nesas preguntas con una acerca de si leyeron los términos o no, y por qué no.</p>\n<p>Nuevamente, sería mucho mejor si tienes la opción de observar gente pasando por\nun flujo de registro.</p>\n<h3 id=\"los-usuarios-no-son-diseñadores\">Los usuarios no son diseñadores</h3>\n<p>...y no están calificados para dar feedback sobre el diseño o saber exactamente\nqué quieren en un producto</p>\n<p>Otro problema común que pasa muy seguido en entrevistas de investigación es que\nlos investigadores tienden a preguntar a los usuarios qué pensaron de un diseño.\nLa mayoría de veces los usuarios no son diseñadores y no deberían tener que\ndarte feedback sobre un diseño para que puedas interpretar formas de mejorar sus\nexperiencias.</p>\n<p>Otro error común es preguntar a los usuarios exactamente qué quieren tener en un\nproducto. Como puedes ver en la cita de Steve Jobs:</p>\n<blockquote>\n<p>No es trabajo del cliente saber lo que quiere.\"</p>\n</blockquote>\n<p>Esta cita es súper importante y la deberían recordar. Como investigadores,\nnosotros deberíamos intentar entender mejor los problemas o desafíos que tiene\nun usuario, en lugar de preguntarles lo que quieren. Es el trabajo de tu equipo\ndescubrir qué necesitan los usuarios en base a los descubrimientos de las\nentrevistas con usuarios.</p>\n<p>Como mencionamos, una forma de evitar preguntar qué quieren las personas es\nhacer más preguntas acerca del contexto de usar el producto.</p>\n<p>Aquí hay 3 preguntas fáciles que te pueden ayudar a llegar al objetivo de\nidentificar lo que los usuarios necesitan o quieren:</p>\n<ul>\n<li>¿Qué estás intentando hacer?</li>\n<li>¿Qué estás haciendo en este momento?</li>\n<li>¿Qué podría mejorar de cómo lo estás haciendo actualmente?</li>\n</ul>\n<h3 id=\"los-usuarios-quieren-una-respuesta-cuando-tienen-dudas-sobre-el-flujo\">Los usuarios quieren una respuesta cuando tienen dudas sobre el flujo</h3>\n<p>Responde a preguntas con preguntas</p>\n<ul>\n<li>Usuario: ¿Debo hacer un clic aca para buscar un vuelo?</li>\n<li>Investigadora: ¿Qué piensas tú?, ¿Cómo lo harías?</li>\n</ul>\n<p>Algunos consejos para tener en mente:</p>\n<ul>\n<li>Asegúrate de no hacer preguntas directivas (leading questions) que puedan\ncausar una respuesta sesgada. Haz preguntas abiertas.</li>\n<li>No dejes ninguna información \"sobre la mesa\" - haz repreguntas y dale\nseguimiento a tus preguntas para sacar toda la información posible. Si no\nentiendes algo, no tengas miedo de pedir a tu usuario que repita lo que dijo.</li>\n<li>Responde preguntas con preguntas en lugar de responder al usuario cuando te\nhace preguntas sobre el producto o diseño - ¿Qué piensas tú? ¿Qué harías tú?</li>\n<li>Ten cuidado con el tiempo y trata de no excederte del tiempo agendado.</li>\n<li>Cuida tu lenguaje corporal, y especialmente tus expresiones faciales. Por\nejemplo, si el usuario hace o dice algo que no esperabas, trata de no verte\nsorprendido o confundido.</li>\n</ul>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://blog.marvelapp.com/art-user-interview/\" target=\"_blank\">The Art of the User Interview</a></li>\n<li><a href=\"https://library.gv.com/how-to-hack-your-body-language-for-better-interviews-2b28b99ece6d\" target=\"_blank\">How to hack your body language for better interviews</a></li>\n<li><a href=\"https://library.gv.com/get-better-data-from-user-studies-16-interviewing-tips-328d305c3e37\" target=\"_blank\">Get better data from user studies: 16 interviewing tips</a></li>\n<li><a href=\"https://library.gv.com/how-to-build-better-rapport-for-better-research-interviews-869952b6a71d\" target=\"_blank\">How to Build Better Rapport For Better Research Interviews</a></li>\n<li><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/WpzmOH0hrEM?t=45m00s&amp;autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></li>\n</ul>\n",
          "order": 0,
          "durationString": "2h"
        },
        "01-interviews-exercises": {
          "title": "Ejercicio entrevistas mudas",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"indicaciones\">Indicaciones</h2>\n<p>En este ejercicio las estudiante se ponen en parejas y se entrevistan, pero la\nentrevistadora es ‘muda’, no puede hablar. Tienen que buscar la manera de hacer\nla entrevista con señas.</p>\n<p>Un tema interesante para preguntar puede ser ‘qué opinan de la etapa de la\nsecundaria / prepa / superior’.</p>\n<p>Luego cambian de turno y para que las dos puedan practicar el ejercicio.</p>\n<p>Finalmente, se hacer una reflexión:</p>\n<ul>\n<li>¿Qué les pareció?¿Qué retos tuvieron?</li>\n<li>¿Encontraron que cuando están en silencio el entrevistado tiende a llenar los\nespacios con palabras y va más profundo en la historia que está contando?</li>\n<li>¿Se dieron cuenta que cuando no pueden hablar no interrumpen al entrevistado y\nlo dejan hablar?</li>\n</ul>\n",
          "order": 1,
          "durationString": "30min"
        },
        "02-interview-guide": {
          "title": "Guía para entrevistas",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"guía-para-las-entrevistas\">Guía para las entrevistas</h2>\n<p>Cuando empiezas a planear tus entrevistas, deberías armar un guión con un set de\npreguntas que cubra todos los temas que te gustaría discutir. Preparar el guión\nes una forma de definir y priorizar las metas de investigación, y de plantear\nuna estructura para la conversación.</p>\n<p>Una buena guía de discusión es, probablemente, la parte más importante de tu\nplan de investigación. Es el mapa que te guiará a los aprendizajes que buscas, y\nte ayudará a asegurar que tus sesiones de investigación sean productivas. Se le\nllama guía específicamente por esa razón: debería guiarte a través de la\nconversación, pero <em>no tengas miedo de salirte del esquema si aparecen otros\ntemas que pueden ser interesantes</em>.</p>\n<h3 id=\"formato-de-la-guía\">Formato de la Guía</h3>\n<p>En la mayoría de empresas, esto va a ser parte esencial de las investigaciones\nque realices. Sin embargo, si estás haciendo un testeo rápido e informal de algo\npequeño, quizá no haga falta pasar por todos los pasos.</p>\n<p>Recomendamos escribir primero las metas de la investigación y cuáles son las\ngrandes preguntas que queremos responder. En realidad, no existe un número\nmágico de preguntas, pero normalmente deberías planear una sesión de 60 minutos\ncomo máximo. Es mejor si puedes mantener la discusión enfocada y la limitas a\n30 minutos.</p>\n<p>Luego de eso debes presentarte a ti mismo y la temática del estudio. Asegúrate\nde explicar al participante por qué está ahí y lo que el equipo busca descubrir.\nSi planeas grabar las sesiones deberás pedir permiso al participante antes de\nempezar. Dependiendo de la compañía en la que trabajes, esto quizá tenga que\nestar acompañado de un <code>Acuerdo de Confidencialidad</code>, un contrato que dice que\nlo que grabes será solo para propósitos de la investigación. El AdC (NDA por sus\nsiglas en inglés) también protege a tu empresa contra que los participantes\nrevelen información propietaria, por ejemplo, si le muestras un prototipo o\ndiseño que todavía no está en producción o en el mercado.</p>\n<p>Luego tendrás que escribir algunas preguntas de calentamiento, para entender más\nsobre el contexto en el que los usuarios usan tu producto. Normalmente es útil\npara entender su frecuencia de uso tanto del producto como de tecnología en\ngeneral. También puedes aprovechar la oportunidad para preguntarles por otros\nproductos o plataformas similares que usan, y por qué eligen esos productos.</p>\n<p>En la siguiente sección tendremos todas las preguntas detalladas de la\nentrevista. Normalmente escribimos esta sección justo después de hacer la lista\nde objetivos del estudio, para asegurarme que las preguntas que hago nos estén\nayudando realmente a cumplir con la meta de responder las preguntas centrales.</p>\n<p>Finalmente, debes tener una sección de cierre en la que pides al usuario que\nresuma sus experiencias y pensamientos. Usualmente los últimos 5 minutos de una\nentrevista pueden ser los más cruciales, porque resumir tus experiencias te hace\npensar de forma crítica sobre cómo te sientes sobre un producto en particular.\nTambién es una buena oportunidad de conseguir algunas citas textuales para\ncompartir con tus stakeholders.</p>\n<p><a href=\"https://docs.google.com/document/d/1RJ8geIimSzqhCVzVtWPMpnYt7euvahireixnW-mn2JA/edit?usp=sharing\" target=\"_blank\">Ejemplo de guía de entrevista</a></p>\n",
          "order": 2,
          "durationString": "30min"
        },
        "03-interview-guide-exercise": {
          "title": "Ejercicio guía de entrevistas",
          "type": "workshop",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"indicaciones\">Indicaciones</h2>\n<p>Ahora que sabes más sobre guías de entrevistas, regresa a tu guía de entrevistas\ny si tienes que hacer algún ajuste, házlo ahora.</p>\n<ul>\n<li>Júntate en grupos de 3 personas y entrevistense entre ustedes usando su guía\nde entrevistas.<ul>\n<li>Una es la entrevistadora, otra la entrevistada y la 3era anotará los\nproblemas/errores, buenas prácticas, buenas preguntas que hizo la\nentrevistadora durante la entrevista. La 3era también es la encargada de\ngrabar la sesión para que la entrevistadora pueda ver/escuchar su grabación\nluego.</li>\n<li>Al terminar la primera entrevista, se le da el feedback a la entrevistada\ny se rota para que las 3 pasen por los 3 roles.</li>\n</ul>\n</li>\n<li>Teniendo en cuenta que fue la primera vez que probaste tu guía de entrevistas,\nutiliza el feedback que te dieron tus compañeras y la experiencia que tuviste\ncon tu primera entrevista para adaptar/mejorar tu guía de entrevistas.</li>\n<li>Júntate nuevamente en grupos de 3 (con otras compañeras) y repitan el\nejercicio de entrevistarse.</li>\n</ul>\n",
          "order": 3,
          "durationString": "1h"
        },
        "04-observation": {
          "title": "Investigación Contextual",
          "type": "read",
          "format": "self-paced",
          "duration": 20,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>En este tipo de investigación observamos a los usuarios utilizar el producto en\nel ambiente donde normalmente utilizan lo utilizan. (Mac vs PC, Android vs\niPhone, casa vs trabajo vs auto, etc.)</p>\n<h2 id=\"observación\">Observación</h2>\n<h3 id=\"ventajas\">Ventajas</h3>\n<ul>\n<li>Nos permite observar sus reacciones y frustraciones naturales</li>\n<li>Previenen de tomar supuestos riesgosos, ayudándonos a asegurarnos que estamos\nsolucionando los problemas correctos</li>\n</ul>\n<h3 id=\"cómo-hacemos-observación\">Cómo hacemos observación</h3>\n<p>Al observa a un usuario realizar alguna actividad debemos preguntarnos lo\nsiguiente:</p>\n<h4 id=\"qué\">Qué</h4>\n<p>Qué es lo que está haciendo la persona a la que estamos observando en la\nsituación que estamos observando. Anota lo obvio y lo sorprendente.</p>\n<h4 id=\"cómo\">Cómo</h4>\n<p>Cómo está haciendo la actividad. ¿Se está esforzando?. ¿Está feliz? ¿Triste?\n¿La actividad que está realizando lo impacta da alguna manera positiva o\nnegativa?</p>\n<h4 id=\"por-qué\">Por qué</h4>\n<p>Por qué está haciendo lo que está haciendo y en la manera en que lo está\nhaciendo. En este paso normalmente requerimos hacer suposiciones informadas\nsobre las motivaciones y emociones. Este paso revelerá ciertas supocisiones que\npodrás validar luego en una entrevista con el usuario.</p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://dschool.stanford.edu/resources/the-bootcamp-bootleg\" target=\"_blank\">dSchool Bootcamp Bootleg</a></li>\n<li><a href=\"https://www.ideou.com/products/insights-for-innovation\" target=\"_blank\">Ideo insights for innovation</a></li>\n</ul>\n",
          "order": 4,
          "durationString": "20min"
        },
        "05-observation-exercise": {
          "title": "Ejercicio Observación´",
          "type": "workshop",
          "format": "self-paced",
          "duration": 10,
          "body": "<h2 id=\"indicaciones\">Indicaciones</h2>\n<p>Pídele a 5 personas distintas, de distintos contextos que te manden los\nscreenshots (pantallazos, print screens) de las 2 o 3 primeras pantallas de su\ncelular. Revisando estas imágenes:</p>\n<ul>\n<li>qué es lo que te causa más curiosidad</li>\n<li>qué es lo que te parece más extraño</li>\n<li>qué puedes inferir de esta persona</li>\n<li>haz una lista de preguntas que le harías a esta persona para entenderla mejor</li>\n</ul>\n",
          "order": 5,
          "durationString": "10min"
        },
        "06-usability-testing": {
          "title": "Testing",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/v8JJrDvQDF4",
              "id": "v8JJrDvQDF4"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/9wQkLthhHKA",
              "id": "9wQkLthhHKA"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/3Qg80qTfzgU",
              "id": "3Qg80qTfzgU"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/V-An4Jfplew",
              "id": "V-An4Jfplew"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>En los tests de usabilidad probamos nuestros productos en cualquier versión\n(muchas veces prototipos) para ver hasta qué nivel los usuarios pueden completar\ntareas en ellos. Durante esta etapa vemos cómo los usuarios interactuan con los\nproductos y qué problemas pueden tener para completar las tareas.</p>\n<h2 id=\"por-qué\">Por qué</h2>\n<p>Mira este video de Jakob Nielsen contando por qué y cómo testear con usuarios:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/v8JJrDvQDF4?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"cuándo-testear\">Cuándo testear</h2>\n<p>Las UX Designers estamos constantemente haciendo testeos de los productos con\nlos que trabajamos. Testeamos en distintos tipos de fidelidad, desde nuestros\nprimeros wireframes o sketches en papel, nuestros prototipos interactivos y\ntambién el producto \"final\" (como estamos constantemente mejorando, rara vez\nun producto es el final) en código. Para empezar, miira los siguientes ejemplos\nde cómo se pueden hacer tests de usabilidad con un prototipo en papel e incluso\ncon frutas. Intenta anotar todos los aprendizajes que se van teniendo con esta\ntécnica.</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/9wQkLthhHKA?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/3Qg80qTfzgU?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"planificación\">Planificación</h2>\n<ul>\n<li><strong>Reclutamiento:</strong> asegúrate que reclutas usuarios que sean relevantes\npara tu producto.<ul>\n<li>Es mejor si no son conocidos</li>\n<li>Hazle llenar un screener</li>\n<li>Ofrece una recompensa</li>\n</ul>\n</li>\n<li><strong>Tareas:</strong> elabora una lista de tareas que los usuarios tendrán que completar\ncon el prototipo.</li>\n<li><strong>Script:</strong> prepara un script donde detalles lo que le dirás al usuario. Cómo\nle presentarás el producto y la sesión.</li>\n<li><strong>Autorización</strong> haz un documento de autorización en la que el usuario te da\npermiso para grabarlo y para usar la grabación para los fines del estudio.</li>\n</ul>\n<h2 id=\"la-sesión-de-testing\">La sesión de testing</h2>\n<ul>\n<li><strong>Bienvenida cálida e introducción:</strong> Dale la bienvenida al usuario y hazlo\nsentir cómodo. Explícale que estamos buscando su feedback para crear un mejor\nproducto.</li>\n<li><strong>Preguntas sobre el contexto del usuario:</strong> ten una mejor idea de qué hace el\nusuario en el día a día, que tanto usa tecnología, internet, mobile, etc. Haz\nlas primeras preguntas sobre el tema del que quieres aprender.</li>\n<li><strong>Introducción a los prototipos:</strong> Recuerdale al usuario que algunas cosas\nquizás no funcionen y que estás testeando el prototipo y no a él. Pídele que\npiense en voz alta durante el test.</li>\n<li><strong>Mostrar tareas:</strong> empieza con un pequeño empujón y luego deja que el usuario\nrealice todas las tareas por su cuenta. Intenta hacer pequeñas preguntas que\nhagan que el usuario piense en voz alta.</li>\n<li><strong>Cierre - debrief:</strong> haz preguntas que hagan que el usuario resuma su\nexperiencia. Luego agradécele por su ayuda y entrégale el regalo.</li>\n</ul>\n<h2 id=\"técnicas-para-facilitar-un-test-de-usabilidad\">Técnicas para facilitar un test de usabilidad</h2>\n<p>Mira este video de NNgroup contándonos valiosos tips para facilitar tests de\nusabilidad:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/V-An4Jfplew?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n",
          "order": 6,
          "durationString": "30min"
        },
        "07-user-recruiting": {
          "title": "Reclutamiento de usuarios",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"reclutamiento\">Reclutamiento</h2>\n<p>A lo largo de nuestro trabajo como UX Designers vamos a necesitar reclutar\nusuarios para hacer entrevistas, observación y testeos. Cuando reclutamos,\ntenemos que tener en cuenta que necesitamos que estos usuarios sean parte del\npúblico objetivo</p>\n<p>Hay dos formas de reclutar usuarios: en páginas de anuncios o en nuestra propia\nred de contactos.</p>\n<p>En páginas de anuncios puedes postear un aviso genérico sobre la investigación\nque estás realizando y ofrecer una recompensa por el tiempo de estos usuarios.\nRegularmente, en empresas reales, se entregan tarjetas de regalo por algún\nmonto o algún producto gratuito. Recuerda que el tiempo del usuario no es gratis\ny muchas veces hasta tiene que trasladarse al lugar donde haremos la entrevista\no testeo.</p>\n<ol>\n<li><p>Crea una lista de atributos</p>\n<p>Mínimo 5 atributos que tiene que tener el usuario para que sea valioso para\ntu investigación. Si tienes más de 5 genial. Es un buen punto de partida.\nAlgunos ejemplos de atributos que pueden servirte:</p>\n<ul>\n<li>Utiliza un iphone</li>\n<li>Vive en x barrio</li>\n<li>Es usuario de snapchat</li>\n<li>Es menor de 20 años</li>\n<li>Estudia x carrera</li>\n</ul>\n</li>\n<li><p>Transforma estos atributos en criterios medibles</p>\n<p>Por ejemplo un criterio como \"viajero de negocios\" se vuelve medible cuando\ndecimos \"viaja por negocios una vez al mes\". \"Una vez al mes\" sí se puede\nmedir.</p>\n</li>\n<li><p>Transforma este criterio medible en una pregunta para el screener</p>\n<p>Escribe la pregunta de una manera neutral para evitar que las personas que\nquieran participar solo por llevarse el regalo adivinen la respuesta\n\"correcta\".\nEn lugar de preguntar <em>¿Qué tan seguido viajas por negicios?</em> puedes\npreguntar simplemente <em>¿Qué tan seguido viajas?</em> y dar las siguientes\nopciones:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\"></th>\n<th>Nunca</th>\n<th>Una vez al año</th>\n<th>Una vez cada tres meses</th>\n<th>Una vez al mes</th>\n<th>Una vez por semana</th>\n</tr>\n</thead>\n<tbody><tr>\n<td align=\"left\">Vacaciones</td>\n<td>[ ]</td>\n<td>[ ]</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">Negocios</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">Diversión</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td align=\"left\">Otros motivos</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n</tbody></table>\n</li>\n<li><p>Crea una tabla de 3 columnas</p>\n<ul>\n<li>En la primera pon el criterio que buscas en el usuario</li>\n<li>En la segunda cómo es que vas a medir e identificar este criterio</li>\n<li>En la tercera escribe la pregunta que pondrás en el screener</li>\n</ul>\n</li>\n<li><p>Crea el screener</p>\n<ul>\n<li>Agrega todas las preguntas que necesitas en el screener</li>\n<li>Asegúrate que el cuestionario del screener pueda seguir un buen flujo</li>\n<li>Agrega preguntas adicionales sobre disponibilidad y datos de contacto</li>\n</ul>\n</li>\n<li><p>Distribuye el screener y elige a los participantes que cumplan los criterios\nque necesitan.</p>\n</li>\n</ol>\n",
          "order": 7,
          "durationString": "30min"
        }
      },
      "order": 1,
      "stats": {
        "duration": 330,
        "durationString": "5.5h",
        "exerciseCount": 0,
        "partCount": 8
      }
    },
    "02-quantitative-research": {
      "title": "Entendimiento del Usuario: investigación cuantitativa",
      "bonus": false,
      "description": "<p>...</p>\n",
      "parts": {
        "00-intro": {
          "title": "Research cuantitativo",
          "type": "read",
          "format": "self-paced",
          "duration": 10,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>El research y la data cuantitativa nos ayudan a entender la situación actual del\nproblema que queremos resolver. Por ejemplo:</p>\n<ul>\n<li>Cuántos visitantes tenemos en nuestro site</li>\n<li>Cuántos compran X o Y producto</li>\n<li>Dónde tenemos el mayor ratio de abandono dentro del proceso de compra</li>\n</ul>\n<p>En este <a href=\"https://www.uxmatters.com/mt/archives/2012/09/strengths-and-weaknesses-of-quantitative-and-qualitative-research.php\" target=\"_blank\">artículo</a>\nde UX Matters nos dicen lo siguiente:</p>\n<blockquote>\n<p>Los estudios cuantitativos proporcionan datos que pueden ser expresados en\nnúmeros, de ahí, su nombre. Debido a que los datos están en una forma numérica,\npodemos aplicar pruebas estadísticas al hacer declaraciones sobre los datos.</p>\n</blockquote>\n",
          "order": 0,
          "durationString": "10min"
        },
        "01-analytics": {
          "title": "Análisis de datos",
          "type": "read",
          "format": "self-paced",
          "duration": 40,
          "body": "<h2 id=\"analítica\">Analítica</h2>\n<p>Dependiendo de la robustez de los analytics que tenga la empresa podemos\nrevisar:</p>\n<ul>\n<li>Dispositivos desde los que acceden<ul>\n<li>Entran más desde móviles o desktop</li>\n<li>¿Qué resoluciones de pantallas utilizan?</li>\n</ul>\n</li>\n<li>Ciudades / Países desde los que acceden<ul>\n<li>¿ Son la mayoría de la capital? ¿o de otras ciudades del interior? ¿Otros\npaíses?</li>\n</ul>\n</li>\n<li>Engagement con las campañas de email<ul>\n<li>% de emails que son abiertos</li>\n<li>% de personas que dieron clic a un link</li>\n</ul>\n</li>\n<li>Funneles de conversión<ul>\n<li>¿Dónde está la mayor caída en las conversiones</li>\n</ul>\n</li>\n</ul>\n<p><strong>Herramientas de analítica:</strong></p>\n<ul>\n<li>Mixpanel</li>\n<li>Google Analytics</li>\n<li>Visual Web Optimizer</li>\n<li>Hotjar</li>\n<li>Segment</li>\n<li>Intercom</li>\n</ul>\n<p><img src=\"https://lh3.googleusercontent.com/NsPbuYZN6yjWdnuvjoBBhlI227jjXoVXwzofHlP7DrK8AuA_jVzYBKkGUufY__NVAiUriv0ZLZJYw5vEId34zl8Tiu25ui_3b31cSnHpFty4NWzobbrbrK965vLoTvQ3nFW2jnaNK80\" alt=\"Image\"></p>\n<p> <em><strong>¿Qué pasa si no tenemos analítica?</strong></em></p>\n<p>En el caso que tengamos un producto digital existente, pero no tengamos\nAnalytics. Es recomendable obtener analytics de al menos una semana. Para ello\npodemos utilizar las siguientes herramientas:</p>\n<ul>\n<li>Google Analytics</li>\n<li>Mixpanel</li>\n<li>Hotjar</li>\n<li>VWO</li>\n</ul>\n<h2 id=\"estadísticas-de-uso\">Estadísticas de uso</h2>\n<p>Revisar todas las estadísticas que podamos tener del producto.</p>\n<ul>\n<li>Features más usados</li>\n<li>Ticket promedio</li>\n<li>Frecuencia de compra</li>\n<li># de compras por mes</li>\n<li># usuarios</li>\n<li># usuarios activos</li>\n<li>% de churn</li>\n</ul>\n<p><img src=\"https://lh6.googleusercontent.com/GvrCmCsI_MnWKXNqDuYvJuNA1kDZM2_Ip9iTUkviOko1gvMvDyUyGQ6lQOBQLj6jp9nqe9zpKFFn8Ohip5Zyb1dG7m4D-nBLPUGKf7fIgu0dxTwkmkIEP04yYmokq4ZMAbHQB7rQp0s\" alt=\"Image\"></p>\n<h2 id=\"estudios-de-mercado\">Estudios de mercado</h2>\n<p>Revisar los estudios de mercado que estén disponibles.</p>\n<ul>\n<li>% de participación</li>\n<li>Características de la población</li>\n<li>Proyecciones de crecimiento económico</li>\n<li>Encuestas de satisfacción</li>\n</ul>\n<p><img src=\"https://lh5.googleusercontent.com/uLknPlR5Wii0Ftvm2n58XZi5zqGwTCOXXZi3Jeo775sqkBdSE5p-d4YO3umLt_0iXnYF3GJXfpmgpEwVSwux9H7i_Ex63BZuMUYSk6ajkbihRcymvfRMvBGTYfzErQWiI7ITi-OCxKY\" alt=\"Image\"></p>\n<h2 id=\"documentos-internos\">Documentos internos</h2>\n<p>Revisar los documentos internos que puedan servir como parte del análisis</p>\n<ul>\n<li>Planes de marketing</li>\n<li>Reportes de equipos de ventas</li>\n<li>Reportes de equipos de servicio al cliente</li>\n<li>Focus groups anteriores</li>\n<li>Estudios de usabilidad</li>\n<li>Reportes de campañas de marketing</li>\n</ul>\n<p><img src=\"https://lh4.googleusercontent.com/G3JkQKrZ8HmNAjH3NlQ_zIMFoLlDwYozNtNkmn47jS0NwrjxHfOktXoKCSxiW71yxzbciWdM1ZBGXNnDx_PXdDrpOmODJL3V4g_0Q1E_-ddbIIScsmn3Wgv7reEfZaMd5S0WbJVxwjs\" alt=\"Image\"></p>\n<h2 id=\"búsquedas-en-la-web\">Búsquedas en la web</h2>\n<p>Buscar en la web sobre temas relevantes al problema que estamos enfrentando.</p>\n<ul>\n<li>Grupos de facebook (el buen dato)</li>\n<li>Fan pages</li>\n<li>Reddit</li>\n<li>Twitter</li>\n<li>Otras redes sociales</li>\n<li>Blogs</li>\n<li>Yahoo respuestas</li>\n<li>Foros</li>\n</ul>\n<p><img src=\"https://lh6.googleusercontent.com/D9TJpHB4tRuiHlRUY59wt_kaIUZie36FKEFEWBEq2J59XUx_fj03XLrnGCnaezlcqsnJ7GpE-rjZfLDQKGWpyI4PGpoenjPL2juf4Pgk22oJKcuh-imKijKkLPHsgdDPE13OywQs3fU\" alt=\"Queja banco peruano\"></p>\n",
          "order": 1,
          "durationString": "40min"
        },
        "02-surveys": {
          "title": "Encuestas",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<p>Una encuesta es, probablemente, el método de investigación más rápido y\neconómico que podemos implementar. Cualquiera puede crear una encuesta sobre su\nproducto en 10 minutos, más aún como herramientas modernas como Google Forms o\nTypeform.</p>\n<p>Sin embargo, las encuestas son el <em>método de investigación más difícil de\nejecutar de manera correcta</em>. Crear una encuesta requiere ciencia, ya que es muy\nfácil crear una encuesta con muy malas preguntas y considerar estas respuestas\nsesgadas y engañosas como respuestas certeras de nuestra investigación.</p>\n<p>Intenta recordar la última vez que llenaste una encuesta. ¿Fuiste 100% sincera?\nRecuerda otras encuestas que hayas contestado ¿hubo alguna en la que marcaste\ntodo 5 o todo 0 solo para contestarla rápido? ¿Llenaste alguna vez una encuesta\nsobre un producto que nunca usabas y para el que no eras parte del público\nobjetivo?</p>\n<p>Este es el riesgo que corremos con una encuesta y que hemos visto que pasa\nmucho:</p>\n<ul>\n<li>Creo una encuesta</li>\n<li>La distribuyo por Facebook, Whatsapp y correo electrónico</li>\n<li>La llenan muchos de mis contactos</li>\n<li>Utilizo estas respuestas para sustentar mis decisiones de diseño o de negocio</li>\n</ul>\n<p>¿Qué es lo que está mal? En primer lugar, es probable que toda tu red de\ncontactos no sen parte del público objetivo del producto para el cuál estás\ntrabajando. Por ejemplo, si es que estás haciendo una investigación sobre\nunas nuevos funcionalidades para Slack y lanzas tu encuesta en Facebook. ¿Serán\nlas respuestas de todos tus contacos adecuadas para tu investigación? O, si\nestás haciendo una investigación para una red social de vegetarianos o de madres\nsolteras. ¿Serán todos tus contactos los adecuados para contestar la encuesta?\nIncluso si tus contactos cumplieran con todo el perfil, ¿serán ellos los únicos\nactuales o futuros clientes de tu producto? Probablemente no. Piensa en las\núltimas elecciones presidenciales en tu país, si lanzabas una encuesta sobre\nel candidato por el cuál votarían tus contactos, ¿la respuesta hubiera sido\nigual al resultado final? ¿Hubiera salido presidente la persona que finalmente\nganó? ¿Hubiera ganado con la misma diferencia que tuvo en los resultados\nfinales? Problemente no.</p>\n<p>Otro error en el que solemos caer es la formulación de preguntas. Hacemos\npreguntas sobre comportamientos futuros como: ¿usarías nuestro producto? ¿cuánto\npagarías por este producto?. Cuando existen otros métodos de investigación que\nnos pueden llevar a observar mejor estos comportamientos. También, es sencillo\nguiar las respuestas de acuerdo a nuestras expectativas, por ejemplo, a veces no\nponemos respuestas que no nos favorecen como ¿con qué frecuencia utilizarías\neste producto? Con opciones como <code>diariemente</code>, <code>interdiario</code>, <code>una vez al mes</code>,\ndejando de lado el <code>nunca</code>.</p>\n<p>Finalmente, otro error en las encuestas tiene que ver con promediar los\nresultados. Imagínate una encuesta sobre el tamaño de pantalla de celular\npreferido por los usuarios. Digamos que 500 usuarios respondieron 3.5 pulgadas\ny otros 500 respondieron 5.5 pulgadas. Hemos visto casos en los que se promedian\nestos resultados y se concluye con: \"construyamos un celular con una pantalla\nde 4.5 pulgadas, porque es el promedio que quieren los usuarios\".</p>\n<p>Cuando hagamos encuestas, hay que tener mucho cuidado con lo que preguntamos y\nquién se lo preguntamos. Tomer Sharon, por ejemplo, dice que el le deja las\nencuestas a gente que de verdad sabe como hacerlas, como las personas que hacen\nencuestas de intención de voto en política, sabes por qué, porque son hechas por\nestadísticos que tienen en cuenta conceptos como muestreo y niveles de\nconfianza.</p>\n",
          "order": 2,
          "durationString": "30min"
        }
      },
      "order": 2,
      "stats": {
        "duration": 80,
        "durationString": "1.3h",
        "exerciseCount": 0,
        "partCount": 3
      }
    },
    "03-synthesis": {
      "title": "Entendimiento del Usuario: síntesis",
      "bonus": false,
      "description": "<p>...</p>\n",
      "parts": {
        "00-synthesis": {
          "title": "Síntesis e interpretación",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>En la fase de síntesis usamos los datos coleccionados en la fase de\ninvestigación y descubrimiento buscando tendencias e insights valiosos para el\ndesarrollo del producto, y entendiendo los deseos y necesidades del público al\nque estará dirigido nuestro producto.</p>\n<p>Para que tengas una idea de las actividades que implicac esta fase, lee el\nsiguiente documento de <a href=\"https://designthinkingforeducators.com/\" target=\"_blank\">IDEO</a>.</p>\n<p>Mira esta <a href=\"https://drive.google.com/file/d/0B0NdG2VNCDPzLU1CcFJZaU91ajg/preview%22\" target=\"_blank\">presentación</a></p>\n",
          "order": 0,
          "durationString": "1h"
        },
        "01-affinity-mapping": {
          "title": "Mapas de afinidad",
          "type": "read",
          "format": "self-paced",
          "duration": 15,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Un affinity map o un diagrama de afinidad es una herramienta que utilizamos para\norganizar lo que encontramos en la invesitagación buscando patrones. Para crear\nun affinity map debemos:</p>\n<ol>\n<li>Anotar en post-its las frases u observaciones más importantes que tuvimos en\nnuestras interacciones con usuarios y stakeholders</li>\n<li>Organzanizar estos post-its buscando patrones entre ellos</li>\n<li>Dar un nombre a las categorías</li>\n<li>Reagrupar si es necesario o desagrupar (buscar grupos más detallados o unir\n  grupos si es necesario)</li>\n</ol>\n<h2 id=\"tips\">Tips</h2>\n<ul>\n<li>Escribe solo lo que viste o escuchaste. No escribas tu interpretación de ello.</li>\n</ul>\n<p><img src=\"https://lh3.googleusercontent.com/W4YorPOV8lUXNsJB6eoTa6edXoeBeGO02AqhlSBRESpxFCCVO00jm0XMsSiNdjnxL3_Fuoof-nbmM8KxPBaYmkGuouWcyqvkZENIHTRO4QQDwQk4qSsRjNoZUECeePQpHxL_7zqwNqw\" alt=\"qué escribir\"></p>\n<ul>\n<li>Utiliza un color de post-it distinto por cada usuario. Te ayuda a darte cuenta\nsi varios usuarios dijeron lo mismo.</li>\n</ul>\n<p><img src=\"https://lh5.googleusercontent.com/wKAwSH3xHqQ-C592MAPbUVK63FxjIF78s3f9GKuSkNxOwj-Z7egwYY7Fs53o9oiM7DEWiBfEeB6TRAEfLKtbKquaPyXAwaA9pDzS_rY0l5Q9dxqTDIlkNzouTr-QaGbtZh3GFkpwLLI\" alt=\"color de post-its\"></p>\n<ul>\n<li>Etiqueta de acuerdo a los temas que ves, no a posibles soluciones.</li>\n</ul>\n<p><img src=\"https://lh4.googleusercontent.com/RrNG6Pm7betpfY_SBioLTBERD8tFPr98zQm5hWex-O1VGmRhvEjMS98TRRGAaZeGWosg72jdyDHXcifYpb_JnBW03gx8ntzEX3Pzicycg6xRfIMgx73wlm2-zM2ZLLRA7oLP1AqXOFQ\" alt=\"etiquetas\"></p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://www.nngroup.com/articles/affinity-diagram/\" target=\"_blank\">Affinity Diagramming for Collaboratively Sorting UX Findings and Design\nIdeas</a></li>\n<li><a href=\"http://library.ac4d.com/d/AC4D_designlibrary_Affinity_diagramming.pdf\" target=\"_blank\">Affinity diagramming</a></li>\n</ul>\n",
          "order": 1,
          "durationString": "15min"
        },
        "02-user-personas": {
          "title": "User personas",
          "type": "read",
          "format": "self-paced",
          "duration": 120,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/khLWLtxmMGM?cc_load_policy=1&cc_lang_pref=es",
              "id": "khLWLtxmMGM"
            },
            {
              "type": "video",
              "provider": "vimeo",
              "href": "https://vimeo.com/212958539",
              "id": "212958539"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/gAsoP9i2R_Q",
              "id": "gAsoP9i2R_Q"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/Ml92QEqE-RQ",
              "id": "Ml92QEqE-RQ"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/G7ljzXB40hw",
              "id": "G7ljzXB40hw"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Un User Persona es un personaje de ejemplo que representa al grupo de usuarios\nde tu producto. Se crea luego de haber realizado una investigación. Este\nartefacto es creado para entender mejor las metas, deseos y limitaciones de los\nprincipales grupos de usuarios de un producto. Además el User Persona es un\nproducto vivo que iremos actualizando según vamos conociendo mejor a nuestro\nusuario.</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/khLWLtxmMGM?cc_load_policy=1&amp;cc_lang_pref=es&amp;autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Hay que tener en cuenta que un User Persona es un arquetipo no un estereotipo.</p>\n<h2 id=\"qué-incluye-un-user-persona\">Qué incluye un User Persona</h2>\n<ol>\n<li>Nombre</li>\n<li>Foto</li>\n<li>Frase</li>\n<li>Información demográfica</li>\n<li>Escenario</li>\n<li>Frustraciones</li>\n<li>Necesidades / metas</li>\n</ol>\n<p><img src=\"https://lh5.googleusercontent.com/jBXLdsvtzd1grMS_Jw04O__5kN6K6nyPkXXQt0UBmwgS7mNCjFEIOdKUsdXx0vS_7UYF37pSYReRmB5CVLDfUKJ50RLUSfgpEE4zUUXIAuc_I4mUWtkGs_D8weQfRzUejxZ2WHSO8Ng\" alt=\"ejemplo de user persona\"></p>\n<p>Aquí otros ejemplos:</p>\n<p><img src=\"https://lh6.googleusercontent.com/IHbNO1auP8meG012DbRB1ojUMQmEnegcxvCxXT_ljCcWHwJnsX1cMqfU_eg6KOdU6LptcPzNXK-G8grfSBwhMaHakg_2OVBEAmk0xNO_brEoXxmAzUCw5GeVjofFdmkYIVg2Io-Ty0I\" alt=\"user persona\"></p>\n<p><img src=\"https://lh3.googleusercontent.com/Pdo4V0P6d_Kp1X-EOWVoEzpsynDJkdvDzSFNPtF5S4JrRhQn32wj5jI4OWJTlqhFoxzZWX51s42r7BKxm3YZjBFHqcfKx_AiOsgeQr67vDp_3gIseaXqIvHgKkTUp6OvdxhnZwjbV_4\" alt=\"user persona mailchimp\"></p>\n<h2 id=\"por-qué-son-importantes-los-user-personas\">Por qué son importantes los User Personas</h2>\n<p><a href=\"https://en.wikipedia.org/wiki/Alan_Cooper\" target=\"_blank\">Alan Cooper</a> nos cuente por qué son\nimportantes en este video:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://player.vimeo.com/video/212958539?title=0&amp;byline=0&amp;portrait=0\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<ul>\n<li><strong>Determinan qué debería hacer un producto y cómo debería hacerlo.</strong> Las metas\nde los User Personas sirven para tener una base en el diseño del producto.</li>\n<li><strong>Mejoran la comunicación con stakeholders, desarrolladores y otros\ndiseñadores.</strong> Los User Personas proveen un lenguaje común para discutir temas\nde diseño y mantienen al equipo centrado en los usuarios en cada etapa del\nproceso.</li>\n<li><strong>Crean consenso y compromiso con el diseño. Con un lenguaje común viene un\nentendimiento común.</strong> Los User Personas reducen la necesidad de crear modelos\nprogramáticos. Es fácil de entender todos los matices del comportamiento del\nusuario a través de la narrativa de que usan los User Personas.</li>\n<li><strong>Miden la efectividad del diseño.</strong> Las opciones de diseño pueden ser\ntesteadas en un User Persona, de la misma manera en la que pueden ser\npresentadas a un usuario real durante el proceso.</li>\n<li><strong>Contribuyen en otros esfuerzos relacionados al producto como marketing y\nventas.</strong> Ayudan en campañas de marketing, estructuras organizacionales y\ncentros de atención al cliente.</li>\n</ul>\n<h2 id=\"además-evitan-los-siguientes-casos\">Además evitan los siguientes casos</h2>\n<ul>\n<li><p><strong>Usuario elástico:</strong> cuando se tienen que tomar decisiones, el usuario se\nvuelve elástico. Ej. “A veces es power user, a veces es super tech, a veces no\nsabe nada de tech, a veces compra mucho por internet, otras no.”</p>\n</li>\n<li><p><strong>Diseño autoreferenciado:</strong> cuando diseñadores y desarrolladores proyectan\nsus propias metas, motivaciones, habilidades y modelos mentales en el diseño\ndel producto.</p>\n<p>Ej. Caso del rediseño del app de nike que eliminó una función que era muy\nutilizada por los usuarios: \"el correr por metas\"</p>\n<p><img src=\"https://lh6.googleusercontent.com/3sBkn4owUMKXrjvZE3uaB3vAxlj3cxGWBzJRrrlqs2PxtD4ZyavD_g6U04Q52wyBTexoW6HSUFjbjywn-qlGSHkHJedVr0bp6uECvH962N2LQ6SYdI3C8wpZuikyk20vMgEj0B-FcnY\" alt=\"caso nike\"></p>\n</li>\n<li><p><strong>Casos extremos:</strong> los user personas evitan diseñar para casos extremos\n(situaciones que probablemente no le sucedan a la mayoría de los usuarios).\nLos casos extremos no deberían ser el centro del diseño. Ej: crear un api para\ntu producto, agregar Bitcoin como medio de pago.</p>\n</li>\n</ul>\n<h2 id=\"otras-clasificaciones\">Otras clasificaciones</h2>\n<h3 id=\"user-persona-primario\">User Persona primario</h3>\n<p>Una primary persona es el target principal para diseñar el producto y su\ninterfaz.  El producto solo debería tener una persona primaria.</p>\n<h3 id=\"user-persoona-secundario\">User Persoona secundario</h3>\n<p>Una secondary persona, representa a un grupo de usuarios que estará satisfecho\ncon la mayor parte del producto creado para la persona primaria. Sin embargo,\nesta persona tiene otras necesidades adicionales que se pueden ir agregando al\nproducto de acuerdo al tiempo y costo del proyecto.</p>\n<h3 id=\"customer-persona\">Customer persona</h3>\n<p>Customer persona, representa las necesidades de personas que no necesariamente\nson usuarios, pero sí influyen al comprar un producto. Es clásico el ejemplo de\nlas personas que trabajan en el área de compras de alguna empresa, ellos son los\nencargados de pedir cotizaciones, de negociar, etc. sin embargo, no serán los\nusuarios finales de los productos que compran. Al tener a este tipo de personas,\nbuscamos entender sus necesidades, para así poder satisfacerlas, ya que su\nsatisfacción se verá reflejada en el éxito del producto.</p>\n<p>En este video de Udacity nos muestran un ejemplo de este tipo de personas:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/gAsoP9i2R_Q?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h3 id=\"served-persona\">Served persona</h3>\n<p>Served persona, representan las necesidades de personas que serán atendidas con\nun producto. Por ejemplo, si estamos trabajando en un aplicativo para tomar\npedidos en un restaurante, no solo tenemos que pensar en el mesero que utilizará\nel app sino también en los comensales a quienes se atenderá con este aplicativo.\n¿Qué pasa si el uso del aplicativo les restringe los cambios que pueden hacer\na su pedido? o ¿Si el uso del aplicativo hace más lenta la toma del pedido?</p>\n<h3 id=\"negative-persona\">Negative persona</h3>\n<p>Negative persona, representan a las personas para quienes NO irá dirigido el\nproducto. Por ejemplo, criminales, muchas veces tenemos que pensar en formas\nde evitar que personas con motivaciones negativas utilicen nuestros productos\ncomo un app bancaria o un app de chat encriptado.</p>\n<p><strong>IMPORTANTE: siempre debemos enfocarnos en resolver las necesidades de nuestro\nuser persona primario</strong></p>\n<p>Si no hubiera un usuario primario y tomaramos en cuenta las necesidades de todos\npasaría esto:</p>\n<p><img src=\"https://lh3.googleusercontent.com/S1NajGC6Evx_jz1kus1LZOwQKqB37qCkirRU6dRlAoKwyVlm82puazdQt0yOweADwaWDESX2TPAFHjLx_KamW_dmW9qU2gJ8c7-uLvmNpsgLF-4eaX1aEDQNcXCPD9mPJUE8ZpLM0Yw\" alt=\"auto para todos\"></p>\n<p>Sin embargo, si entendemos que los usuarios son distintos, con distintas\nnecesidades, podríamos llegar a soluciones como estas:</p>\n<p><img src=\"https://lh6.googleusercontent.com/tN3Y9d3hm1Kz-0edbykBmN8eiM0f3_dKGpmtgPX6pOeKlpj8rLZihBe44AXInvOLoWuzyuw6cqg_SzG_cfSFmjNH2RdzmWLEpfdTChYClM3iPeyHWFrEH6YZpKMrPQyY1zQnkzk_ONU\" alt=\"auto para cada uno\"></p>\n<h3 id=\"video\">Video</h3>\n<p>Si no tienes en cuenta quién es tu usuario real mientras creas un producto,\nte podrían pasar cosas como esta:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Ml92QEqE-RQ?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"http://www.uxbooth.com/articles/creating-personas/\" target=\"_blank\">Creating personas</a></li>\n<li><a href=\"https://blog.mailchimp.com/new-mailchimp-user-persona-research/\" target=\"_blank\">New MailChimp: User Persona Research</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2014/08/a-closer-look-at-personas-part-1/\" target=\"_blank\">A Closer Look At Personas: What They Are And How They Work</a></li>\n<li><a href=\"https://www.nngroup.com/articles/why-personas-fail/\" target=\"_blank\">Why personas fail</a></li>\n<li><a href=\"https://www.interaction-design.org/literature/article/personas-why-and-how-you-should-use-them\" target=\"_blank\">Personas a simple introduction</a></li>\n<li><a href=\"https://www.cooper.com/journal/2002/11/getting_from_research_to_perso\" target=\"_blank\">Getting From Research to Personas: Harnessing the Power of Data</a></li>\n<li><a href=\"https://www.cooper.com/journal/2001/08/perfecting_your_personas\" target=\"_blank\">Perfecting Your Personas</a></li>\n<li><a href=\"https://www.cooper.com/journal/2008/5/the_origin_of_personas\" target=\"_blank\">The origin of personas</a></li>\n<li><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/G7ljzXB40hw?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></li>\n</ul>\n",
          "order": 2,
          "durationString": "2h"
        },
        "03-customer-journey-maps": {
          "title": "Customer Journey Maps",
          "type": "read",
          "format": "self-paced",
          "duration": 15,
          "embeds": [
            {
              "type": "video",
              "provider": "vimeo",
              "href": "https://vimeo.com/168434099",
              "id": "168434099"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>El customer journey map, es una herramienta de Design Thinking que permite\nplasmar en un mapa, cada una de las etapas, interacciones, canales y elementos\npor los que atraviesa nuestro cliente desde un punto a otro de nuestro servicio.</p>\n<p>Los elementos necesarios para elaborar un buen customer journey map son los\nsiguientes:</p>\n<ul>\n<li>Personas</li>\n<li>Línea de tiempo (timeline)</li>\n<li>Emociones que sienten los clientes su experiencia de usuario</li>\n<li>Touchpoints o puntos de contacto</li>\n<li>Momentos</li>\n<li>Interacciones</li>\n</ul>\n<p><img src=\"https://lh4.googleusercontent.com/YVWF9L1-hQ-IKqL-CUVvelZSS9itA0jrTdOteNvvGk0JTAWefCRISryr3mWHcf0_0KdgEi6NZVOGGrNun7ySPWTIfo3BiC4jnULqJ60sMn3EieGmJBVw6_j867FjqwIZcN_PF7ybBpw\" alt=\"Ejemplo Journey Maps\"></p>\n<p>Mira esta forma distinta de mostrar un journey map en video:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://player.vimeo.com/video/168434099?title=0&amp;byline=0&amp;portrait=0\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://innokabi.com/claves-para-emocionar-a-tu-cliente-customer-journey-map/\" target=\"_blank\">El Mapa de Experiencia del Cliente o Customer Journey Map</a></li>\n</ul>\n",
          "order": 3,
          "durationString": "15min"
        },
        "04-user-stories": {
          "title": "User Stories",
          "type": "read",
          "format": "self-paced",
          "duration": 40,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Las historias de usuarios nos permiten pasar los problemas y oportunidad a ideas\nde mejora a funcionalidades o acciones concretas que debemos hacer para el\nusuario. Entender los “trabajos” que nuestro Producto o Servicio tiene que hacer\npara las personas.</p>\n<p>La forma más simple de una historia de usuario es esta: como <em>tipo de usuario</em>,\nquiero <em>función</em>, para poder <em>acción</em>.</p>\n<p>Si te fijas hay que indicar “tipo de usuario” por lo que para hacer éstas\nhistorias ya debemos tener claro quiénes son nuestros usuarios/personas y el\ncontexto en el que desarrollarán esta acción).</p>\n<h3 id=\"ejemplo\">Ejemplo</h3>\n<p>Si queremos mejorar la información de la red de Transantiago:</p>\n<p>Como un [extranjero en Santiago], quiero [conocer el itinerario y rutas de las\nmicros] para poder [moverme en transporte público sin perderme y pudiendo\nplanificar mis tiempos].</p>\n<h2 id=\"otras-formas\">Otras formas</h2>\n<p>También podemos añadirle más complejidad y en vez de pensar en la acción que\nquiere realizar el usuario, qué supondría el éxito de esa función.</p>\n<p>La historia tendría entonces este formato:</p>\n<p>“Como  <strong>[ usuario ]</strong> quiero <strong>[ función ]</strong> para alcanzar mi objetivo de\n<strong>[ objetivo del usuario ]</strong>. No poder hacer esto está causando\n<strong>[ efecto adverso ]</strong> para la organización. ”</p>\n<p>También podemos sustituir esa última frase por:</p>\n<p>“Permitir a los usuarios hacer esto entregaría <strong>[ valor medible específico ]</strong>\na la organización.”</p>\n<p>Este cambio en el formato de las historias de usuario ayuda a pensar en las\nhistorias que efectivamente creemos que van a tener un efecto en los objetivos\ndel negocio pero la idea fundamental es no perder de vista las funcionalidades y\ncontenidos que el usuario necesita para realizar la acción principal del sitio,\ny establecer cómo entregaremos esa propuesta de valor.</p>\n<h2 id=\"ejercicio\">Ejercicio</h2>\n<ul>\n<li>Piensa en una app para reservar hora médica en múltiples centros de atención.\nHaz las historias principales de reserva de hora. ( 20 minutos)</li>\n</ul>\n<p><em>¿Qué es lo primero que debemos hacer?</em></p>\n<p>Pensar en quién está realizando la acción y cuáles son los diferentes contextos.</p>\n<ul>\n<li>Usuario que tiene que ir a una revisión con un doctor específico.</li>\n<li>Usuario que necesita una hora urgente con el gastroenterólogo para llevar a su\nhijo.</li>\n<li>Usuario que quiere sacar hora para un examen para ir un día a mediodía cerca\nde su trabajo ( no pedir permiso).</li>\n<li>Usuario que necesita ir a un doctor, pero no sabe a cuál elegir que sea bueno.</li>\n</ul>\n<h3 id=\"historias-de-usuario\">Historias de usuario*</h3>\n<ul>\n<li><p>Como usuario que tiene una revisión con un doctor específico quiero un\nbuscador para poder llegar rápidamente a ver la disponibilidad del mi doctor\nen vez de explorarlos todos de una lista.</p>\n</li>\n<li><p>Como usuario que necesita una hora urgente quiero poder reservar la hora más\npróxima para que atiendan a mi hijo y saber cuanto antes qué le ocurre.</p>\n</li>\n<li><p>Como usuario que quiere sacar hora para un examen quiero poder buscar\ndisponibilidad por la hora en que me es conveniente para no tener que pedir\npermiso en el trabajo.</p>\n</li>\n<li><p>Como usuario que necesita ir al doctor necesito ayuda para decidir qué médico\nme es mejor para mi para sentirme seguro cuando me atiendan que estoy en\nbuenas manos.</p>\n</li>\n</ul>\n<p>De cada uno de éstos usuarios podemos pensar en varias historias de usuario que\ncomplementarán la forma en que tengo que entregar información a cada uno de ellos\ny dará forma a la estructura de navegación que deberé crear para responder a las\ndiferentes necesidades.</p>\n<p>Ahora, intenta crear más historias de usuario por tu cuenta.</p>\n<h2 id=\"referencias\">Referencias</h2>\n<ul>\n<li><a href=\"https://www.uxpin.com/studio/blog/write-smarter-user-stories-product-design-development/?utm_content=buffer8a567&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer\" target=\"_blank\">User Stories</a></li>\n</ul>\n",
          "order": 4,
          "durationString": "40min"
        },
        "05-ideation-prompts": {
          "title": "Ideation prompts",
          "type": "read",
          "format": "self-paced",
          "duration": 40,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Los ideation prompts son preguntas que nos permiten generar ideas. Su función\nprincipal es ayudarnos a pensar en cómo podemos solucionar el problema en el que\nestamos trabajando. Dos típicos ideation prompts son las preguntas de <code>How might we</code> (cómo podríamos) y de <code>what if</code> (qué tal si...).</p>\n<h3 id=\"hmw\">HMW</h3>\n<ul>\n<li>HMW (How Might We o Como podríamos) es un framework de design thinking que nos\nayuda a entender mejor los problemas y desarrollar mejores hipótesis.</li>\n<li>HMW son pequeñas preguntas que nos ayudan a pensar en soluciones a nuestros\n“problem statements”.</li>\n<li>HMW son lo suficientemente amplias que hay una amplia gama de soluciones, pero\nlo suficientemente estrechas que el equipo tiene algunos límites que lo ayudan\na idear soluciones.</li>\n</ul>\n<p>Algunos tips:</p>\n<ul>\n<li>Positivas</li>\n<li>Agnosticas de las soluciones</li>\n<li>No muy generales</li>\n<li>No muy específicas</li>\n</ul>\n<h3 id=\"what-if\">What if</h3>\n<p>Para las preguntas de What If podemos usar los siguientes tips:</p>\n<ul>\n<li>Agrega o elimina alguna parte a la experiencia: <code>¿Qué tal si nuestro usuario nunca tuviera que hacer check-in?</code></li>\n<li>Agrega a un nuevo actor: <code>¿Qué tal si toda la familia de nuestro usuario quisiera comer saludable?</code></li>\n<li>Toma ideas de otras industrias: <code>¿Qué tal si hacer check-in para un vuelo fuese como un juego?</code></li>\n</ul>\n",
          "order": 5,
          "durationString": "40min"
        },
        "06-presentations": {
          "title": "Presentaciones",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Así como el tipo de análisis que tendrás que hacer como UX Designer dependerá\ndel tipo de organización y los proyectos en los que trabajes, la formalidad y\nestructura de tu presentación también va a variar.</p>\n<h3 id=\"formales---stakeholders\">Formales - stakeholders</h3>\n<p>Un flujo para típico para este tipo de presentaciones es:</p>\n<h3 id=\"1--explicar-el-contexto-para-tu-audiencia\">1)  Explicar el contexto para tu audiencia</h3>\n<p>En esta sección, te debes enfocar en los objetivos de la investigación y en la\nmetodología utilizada, por ejemplo, qué estabas tratando de aprender sobre tus\nusuarios o tu producto, cuáles eran las principales preguntas de investigación\nque tuvo tu equipo, qué metodología usaste y por qué elegiste esa metodología.</p>\n<p>También, haz una breve descripción de los participantes: cómo los elegiste, de\ndónde venían, cuáles eran sus edades, cuáles eran sus comportamientos de compra,\nqué tan familiares son con el uso de tecnología, etc.</p>\n<h3 id=\"2-contar-los-detalles-de-lo-aprendido-durante-la-investigación\">2) Contar los detalles de lo aprendido durante la investigación</h3>\n<p>Haz una lista de cada patrón importante que observaste u oíste de tus usuarios.\nAsegúrate de apoyar las observaciones con data real: citas, videos, fotos o\nincluso data cuantitativa, si la tienes.</p>\n<h3 id=\"3-listar-las-recomendaciones-al-equipo\">3) Listar las recomendaciones al equipo</h3>\n<p>Esta parte es extremadamente importante porque el valor de la investigación es\nque sea accionable. Acá harás recomendaciones sobre cómo hacer cambios que\nmejorarán la usabilidad (y experiencia en general) para los usuarios.\nDependiendo de con quién trabajes, la gente puede ser o no receptiva a estos\ncambios, así que debes estar preparada para defender tu posición. Basa tus\nrecomendaciones en la data que tienes. Lo más importante es que no se trata de\nun tema personal (o que el diseñador que hizo las pantallas o el producto está\nmal). Trata siempre de hacer recomendaciones sobre el usuario y sus necesidades.\nNo es nada personal dirigido hacia el diseñador o desarrollador o hacía el\nproduct manager.</p>\n<p>Como sabes, la investigación es cíclica, así que también puedes hacer\nrecomendaciones para futuros estudios en los que podría enfocarse el equipo.</p>\n<hr>\n<p>En resumen:</p>\n<ul>\n<li>Sustenta tus insights y recomendaciones con hechos y data de las entrevistas.\nAsegúrate que tus recomendaciones estén alineadas con las observaciones y data\nque presentaste. Luego de revisar los hallazgos de tu presentación, las\nrecomendaciones no deberían ser sorpresivas para el equipo.</li>\n<li>Recuerda enfocarte en los hallazgos más importantes. No vas a tener tiempo de\ndiscutir absolutamente todo, pero sí puedes incluir un apéndice al final con\nalgunos hallazgos secundarios.</li>\n<li>Algunas veces las investigaciones levantan más preguntas que respuestas, y\neso está bien. Una vez que empiezas a desenterrar desafíos de usuarios,\nempezarás a hacerte preguntas o a probar nuevas soluciones. Deberías hacer\nrecomendaciones sobre cómo continuar a una segunda ronda de investigación para\nresponder algunas de estas preguntas. Quizá puedas hacer recomendaciones para\nponer a prueba nuevamente el prototipo o diseño una vez que el equipo ha hecho\nalgunos de los cambios recomendados.</li>\n</ul>\n<h3 id=\"presentaciones-informales\">Presentaciones informales</h3>\n<p>Ahora vamos a pasar a algunas ideas para presentaciones menos formales o\nestructuradas. Todos estos ejemplos son del Equipo de Investigación de Facebook\nsobre cómo mantener las presentaciones frescas e interesantes. Hacer que tus\nstakeholders miren el mismo formato de PowerPoint o reporte una y otra vez los\naburrirá, y tus presentaciones tendrán menos impacto con el tiempo.</p>\n<p>Algunos ejemplos creativos que podrías aplicar:</p>\n<ul>\n<li>Muestra videos de las entrevistas con usuarios. Esta es una forma súper\nimpactante de mostrar algo del feedback de primera mano a stakeholders que no\npudieron atender a las entrevistas. (La primera foto muestra cómo hicieron una\n\"noche de películas\" en Facebook para compartir algunos hallazgos de\ninvestigación. Incluso sirvieron canchita!)</li>\n<li>Zambullida Profunda - Elige algunos usuarios con los que hablaste y crea\nretratos de ellos, incluyendo qué les importa, cuáles son sus desafíos, y\nalgunas citas clave.</li>\n<li>Crea un mini-museo con algunos de los hallazgos o aprendizajes principales, y\nfacilita la discusión con algunas \"preguntas de partida\" en las que deben\npensar tus stakeholders, y para discutir luego de ver alguno de los\n\"artefactos\" del museo (Vean la segunda foto para tener un ejemplo).</li>\n<li>Haz un poster o infografía con los hallazgos principales (Facebook llama a\nesto el método análogo - imprime tus hallazgos principales y ponlos en algún\nlugar de la oficina donde puedan ser vistos).</li>\n</ul>\n",
          "order": 6,
          "durationString": "1h"
        },
        "07-storytelling": {
          "title": "Storytelling",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/1rMnzNZkIX0",
              "id": "1rMnzNZkIX0"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/ufdvYrTeTuU?cc_load_policy=1&cc_lang_pref=es",
              "id": "ufdvYrTeTuU"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Mira este video sobre qué es storytelling (recuerda activar los subtítulos):</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/1rMnzNZkIX0?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Como dicen en el video todos queremos escuchar historias y todos sabemos contar\nhistorias. ¿No estás segura? Júntate con tus compañeras de mesa y hagan este\nejercicio:</p>\n<p>La primera crea una oración que empiece con \"había una vez\". Luego la segunda,\ncomplementa empezando la siguiente oración con \"y todos los días\", y así hasta\nque usen todas las siguientes frases o algunas adicionales que quieran probar:</p>\n<ul>\n<li>Habia una vez ...</li>\n<li>Y todos los días ...</li>\n<li>Hasta que un día ...</li>\n<li>Debido a eso ...</li>\n<li>Y debido a eso ...</li>\n</ul>\n<p>Para terminar utilicen las siguientes frases:</p>\n<ul>\n<li>Hasta que finalmente ...</li>\n<li>Y desde ese día ...</li>\n<li>Y el aprendizaje es ...</li>\n</ul>\n<p>Con este ejercicio te darás cuenta que todos somos buenos para contar historias.\nHemos nacido con esa capacidad y es algo que hacemos todos los días.</p>\n<p>Pero, ¿cómo podríamos utilizar esa capacidad que tenemos para enganchar a\nnuestros usuarios y clientes?</p>\n<h2 id=\"crea-una-historia\">Crea una historia</h2>\n<p>\"La narrativa es como esculpir, donde tienes que ir tallando hasta que revelas\nalgo hermoso.\" Esta es una cita de la clase de narrativa de IDEO.</p>\n<p>La idea principal aquí es que para una buena narrativa no tienes que revelar las\npartes más importantes de la historia desde el inicio. Debes generar expectativa\npara lo más importante e ir enganchando a tu audiencia desde el principio.</p>\n<p>Algunos consejos de técnicas narrativas que deberían servirles al pensar en cómo\ncontar la historia de lo que han aprendido durante el proyecto:</p>\n<ul>\n<li>Abre con un inicio fuerte, una apertura que intrigue a tu público</li>\n<li>Enfócate en una historia real de un usuario con el que hablaste. Puedes llamar\nal usuario por su nombre. Cuáles son sus necesidades?. Cuáles son sus pain\npoints o molestias, desafíos en el proceso?. Por ejemplo: \"Conozcan a\nSandra, una madre soltera, que trabaja largos turnos de mantenimiento en la\nuniversidad y necesita un medio fácil para pagar sus deudas online.\"</li>\n<li>Trata de concentrarte en la audiencia con quién estás hablando y encontrarás\nformas de conectar tus historias con sus desafíos. Esto te ayudará a construir\nempatía si las historias son identificables.</li>\n<li>Trata de hacer todo lo más visual posible. Como se dice, una imagen vale más\nque mil palabras. Imágenes de tus usuarios ayudarán a tu audiencia a entender\nde lo que estás hablando.</li>\n</ul>\n<p>Algunos consejos adicionales:</p>\n<ul>\n<li>Crea expectativa para la parte más importante de la historia - como la cita\nque vimos de IDEO - no cuentes la mejor parte de la historia al inicio.</li>\n<li>Haz recomendaciones y anima a tus stakeholders a tomar acción en base a los\ninsights que has encontrado.</li>\n<li>Apoya tus puntos con data real de las entrevistas con usuarios citas, videos,\nfotos, etc.</li>\n<li>Termina tu historia con una de las partes más importantes: Tu audiencia\ndebería irse con un sentido claro de lo que deben hacer con esta información.</li>\n</ul>\n<p><em>“Crear conciencia en las historias se trata de desencadenar reacciones\nemocionales. Alegría 😀, sorpresa 😯, tristeza 😟, ira 😡, miedo 😱,\ndisgusto 😖.”</em></p>\n<h2 id=\"una-plantilla\">Una plantilla</h2>\n<p>Puedes usar esta plantilla para ayudarte a crear la historia que quieres contar</p>\n<p><img src=\"https://lh4.googleusercontent.com/kxUw1gkoNNlIh476EiMYF91faz2t1mKI5ukBq8qlK_s41AN_QZR8zNFdaFmKsiMq9pHL5AkvGSRBCWAjzrzY1hAbM9rpAss0O_duRvy8FmP-84BSBjW-ikV_5kHvnBCsmL03cskH_cc\" alt=\"plantilla para contar una historia\"></p>\n<h2 id=\"otro-video-sobre-storytelling\">Otro video sobre Storytelling</h2>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/ufdvYrTeTuU?cc_load_policy=1&amp;cc_lang_pref=es&amp;autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"referencias\">Referencias</h2>\n<p><a href=\"https://www.khanacademy.org/partner-content/pixar/storytelling\" target=\"_blank\">Storytelling Khan Academy</a></p>\n",
          "order": 7,
          "durationString": "1h"
        }
      },
      "order": 3,
      "stats": {
        "duration": 410,
        "durationString": "6.8h",
        "exerciseCount": 0,
        "partCount": 8
      }
    },
    "04-business-problem-understanding": {
      "title": "Entendimiendo del negocio: entendimiento del problema de negocio",
      "bonus": false,
      "description": "<p>En este curso formarás el mindset de negocios necesario para ser una exitosa\nUX Designer debe tener.</p>\n",
      "parts": {
        "00-business-basics": {
          "title": "Introducción a los negocios",
          "type": "read",
          "format": "self-paced",
          "duration": 120,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/Gt-rwCUWfqw",
              "id": "Gt-rwCUWfqw"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/rr4g-JxGQoM",
              "id": "rr4g-JxGQoM"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/IrcP_IQuYk4",
              "id": "IrcP_IQuYk4"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/VmPTQk5LVlc",
              "id": "VmPTQk5LVlc"
            },
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/94bee9d273224ec89c5c62497b0fa202",
              "id": "94bee9d273224ec89c5c62497b0fa202"
            },
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/9f176c2b948a4b4b8318b5cec8c31b78",
              "id": "9f176c2b948a4b4b8318b5cec8c31b78"
            },
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/517a6902bca84a57bebed48c7b751a00",
              "id": "517a6902bca84a57bebed48c7b751a00"
            },
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/d01b726ae01a4f58a0186ae73bbf0610",
              "id": "d01b726ae01a4f58a0186ae73bbf0610"
            },
            {
              "type": "video",
              "provider": "vimeo",
              "href": "https://vimeo.com/94950270",
              "id": "94950270"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?time_continue=580&v=Lb4IcGF5iTQ",
              "id": "Lb4IcGF5iTQ"
            }
          ],
          "body": "<h2 id=\"intro-a-los-negocios-y-al-mundo-digital\">Intro a los negocios y al mundo digital</h2>\n<h3 id=\"por-qué-una-uxd-tiene-que-saber-de-negocios-y-tecnología\">Por qué una UXD tiene que saber de Negocios y Tecnología</h3>\n<p>Te lo explicamos con dos gráficos muy parecidos.</p>\n<p>El primero nos dice que un producto digital exitoso es una mezcla de Diseño,\nTecnología y Negocios.</p>\n<p><img src=\"https://lh4.googleusercontent.com/EigZnNr6llXzx9v0DIxDObubSES4CVDyppnIBFjEfZNFJnFPGndJwoCjdY_Tozs6WO1LrJ42ee90hGSZRq8OcJZF_N4FVd_Uq0JOEQd7aNirYm8P_POSItcjhKDMuCx0iaKStFo7S84\" alt=\"succesul product\"></p>\n<p>El segundo gráfico del libro <a href=\"https://www.amazon.com/About-Face-Essentials-Interaction-Design/dp/1118766571/ref=sr_1_1?ie=UTF8&amp;qid=1517959313&amp;sr=8-1&amp;keywords=aboutface\" target=\"_blank\">AboutFace</a>\nva un poco más allá y nos dice que un producto exitoso tiene que ser deseable\n(diseño), viable (negocios) y posible (tecnología).</p>\n<p><img src=\"https://lh3.googleusercontent.com/5264A7D9H-6W5lKlReph2ljW4gpP4BbyO9ufbS_WzI2EfZdaympBnt-ZIITXOgqbLj8K_88vLLQKZdfhymI4y7HzXAXrBNkfHSmMlRXkKQ6CcYUNT77jqpM7hve3apOpKtLEEdsn414\" alt=\"overall product success\"></p>\n<p>Un producto no será exitoso si es que tiene pérdidas económicas para una\nempresa. Por otro lado, si un producto no es factible de ser construido por el\nequipo técnico de una empresa, este no verá la luz nunca. Y por último, si una\nempresa construye un producto sin pensar en el usuario, es posible que no sea\nexitoso tampoco.</p>\n<p>El libro nos da unos ejemplos adicionales (que están cambiando/actualizándose):</p>\n<ul>\n<li>Apple: en sus primeras décadas, se enfocaba solo en la experiencia de sus\nusuarios, sin pensar mucho en el lado de negocio. Finalmente, sobrevivió por\nla lealtad de sus usuarios.</li>\n<li>Microsoft: por muchos años fue una compañía muy enfocada en los negocios. Pero\nno logró hacer que sus productos sean \"deseables\" por los usuarios. Lo que le\ndio pie a otras empresas de abrirse campo en el mercado (como Apple).</li>\n<li><a href=\"https://es.wikipedia.org/wiki/Novell\" target=\"_blank\">Novell</a>: fue una empresa que se dedicó\nmucho a la tecnología y que sin poder lograr tener un modelo de negocio\nexitoso, terminó cerrando.</li>\n</ul>\n<p>Es por eso que buscamos que todas las UX Designers de Laboratoria conozcan un\npoco de cada una de estas disciplinas.</p>\n<p>De todos modos, como te estarás preguntando, en algunos casos el componente de\ndiseño es mayor, en otros el de tecnología y en otros el de negocio. Como\nmuestra este gráfico (puedes leer más en este <a href=\"https://uxdesign.cc/the-evolution-of-ux-challenges-5e1748b82ede\" target=\"_blank\">artículo</a>):</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*HlaP27dGpKAqFbWm8-kBOQ.png\" alt=\"distintos pesos en ux,business y tech\"></p>\n<p><a href=\"https://medium.com/@gorilas/los-tres-factores-del-%C3%A9xito-de-un-producto-digital-12f600f4e2e8\" target=\"_blank\">Aquí un artículo adicional que habla sobre estos 3 aspectos</a></p>\n<p>Antes de empezar a hablar de negocios, hablaremos de las empresas en las que\ntrabajaremos y luego conoceremos un poco más de c/u de sus negocios.</p>\n<h3 id=\"cuáles-son-los-4-tipos-de-empresas-en-las-que-trabajaremos\">Cuáles son los 4 tipos de empresas en las que trabajaremos</h3>\n<p>Cómo ya te hemos mencionado en distintas charlas, al salir de Laboratoria\nentrerás a trabajar en alguna organzación de estas categorías:</p>\n<ol>\n<li>Fábrica de Software</li>\n<li>Agencia de Marketing (Digital)</li>\n<li>Empresa de Transformación Digital</li>\n<li>Startup</li>\n</ol>\n<h3 id=\"qué-es-una-compañía-y-qué-es-una-startup\">Qué es una compañía y qué es una startup</h3>\n<p>Mira este video:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Gt-rwCUWfqw?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h3 id=\"5-razones-que-hacen-del-mundo-digital-un-gran-recurso-para-la-innovación\">5 razones que hacen del mundo digital un gran recurso para la innovación</h3>\n<ul>\n<li>Velocidad y bajo costo de experimentación</li>\n<li>Disponibilidad y calidad de analytics</li>\n<li>Escalabilidad</li>\n<li>Relación con el cliente</li>\n<li>La facilidad de colaborar con otros</li>\n</ul>\n<h3 id=\"cómo-trabajan-las-startups-empresas-o-equipos-de-producto-ahora\">Cómo trabajan las startups, empresas o equipos de producto ahora</h3>\n<p>Los equipos de producto dentro de empresas o algunas startups que siguen viendo\na la startup como una versión pequeña de una compañia están trabajando de esta\nmanera:</p>\n<h4 id=\"estrategia\">Estrategia</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/rr4g-JxGQoM?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h4 id=\"procesos\">Procesos</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/IrcP_IQuYk4?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h4 id=\"organización\">Organización</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/VmPTQk5LVlc?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h4 id=\"cómo-les-afecta-trabajar-de-esta-manera\">Cómo les afecta trabajar de esta manera</h4>\n<p>Porque toman mucho tiempo y dinero en cosas que es probable no resultan (y sobre\ntodo sin conocer a sus usuarios).</p>\n<h3 id=\"qué-están-haciendo-las-empresas-que-sí-están-ganando-en-digital\">Qué están haciendo las empresas que sí están ganando en digital</h3>\n<p>Las empresas que están liderando el mundo digital están siguiendo estas 4\nestrategias:</p>\n<h4 id=\"adoptar-la-experimentación\">Adoptar la experimentación</h4>\n<p>En lugar de apostar millones de dólares en soluciones que no llegan a tener\ntracción, los líderes de hoy están apostando por procesos de desarrollo\niterativos, basados en la experimentación.</p>\n<p>Puedes ver un video más detallado <div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/94bee9d273224ec89c5c62497b0fa202\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div>.</p>\n<h4 id=\"innovar-abiertamente\">Innovar abiertamente</h4>\n<p>Líderes de hoy están abiertos a poner en las manos de terceros la capacidad de\ncrear propuestas de valor.</p>\n<p>Puedes ver un video más detallado <div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/9f176c2b948a4b4b8318b5cec8c31b78\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div>.</p>\n<h4 id=\"diseñar-productos-basados-en-data\">Diseñar productos basados en data</h4>\n<p>Las empresas que ganan en digital tienen la capacidad de convertir data en\nconocimiento y utilizar ese conocimiento para diseñar mejores experiencias e\nimpulsar el negocio.</p>\n<p>Puedes ver un video más detallado <div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/517a6902bca84a57bebed48c7b751a00\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div>.</p>\n<h4 id=\"integrar-canales\">Integrar canales</h4>\n<p>Las empresas que ganan en digital reconocen que sus usuarios exigen que la\nexperiencia a través de canales sea consistente, integrada y fluida.</p>\n<p>Puedes ver un video más detallado <div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/d01b726ae01a4f58a0186ae73bbf0610\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div>.</p>\n<h3 id=\"el-factor-de-la-cultura-en-las-empresas-actuales\">El factor de la cultura en las empresas actuales</h3>\n<p>Todas estas estrategias y cambios que ha traido la tecnología a los negocios,\nvienen acompañados también de un cambio en la cultura y organización en las\nempresas. Para eso miremos lo que nos cuentan en Spotify y Facebook sobre eso.</p>\n<h4 id=\"spotify\">Spotify</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://player.vimeo.com/video/94950270?title=0&amp;byline=0&amp;portrait=0\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<p>Las cosas que se rescatan de este video son:</p>\n<ul>\n<li>Los cambios más relevantes suceden cuando hay una cultura que promueve la\nexcelencia y la confianza.</li>\n<li>Tienen procesos para documentar el aprendizaje<ul>\n<li>Retrospectivas (aprender de los errores)</li>\n<li>Improvement boards (tomar acción y corregir)</li>\n</ul>\n</li>\n<li>Tienen mecanismos para minimizar el riesgo<ul>\n<li>Limited blast radius</li>\n<li>Tener control end-to-end</li>\n</ul>\n</li>\n<li>Actividades para promover la cultura<ul>\n<li>Training</li>\n<li>Hiring</li>\n<li>Storytelling</li>\n<li>Desarrollar \"role models\"</li>\n</ul>\n</li>\n</ul>\n<h4 id=\"facebook\">Facebook</h4>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Lb4IcGF5iTQ?time_continue=580&amp;autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Las cosas que se rescatan de esta entrevista son:</p>\n<ul>\n<li>Las empresas son organismos que aprenden, si NO están aprendiendo\nconstantemente, entonces no están evolucionando y se están quedando atrás.</li>\n<li>Una empresa puede decidir aprender rápido o aprender lento. Si estás sacando a\nproducción un proyecto que demora 1 año, entonces estás aprendiendo una vez al\naño. Si por el contrario, sacas pequeños \"releases\" cada 2 semanas, tu ritmo\nde aprendizaje será constante.</li>\n<li>Se trata de volver al método científico, donde se plantea una hipótesis, se\nrealiza un experimento y se verifica si estabas en lo cierto o no. Y de ello\nproviene nuevamente otra hipótesis.</li>\n<li>Hay más de 10k versiones de facebook a la vez, dado que los ingenieros tienen\nla autoridad de correr sus experimentos cuando a ellos les convenga y medirlos\npara ver si funcionarán o no.</li>\n</ul>\n",
          "order": 0,
          "durationString": "2h"
        },
        "01-business-models": {
          "title": "Modelo de Negocios",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "embeds": [
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=QoAOzMTLP5s",
              "id": "QoAOzMTLP5s"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://youtu.be/IP0cUBWTgpY",
              "id": "IP0cUBWTgpY"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=oOAhXOSMVIc",
              "id": "oOAhXOSMVIc"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=8wU6s5f3t0w",
              "id": "8wU6s5f3t0w"
            },
            {
              "type": "video",
              "provider": "youtube",
              "href": "https://www.youtube.com/watch?v=Dqakc-VuKjs",
              "id": "Dqakc-VuKjs"
            }
          ],
          "body": "<h2 id=\"intro-a-modelos-de-negocios\">Intro a Modelos de Negocios</h2>\n<p>El primer paso para entender a los que serán nuestros clientes como Diseñadoras\nUX es entender porqué las empresas existen. Todas empresas existen con un fin,\nun fin que tiene que ver con el negocio que hay detrás, el objetivo que hay\ndetrás de lo que quieren que haga el usuario final, y que les supone un\nbeneficio y suele estar asociado con sus ganancias monetarias.</p>\n<p>Sin un modelo de negocio, o si éste no está bien resuelto, no tendrían\nganancias, y sin ganancias tendrían que cerrar sus puertas. Lo mismo ha pasado\ncon las empresas que no han sabido adaptar su modelo de negocio a los nuevos\ntiempos (por ejemplo BlockBuster, o Kodak).</p>\n<h2 id=\"qué-es-un-modelo-de-negocios\">Qué es un modelo de negocios</h2>\n<p>Es cómo una empresa crea valor para sí misma mientras entrega productos o\nservicios para sus clientes.</p>\n<p>Saber y entender la existencia de Modelos de negocios, te van a ayudar a abrir\ntu mente a muchas formas de ver o plantear una idea y no sólo eso, sino llevarla\na cabo y entender todos los factores relacionados para ello.</p>\n<p>Y al momento de trabajar para una empresa, esto te va a ayudar a entender para\nquién trabajas, dónde estás parada y hacia donde debes ir. Pero no sólo eso,\nsino entender si lo que estás proponiendo es factible.</p>\n<p>La intención de entender el contexto de la empresas y sus objetivos de negocio\nes para estar en sincronía con la empresa y así, lo que se quiera hacer o\nproponer esté alineado con sus objetivos, canales, partners, actividades, etc.</p>\n<p>Algunas empresas y startups usan una herramienta llamada Business Model Canvas.</p>\n<h2 id=\"business-model-canvas\">Business Model Canvas</h2>\n<p>El BMC es una herramientas con la cual vamos a contextualizar nuestra propuesta\nde valor y ver la “big picture”. Nos va a llevar a un entendimiento más completo\nde todos los factores que intervienen en el negocio de la empresa.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/800/1*tbwlCEiKyXVEdSM6X74kmA.jpeg\" alt=\"BMC\"></p>\n<p>Está dividido en secciones específicas, las cuales te van a orientar a que\naterrices una serie de elementos importantes a considerar como: propuesta de\nvalor, relaciones con los clientes, segmentos de los clientes, canales de\ndistribución, actividades clave, recursos clave, socios clave, estructura de\ncostos y flujos de ingresos o ganancias.</p>\n<p>Te recomiendo ver los siguientes videos enlazados para entender de manera visual\nlo anterior, así como podrás ver algunas aplicaciones.</p>\n<p>Videos para profundizar o ejemplificar:\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/QoAOzMTLP5s?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div> -\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/IP0cUBWTgpY?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<p>Mira estos ejemplos:\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/oOAhXOSMVIc?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div> -\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/8wU6s5f3t0w?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div> -\n<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Dqakc-VuKjs?autoplay=0\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"true\"></iframe></div></p>\n<h2 id=\"¿satisface-una-necesidad-o-la-genera\">¿Satisface una necesidad o la genera?</h2>\n<p>Es interesante analizar y tener en mente si lo que vamos a diseñar es un\nproducto que <em>satisface</em> o <em>genera</em> una necesidad, esto nos da una perspectiva\nclara de hacia dónde debe ir orientado nuestro mensaje.</p>\n<p><img src=\"https://image.ibb.co/bRMOjJ/need.jpg\" alt=\"necesidad o deseo\"></p>\n<h2 id=\"scope-canvas\">Scope canvas</h2>\n<p>Como UX Designers, necesitamos entender el modelo de negocio de la empresa en\ngeneral y específicamente entender los objetivos y metas del área que nos\ncontrata y del proyecto que quieren que hagamos: cómo lo ligamos a las\nnecesidades de los usuarios y las métricas del proyecto que tenemos entre manos.</p>\n<p>El Scope Canvas está inspirado en el BMC con el objetivo de conectar las\nnecesidades de los usuarios con los objetivos de negocio de la organización.</p>\n<p>El Scope Canvas, como tal, es una manera visual de ordenar los conceptos\nbásicos. Nos ayuda a tener siempre en mente y presentes las motivaciones,\nnecesidades, objetivos y dolores del usuario a la hora de aterrizar el proyecto\nUX.</p>\n<p><img src=\"https://image.ibb.co/hO4CBy/scope_canvas_es.png\" alt=\"scope canvas\"></p>\n<p>Te recomiendo ver el siguiente link donde podrás saber de primera fuente acerca\ndel SC - <a href=\"http://scopecanvas.com/#main\" target=\"_blank\">scope canvas</a></p>\n<p>Recuerda que la práctica hace a la maestra, ahora tienes estas herramientas con\nlas que puedes comenzar y practicar para ver desde el mundo de las empresas.</p>\n",
          "order": 1,
          "durationString": "1h"
        },
        "02-business-objectives": {
          "title": "Objetivos de Negocio",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"objetivos-de-negocio\">Objetivos de negocio</h2>\n<p>Además de tener un objetivo como empresa y una propuesta de valor que es la que\nhace que los usuarios los prefieran, hay objetivos relacionados al proyecto que\nnos piden trabajar.</p>\n<p>Debemos pensar que aún cuando la empresa tiene sus propios objetivos, estos\ndeben ser bajados y alineados con el servicio o productos que decidan lanzar al\nmercado. Estos objetivos deben ser cuidados y medidos a lo largo de la vida de\nun producto/servicio.</p>\n<p>Este proyecto/pducto/servicio a lanzar, suele ser algo más específico y en\nocasiones la empresa, el área o la persona puede tenerlo claro o no. Hay\nclientes que nos contratan para que hagamos una APP, pero no han pensado para\nqué la quieren. Si no supieran para qué necesitan una app podemos indagar,\npreguntarles qué les gustaría que se sucediera a partir de que esa app fuera\ndescargada y usada por sus usuarios. También podemos hablar con los usuarios\npara ver qué tareas buscan hacer con esa empresa y si algunas de ellas sería\nbuena idea poder resolverlas desde un celular, para luego pensar si una app o\nuna web mobile es la mejor idea.</p>\n<p>La idea es que al realizar un proyecto, nosotras tengamos en mente dos cosas:</p>\n<ul>\n<li>Objetivos de negocio (que van de la mano al modelo de negocio)</li>\n<li>Objetivos de usuario</li>\n</ul>\n<p>Porque vamos a ser las encargadas de dirigir la solución hacia el área de\narmonía entre ambos. O sea, que se cumpla lo que quiere la empresa y que se\ncumpla lo que necesita el usuario de nuestra propuesta.</p>\n<h2 id=\"existen-diferentes-objetivos-dentro-del-negocio\">Existen diferentes objetivos dentro del negocio</h2>\n<p><img src=\"https://image.ibb.co/b2KwpJ/modelobj.png\" alt=\"model objectives\"></p>\n<p>Los principales objetivos de un negocio: vender más, tener más retención, bajar\nlo que les cuesta tener un nuevo cliente, vender a más usuarios, vender por más\n$$ el pedido, disminuir costos operativos, aumentar el margen de ganancias,\ndisminuir cantidad de contactos al call center &gt; menos personal &gt; menores\ngastos + satisfacción del cliente. Satisfacción del cliente = menor gasto en\natención post venta = más ventas etc.</p>\n<p>Existen muchos, y estos varian según la empresa o el producto en el que estás.\nTe recomendamos que al ingresar a una plataforma o profucto, lo primero que\nhagas sea preguntarte sobre los objetivos de negocio a los cuales ellos están\naspirando; y así comenzarás a hacer ojo para detectarlos y poder cuidarlos.</p>\n",
          "order": 2,
          "durationString": "1h"
        },
        "03-business-immersion": {
          "title": "Inmersión en el problema / oportunidad",
          "type": "read",
          "format": "self-paced",
          "duration": 60,
          "body": "<h2 id=\"entendimiento-del-problema\">Entendimiento del problema</h2>\n<p>Antes de comenzar a trabajar un proyecto de UX es importante saber tres cosas\nimportantes por parte del cliente:</p>\n<ul>\n<li>¿Cuál es el objetivo de negocio?</li>\n<li>¿Cuál es el contexto de uso del producto?</li>\n<li>¿Cuáles son los objetivos del usuario?</li>\n</ul>\n<p>Esto te va a ayudar a tener una clara idea de hacia dónde debes de ir, qué es lo\nque se espera, la información que necesites va a ir encaminada hacia ese\nentendimiento.</p>\n<p>Por ejemplo: En una E-commerce el problema es que no hay muchos suscriptores\ncomo visitantes de la página. Aparentemente ese el el problema, pero indagando\nmás, te puedes dar cuenta que al momento de hacer login, la validación de un\ndato es incorrecta y por ello no se ha podido completar la suscripción.</p>\n<p>A veces tenemos un problema, pero la solución no es tan evidente. Para\ndetectarlo debemos ir más a fondo en la búsqueda. Quizá el ‘problema’ sólo es un\nefecto de algo más grande.</p>\n<p>Saber cuál es el contexto de uso y los objetivos del usuario te va a dar\nclaridad sobre la situación del cliente, hacia dónde quiere ir, por qué pasos\npasa para lograrlo y detectar en esos pasos problemas.</p>\n<h2 id=\"project-scoping\">Project scoping</h2>\n<p>Es el ámbito de las características y funciones que caracterizan a un producto.\nPero antes debemos preguntarnos: ¿qué son las características o funciones de un\nproducto?</p>\n<p>Son todas aquellas funcionalidades que nos permite realizar acciones.\nActualmente, estamos inmersos en productos repletos de funcionalidades\nincreíbles, sin embargo estás cuando no tienen un contexto o relación completa\ncon el usuario, se quedan como funcionalidades.</p>\n<p>Por eso, a través de User scenarios, podemos pensar en una funcionalidad y todo\nlo que implica o se relaciona con un usuario para así enriquecerla y darle un\nsentido.  Y es como a través de Project scoping podemos darle contexto y\ndimensión al ámbito del proyecto en término de sus funcionalidades o features.</p>\n<p>Aquí es así que podemos comenzar a dimensionar los productos o proyectos en\ntérmino de sus features contextualizados, tiempos, costos y recursos.</p>\n<h2 id=\"stakeholder-identification\">Stakeholder identification</h2>\n<p>Los stakeholders son todas aquellas persona relacionadas con tu producto en\ncualquier ámbito. Por esa razón, este punto es muy importante porque tu producto\ndebe escuchar distintas voces a lo largo de su vida útil. Y saber quiénes son,\ndesde el principio te de una base sólida para que lo que vas a diseñar satisfaga\ntodas esas necesidades o encuentre un punto de equilibrio para hacerlo.\nCuando los stakeholders están contentos, se dice que el producto es exitoso.</p>\n",
          "order": 3,
          "durationString": "1h"
        }
      },
      "order": 4,
      "stats": {
        "duration": 300,
        "durationString": "5h",
        "exerciseCount": 0,
        "partCount": 4
      }
    },
    "05-product-metrics": {
      "title": "Entendimiendo del negocio: métricas de producto",
      "bonus": false,
      "description": "<p>...</p>\n",
      "parts": {
        "00-vanity-metrics": {
          "title": "Métricas vanidosas",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "embeds": [
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/93c7745cdd1f4120bf1430696208960b",
              "id": "93c7745cdd1f4120bf1430696208960b"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Muchas veces en los productos digitales medimos algunas cosas que nos hacen\ncreer que nuestro producto es exitoso cuando en realidad no lo es.</p>\n<p>Mira el siguiente video de Laboratoria Corporate Training para entender un poco\nmás sobre métricas vanidosas y aprende cómo no caer en ellas.</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/93c7745cdd1f4120bf1430696208960b\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n",
          "order": 0,
          "durationString": "30min"
        },
        "01-conversion-funnels": {
          "title": "Embudos de conversión",
          "type": "read",
          "format": "self-paced",
          "duration": 20,
          "embeds": [
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/dabcdc1789374cea928fb8fa2cd369a8",
              "id": "dabcdc1789374cea928fb8fa2cd369a8"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Para que un usuario se \"convierta\" o que llegue a hacer la tarea que buscamos,\npasará por una serie de fases. Todos nuestros usuarios empezarán en la fase 1,\nsin embargo, no todos llegarán hacía el final. Solo algunos cuantos llegarán\na convertirse. Toda esta trayectoria de los usuarios hacía la conversión se\nllama el conversion funnel o embudo de conversión.</p>\n<h3 id=\"conversion-funnel-embudo-de-conversión\">Conversion Funnel (embudo de conversión)</h3>\n<p>El embudo de conversión junta una serie de métricas que nos permiten ir midiendo\ncómo va nuestra conversión y poder identificar dónde estamos teniendo problemas\nque podemos solucionar en busca de una mayor conversión.</p>\n<p>A las fases del embudo de conversión también las llaman métricas piratas, porque\nsu acrónimo se lee \"AAARRR\": awareness, acquisition, activation, revenue,\nretention y referral.</p>\n<p>Mira el siguiente video de Laboratoria Corporate Training para entender un poco\nmás sobre embudos de conversión.</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/dabcdc1789374cea928fb8fa2cd369a8\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<h4 id=\"awareness\">Awareness</h4>\n<p>Es la fase en la que los usuarios conocen que existimos. En muchas ocasiones se\nda a través de publicidad o a través de otro usuario que lo refiere hacía\nnuestro producto.</p>\n<p>Por ejemplo, la primera vez que escuchamos de Uber o de Airbnb por publicidad\no un amigo estuvimos en la fase de awareness.</p>\n<h4 id=\"acquisition\">Acquisition</h4>\n<p>La fase de adquisición es cuando un usuario viene a nuestro site o landing page,\no al app store en busca de nosotros.</p>\n<p>Por ejemplo, luego de enterarte de Uber o de ver su publicidad podrías haber\nhecho clic en la publicidad o haber ingresado a Uber.com. En ese momento es que\nestás siendo \"adquirido\" como usuario.</p>\n<p><img src=\"https://lh6.googleusercontent.com/9ZnK39JibDhJ2BLXkhW4rGGa3b1Q5Tcit3DEfLKtYzWLPlMo73Msmc7VLj9u6XfmW3QoUYpY5gkh0wRHZMxGQKpSiZr50G9WdSBtXAYMDAFtcijQNnF7_gyem810yNDm3_8o2dyqDd8\" alt=\"Airbnb\"></p>\n<h4 id=\"activation\">Activation</h4>\n<p>La fase de activación es cuando un usuario ha realizado la acción esperada en el\nproducto como dejar su email o empieza una prueba del producto.</p>\n<p>Por ejemplo, te creas una cuenta en Uber o empiezas el trial de Spotify. En el\ncaso de Laboratoria, la activación es cuando una postulante llena el primer\nformulario del landing page.</p>\n<p><img src=\"https://lh3.googleusercontent.com/X6Zup9Fsbyvk5zVMOh00pi1azMl4HTC9VmoiGCAECst-0jisR8PaTBJas7q6x901BjqSDgBRWF38Mg6aOYq6vVWlZWj0ooS2kmPtsSqZkPsYNFm0BRVsVqAEVugGuv7AvUQJX2aeeGg\" alt=\"Netflix\"></p>\n<h4 id=\"revenue\">Revenue</h4>\n<p>La venta se refiere a la primera transacción monetaria de un usuario. Cuando\nse decide y empieza a pagar por tu producto. En algunos casos la venta no es\nnecesariamente monetaria.</p>\n<p>Por ejemplo, luego de probar Spotify o Netflix por un mes te decides a pagar\nmensualmente y haces tu primer pago. Por otro lado, un ejemplo de un revenue\nno monetario es cuando una postulante de Laboratoria completa los cuestionarios.</p>\n<p><img src=\"https://lh4.googleusercontent.com/2EseO1aPHaYmbOuJkgWy7W5P49kiKSuQPFXTea2flQAqMteVG1l6_kJt4I1_d7io7HlfgDVXfuYKk1zIW2GyFLEujUATFLse8fkPQEFG-jkUNhABqWmqAgw0PbJjqouAEx3WYir7j54\" alt=\"venta\"></p>\n<h4 id=\"retention\">Retention</h4>\n<p>La retención es cuando un usuario está recomprando, o loggeandose a un producto\npor segunda vez o si es que no deja de pagar.</p>\n<p>Por ejemplo, si compras un segundo curso en una plataforma como Udemy o cuando\nte loggeas por segunda o tercera vez en Facebook o Twitter o si es que no\neliminas tu cuenta de Netflix o Spotify.</p>\n<p><img src=\"https://lh6.googleusercontent.com/2weyOoJ7t5Y2z6L61lxUET1JS1wEFS-w3BX4JCMnlhtaZ9R5UEDme-ASuyr5UxESnNjL6x7-y1QsBtYZG7a-z38s8HrYTLSPySjVFqRs8Y6ETZFQ7dC3z70EI4oS5oKRd0rzEsYytlE\" alt=\"netflix\"></p>\n<h4 id=\"referral\">Referral</h4>\n<p>La fase de referencia es cuando un usuario satisfecho refiere el producto a un\namigo o conocido.</p>\n<p>Esta fase es normalmente a través de una recomendación personal como un\ncomentario, un email o un whatsapp. Sin embargo las compañías se han ido dando\ncuenta de lo valioso de las referencias y han añadido recompensas cuando uno\nhace una referencia como Uber o Airbnb que te dan crédito cuando le recomiendas\nel servicio a alguien.</p>\n<p><img src=\"https://lh4.googleusercontent.com/jWhtUzAJeOnkUVPjROQXM5PP4HB5UPvecJTfK-2eazhuk64VUy0VwTd7reK5O3S9_eU9D83fVCKNdgUIyHkTMqZOJXgeOp-RRRUMAVN015AgrraI4ujOC3niBJ1Cuc7dqxFVahd_hBg\" alt=\"airbnb\"></p>\n",
          "order": 1,
          "durationString": "20min"
        },
        "02-lean-analytics": {
          "title": "Lean Analytics",
          "type": "read",
          "format": "self-paced",
          "duration": 20,
          "embeds": [
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/20c0622b8e9d405abb5771e11f6a8a79",
              "id": "20c0622b8e9d405abb5771e11f6a8a79"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Los productos digitales tienen sus propias métricas de éxito. Y el framework\nde Lean Analytics nos ayuda a entender mejor qué es lo que debemos medir.</p>\n<p>Mira el siguiente video de Laboratoria Corporate Training para entender un poco\nmás sobre estas métricas.</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/20c0622b8e9d405abb5771e11f6a8a79\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n",
          "order": 2,
          "durationString": "20min"
        },
        "03-landing-page-optimization": {
          "title": "Landing Page Optimization",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Un landing page o página de aterrizaje es cualquier web/vista que recibe a un\nusuario que navega en internet. Sin embargo, cuando se habla de landing page en\nel ámbito del internet y del marketing, nos referimos mayormente a una página\nweb que fue diseñada con un solo propósito en mente: conversión.</p>\n<h3 id=\"conversión\">Conversión</h3>\n<p>Dependiendo del tipo de producto en el que estemos trabajando, este tendrá\ndistintos objetivos. Y, al cumplimiento de esos objetivos los llamamos\nconversión.</p>\n<p>Algunos ejemplos de conversión pueden ser que un usuario:</p>\n<ul>\n<li>deje su email</li>\n<li>cree una cuenta</li>\n<li>descargue un documento</li>\n<li>descargue un app</li>\n<li>compre un producto</li>\n</ul>\n<h3 id=\"experimentos\">Experimentos</h3>\n<p>Dado que los landing pages son súper importantes para generar la conversión\nes muy común que se hagan muchos experimentos en estos landings. Normalmente\nse experimenta con los siguientes componentes para poder observar cuáles tienen\nmejor conversión.</p>\n<ul>\n<li>El título principal</li>\n<li>CTA (La llamada a la acción)</li>\n<li>Imagen destacada</li>\n<li>Diseño de botón</li>\n<li>Color del botón</li>\n<li>Extensión del formulario</li>\n<li>Contenido</li>\n</ul>\n<p>En muchos casos se hacen testeos A/B o A/B testings para poder comparar cuáles\nfuncionan mejor. Mira este ejemplo de Basecamp:</p>\n<p><img src=\"https://lh6.googleusercontent.com/mX_P2SlzUyk7W4R-SROznWdD7kcOB91eU0tgPK0zO7zpVW2aZMB6KclHlBpGsawYIY01Mz812ppS2uYAc6F60HqJQ4YqaMJF0Vze6iUJq_kj452OQKKfUBvvPkzQHGbLY0dmu_HX5os\" alt=\"longitud de los textos y layout\">\n<img src=\"https://lh6.googleusercontent.com/T4quRfBbEylYjn0q65HyR2Mc_NpLQ5iLy_izXOthHBYiNUbH78nJQvmBgwIBgULAjhRgiJQjUMKFasuQROCqsoeeMHQmTvSVY6sz615tnYRgd-nnJIk-yg1qtlYKv-GWElNCcOWuZGM\" alt=\"fotos\"></p>\n<p>Para medir la conversión y optimizar los landing pages, utilizamos los embudos\nde conversión o conversión funnels que vimos en una de las lecciones anteriores.</p>\n<p>Si quieres saber más sobre como optimizar landing pages mira este\n<a href=\"https://drive.google.com/open?id=1MIUwhBibzd8Axxg3VjtGtYNgslSpBJEr\" target=\"_blank\">ebook</a>.</p>\n<h2 id=\"ejercicio\">Ejercicio</h2>\n<p>Piensa en <a href=\"https://platzi.com\" target=\"_blank\">Platzi</a> e identifica:</p>\n<ul>\n<li>Cuáles son los objetivos que tiene en sus distintos landing pages</li>\n<li>Cómo es que llegan sus usuarios a estos landing pages</li>\n<li>Cómo sería su funnel/embudo de conversión y qué items mediría</li>\n</ul>\n",
          "order": 3,
          "durationString": "30min"
        },
        "04-analytics": {
          "title": "Analytics",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "embeds": [
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/60296fda2a9b48a984b38ef554f45082",
              "id": "60296fda2a9b48a984b38ef554f45082"
            },
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/44f8de995782475aa0809f4d2d6fb6aa",
              "id": "44f8de995782475aa0809f4d2d6fb6aa"
            },
            {
              "type": "video",
              "provider": "loom",
              "href": "https://www.useloom.com/share/d083454b9aa84abc963631f3b57b7b90",
              "id": "d083454b9aa84abc963631f3b57b7b90"
            }
          ],
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Como vimos en las lecciones sobre negocios, una de los motivos que hace al mundo\ndigital un gran recurso para la innovación es la calidad y las disponibilidad\nde la analítica.</p>\n<p>Pero, ¿qué es analítica?. La analítica, según <a href=\"https://en.wikipedia.org/wiki/Analytics\" target=\"_blank\">wikipedia</a>\nes el descubrimiento, la interpretación y la comunicación de patrones\nsignificativos en los datos.</p>\n<p>En un producto digital es sencillo recolectar datos ya que gracias código, se\npuede guardar de distintas maneras todo lo que pasa en un producto digital. A\ndiferencia de un producto físico, en el que podría ser muy complicado recolectar\ndatos de los usuarios, en un producto digital es fácil saber y trackear a qué\nhora entra un usuario a nuestro producto, qué opciones mira, desde que\ndispositivo se conecta, desde que ciudad/país se conecta, si intenta comprar\nalgo o si compra algo o si es un cliente que está comprando por segunda vez o\npor vigésima vez. Y todo esto es factible gracias a distintas herramientas.</p>\n<h2 id=\"herramientas-de-analítica\">Herramientas de analítica</h2>\n<h3 id=\"google-analytics\">Google Analytics</h3>\n<p>Es la herramienta por excelencia. Es una plataforma de Google utilizada para\nmedir todo lo que pasa en los sitios webs. Su integración es muy sencilla,\nes a través de un script que se coloca en el header e incluso en algunas\nherramientas es solo un código de usuario que se agrega en un formulario.</p>\n<p>Google Analytics mide básicamente el comportamiento de nuestros usuarios en\nnuestro producto y los flujos que sigue el usuario en una página o app.</p>\n<p>Datos sobre los usuarios:</p>\n<p><img src=\"https://lh4.googleusercontent.com/CrGA8qREKiIx-8Lt1jWQPZSXer0zllCpq-iE1gXfYCHfl0ob3p5i8N_hm5InrU-VNT34mENvapDaCY_0hl8CnYpW6Txv51_efDnJ_aXVvwKWxBoM2r41fQMl9Ww8GfOzCHJrKxc0R3w\" alt=\"Usuarios\"></p>\n<p>Data sobre browsers:</p>\n<p><img src=\"https://lh5.googleusercontent.com/8vAlsNT1gVC8UojdoeuqCXRClrIvEpfFsqzJXByJWeI5CvjVXf7_7foqmjMUj62hOPyXh0KNVDScdDPC-dfG6_d0KNHY-si9ItYFVp7n9limLY6_qhirmNnhozmfwsuKQHJlRzBJjqY\" alt=\"Tecnología\"></p>\n<p>Para crear una cuenta de Google Analytics anda a este <a href=\"https://www.google.com/analytics/\" target=\"_blank\">link</a></p>\n<p>Mira cómo revisar los datos de Google Analytics:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/60296fda2a9b48a984b38ef554f45082\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<h3 id=\"hotjar\">Hotjar</h3>\n<p>Hotjar es una herramienta de análitica cuya fortaleza está en mostrar heatmaps,\nclick maps y scrollmaps. En los tres casos nos muestran a través de colores las\npartes de un site donde los usuarios han interactuado más.</p>\n<p>Ejemplo de heatmap en la página de convocatoria de Laboratoria. La mayoría de\nusuarias hace clic directamente en el botón de postulación:</p>\n<p><img src=\"https://lh5.googleusercontent.com/X4UqWcvgSu6LoAP3_mhrDftk7kZ37z-zQhEYx7mDjeBSGSNXP-SO92InPmayTUwxPAMXkWq0WzQOpAN1_jC2u-_aQnZanhPG7XCHeNpci-wnFcOIIK-sv0RPB8zfHzvQfQQSCztw-uk\" alt=\"Image\"></p>\n<p>De las preguntas frecuentes estas son las que más clics reciben:</p>\n<p><img src=\"https://lh6.googleusercontent.com/CCHgOr4BaRAmqbH5w9HnWh3PfeBp6csC8AQ085imkF7YzFSuyQ3v6gxT0C-KZMvRqs3zrAakCes0gqLEHik4G3Oc8i4bDXdjfYVReVLiRj1TroUTdmvpUQtHaiNO9gBlLhOl7PoyHvk\" alt=\"Image\"></p>\n<p><img src=\"https://lh6.googleusercontent.com/6rh-601cF-lwt338vqQ5N05QfsSmhes_dwgiBeGrnAyRoBIgH72XhYOyz6Pu2Y-vFsD7S-ZLykuKEn4kutbU8iccPS_ultLeRyo48oTaTgRBTjMcnLUkxWQwhylpth95GNHiszoIVWw\" alt=\"Image\"></p>\n<p>Para crear una cuenta de Hotjar anda a este <a href=\"hotjar.com\">link.</a></p>\n<p>Mira cómo instalar Hotjar:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/44f8de995782475aa0809f4d2d6fb6aa\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n<p>Mira cómo revisar los datos de Hotjar:</p>\n<p><div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.useloom.com/embed/d083454b9aa84abc963631f3b57b7b90\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\"></iframe></div></p>\n",
          "order": 4,
          "durationString": "30min"
        },
        "05-heart-metrics": {
          "title": "Heart metrics",
          "type": "read",
          "format": "self-paced",
          "duration": 30,
          "body": "<h2 id=\"intro\">Intro</h2>\n<p>Otro tipo de métricas que utilizamos, y que están relacionadas más a la\nexperiencia de usuario son los HEART metrics, por sus siglas en inglés:\nhappiness, engagement, adoption, retention, task success.</p>\n<h3 id=\"happiness\">Happiness</h3>\n<p>Mide la satisfacción de un usuario con el producto. Regularmente es obtenida\nvía una encuesta o a través del NPS.</p>\n<p>Por ejemplo: Satisfacción al usar Spotify.</p>\n<h3 id=\"engagement\">Engagement</h3>\n<p>Mide qué tan involucrado está un usuario con el producto.</p>\n<p>Por ejemplo: # de visitas por semana o # de stories subidos o # de stories\nvistos en Instagram.</p>\n<h3 id=\"adoption\">Adoption</h3>\n<p>Mide los nuevos usuarios que están usando un producto o funcionalidad.</p>\n<p>Por ejemplo: # de actualizaciones a la última versión o las compras hechas por\nnuevos usuarios.</p>\n<h3 id=\"retention\">Retention</h3>\n<p>Mide el ratio por el cuál los usuarios están retornando a un producto.</p>\n<p>Por ejemplo: # de usuarios activos en 3 meses o # de recompras.</p>\n<h3 id=\"task-success\">Task success</h3>\n<p>Mide la eficiencia, la eficacia y el ratio de error al usar un producto.</p>\n<p>Por ejemplo: resultados de búsqueda exitosos o el tiempo de carga de una foto o\nla creación de un nuevo perfil.</p>\n<p>Si quieres saber más sobre los HEART metris mira este <a href=\"https://www.dtelepathy.com/ux-metrics/\" target=\"_blank\">link</a>.</p>\n",
          "order": 5,
          "durationString": "30min"
        }
      },
      "order": 5,
      "stats": {
        "duration": 160,
        "durationString": "2.7h",
        "exerciseCount": 0,
        "partCount": 6
      }
    }
  },
  "grades": "",
  "contributors": "",
  "books": "",
  "benchmarks": "",
  "references": "",
  "repo": "Laboratoria/bootcamp",
  "path": "topics/ux-research",
  "version": "3.3.0",
  "parserVersion": "3.0.2",
  "track": "ux",
  "locale": "es-ES",
  "stats": {
    "duration": 1320,
    "durationString": "22h",
    "exerciseCount": 0,
    "unitCount": 6,
    "partCount": 31
  }
}
